[
    {
        "Adeline": "",
        "Overview[]": "Adeline is a sweet and kind-hearted girl, who in contrast to her friends, Gage and Rodney , is shown to be more mature and sensible. Though she goes along with sneaking out and getting drunk with them, she is disgusted when they play with a walker and wants no part in it. She develops a crush on Henry and tries to flirt with him on many occasions, though these attempts generally don't work since Henry has feelings for Lydia. She greatly cares for Henry's well-being, such as telling Daryl about how he went after Lydia . In her final moments, she shows bravery and courage by fighting back against the Whisperers in a last stand.",
        "Pre-Apocalypse[]": "Nothing is known about Addy's life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "At some point in the apocalypse, Adeline joined a community called the Hilltop Colony where she lived for half her life. Outside the Hilltop's walls, Addy practices defense moves with Gage as part of her training to become a member of the Hilltop's guard under Kal 's instruction and supervision. Upon noticing a solitary Henry eating away from the other residents, Addy and her friends call him to talk with them. She tries to flirt with him and shortly after, they invite him to hang with them in the woods. That night, Henry drinks with his new friends in a shed outside of Hilltop. Gage suggests they have some more fun and takes them to a covered hole in the ground with a walker inside. However, Addy leaves as they throw rope rings at it and Rodney pees on it. When Alpha arrives outside the gates with a group of the Whisperers to offer trading Alden and Luke for her captive daughter, Addy helps search the town for Henry and Lydia , who have gone missing. She approaches Enid and informs her that she thinks she knows where Henry ran off to. Upon arriving at the cabin hideout, Addy watches on as Enid attempts to convince Henry that they must return Lydia to the Whisperers, for the safety of Alden and Luke . After Henry agrees, Addy returns with Henry, Enid, and Lydia to Hilltop. At night, she approaches Daryl and gives him a letter left behind by Henry, indicating that he went after Lydia. Addy is part of Tara 's group in charge of clearing a tree from their path to the Kingdom to ensure the roads are cleared for Alden 's convoy carrying the food and trade goods for the fair. Upon finding a downed tree, Addy remains alert and checks the surrounding area. She keeps on watch as the others help chop the tree into pieces to clear the road. Later that day, a small herd of walkers approaches the group. They get in position and remind themselves to watch for the Whisperers. When Gage is attacked by a walker, Addy rushes in and saves him. Suddenly, the Highwaymen ride up on horses and introduce themselves to Tara after helping to take down the herd. They then escort them to the Kingdom, having accepted Carol 's deal. Upon arriving at the Kingdom, Addy excitedly looks around with Gage and Rodney. Addy watches from the crowd as Ezekiel declares they've finally accomplished Rick , Carl , and Jesus ' dreams of reuniting the communities. \"Let the fair of a new beginning begin!\" Ezekiel says as everyone celebrates and applauds. While at the fair, Addy talks with Henry and apologizes for ratting him out earlier, although he claims they are on good terms. At some point later that day, Addy is somehow among the residents kidnapped by Alpha and taken away to a barn in the woods where they are about to be attacked by the Whisperers but are found by Ozzy , Alek , and D.J. , giving the group a chance to fight back. During the fight, Addy and Frankie take down a Whisperer. In the middle of the chaos, Alpha arrives and the group is subdued. She then decapitates everyone as Siddiq is forced to watch, only leaving him alive as a witness. Addy's decapitated head is later put by Alpha on one of the several pikes used for the Whisperers' border. The next day, Daryl, Michonne , Carol, Siddiq, and Yumiko find the border and watch in horror at the victims, a reanimated Addy being among them. They then put down their zombified heads to properly rest. When the group returns to the Kingdom, Siddiq delivers the tragic news and narrates how Addy and the others fought together as a family in their last moments. He finishes the story by encouraging everyone to remember the fallen as brave heroes and to honor them.",
        "Death[]": "Killed By Alpha (Alive) In order to mark a border between the land belonging to the Whisperers and the communities, Alpha disguises herself and infiltrates the fair to kidnap several residents. Afterward, she decapitates them and then places their heads on wooden pikes to mark the border, with Addy being among them. Daryl Dixon , Carol Peletier , Michonne Grimes , or Yumiko Okumura (Zombified) After finding the border, her zombified head is put down by either Daryl, Carol, Michonne, or Yumiko.",
        "Killed Victims[]": "This list shows the victims Adeline has killed: At least 1 unnamed Whisperer (Caused, alongside Frankie ) Numerous counts of zombies",
        "Appearances[]": "",
        "Trivia[]": "While Addy was not introduced until Season 9 , her character was present for all of All Out War . Furthermore, she has been at Hilltop from seemingly its inception as she states that she's lived there for almost half her life. Addy's death is referenced in \" Silence the Whisperers \" when Margo pressures Gage to attack Lydia. Addy appears in the archival footage shown at the beginning of \" A New Deal \" as Judith narrates past events of the show to the audience before the episode's story begins. The two children who witness Gregory's hanging in \" A New Beginning \" strongly resemble younger versions of Addy and Rodney . Whether or not this is them has yet to be confirmed."
    }
]