[
    {
        "Agatha": "Agatha",
        "Overview": "Agatha is a brave and valiant survivor. She is a faithful and loyal friend of Maggie , going along with any order she gives. Despite being one of the Wardens ' best fighters, she gets easily subdued by walkers. Though Maggie tries to save her, Agatha pushes her away to allow her to escape and sacrificing herself.",
        "Pre-Apocalypse": "Nothing is known about Agatha's life prior to or as the outbreak began.",
        "Post-Apocalypse": "Upon Maggie and her group's return to Alexandria after their mission at Fort Connors , she is overjoyed to see that Agatha, along with Frost and Duncan , are alive and well. Later during a meeting, Maggie explains that Agatha, Frost, and Duncan were separated and believed to have been killed after Reapers attacked their village . Agatha and her fellow Wardens agree to accompany Maggie and a group of Alexandrians to Meridian to take out the Reapers and secure the food and water supplies to feed everyone in Alexandria. Part of a group consisting of Maggie, Daryl, Alden, Cole, Elijah, Gage, Negan, Frost, Duncan, Roy, and Gabriel, the survivors utilize Negan's familiarity with the DC area to travel to Meridian. Due to the heavy rain storm, the survivors are forced to head into the subway tunnels to complete the journey. While in the tunnels, they come across hundreds of body bags, many containing walkers in them. At some point while dispatching the body bag walkers, Gage and Roy go missing, along with the group's ammo and supplies. Shortly after this realization, a large group of walkers appear, forcing the other survivors to move forward in the tunnel without being able to search for Gage or Roy. She is able to make it into a subway car before the walkers are able to catch up with her group. Agatha and the rest of the Meridian mission survivors make their way through the subway tunnels and successfully fight their way through the undead to safety, despite losing Gage , who was killed after running away from the group and becoming separated. With the storm subsided, Agatha and the rest of the group traverse down a road when suddenly Roy is shot and killed and a flying knife severs Cole's hand clean. The Reapers have launched an ambush on the survivors. After the Reapers attack his group, Agatha attempts to defend herself and avoid getting killed. With the members fragmented into smaller groups, Agatha manages to escape alive with Duncan. Later, they are found by Maggie, Negan and Alden, while she is fighting off a pack of stray zombies. Afterwards, Duncan dies of his wounds from the Reaper attack. As they are moving, walkers swarm Agatha, Maggie, Negan and Alden. Agatha fights them off, sticking her knife into rotted brains. A walker pounces on Agatha, sinking its teeth into her forearm. Maggie tries to save her, but it's too late, as she is swarm by more walkers. Agatha shoves her away, telling her to go. Negan forcibly pulls Maggie away as the walkers descend on Agatha, eating her alive. Somehow after Agatha was killed, her corpse was found by Reapers and brought back to Meridian where it was strung up at the village entrance. Agatha's corpse continues to be strung up over Meridian with the final confrontation between Maggie , Elijah , Daryl , Negan , Gabriel , Leah , Washington and Boone taking place nearby. When Maggie chases after and kills the retreating Washington and Boone, she passes by Agatha and the other corpse. After the defeat of the Reapers , Agatha's friends presumably cut her body down and give her a proper burial along with putting down the zombified Frost .",
        "Death": "Killed By Herself (Caused, Sacrifice) Zombies While fighting off the undead, a walker bites Agatha's arm. Maggie sees this and tries to save her but not before she is surrounded by more walkers. Agatha refuses assistance, not wanting to drag Maggie and the rest of the group with her, and pushes Maggie away from her and the incoming walkers. As Negan drags Maggie away, Agatha is seen being devoured by walkers. The Reapers (Before Reanimation or Zombified) After Agatha's death, her corpse is found by the Reapers and strung up in the village entrance of Meridian. Presumably, she was put down by them either before she turned or after she reanimated, as her head was still intact despite her being devoured.",
        "Killed Victims": "This list shows the victims Agatha has killed: Gage (Caused) Herself (Caused, Sacrifice) Numerous counts of zombies and possibly unnamed people",
        "Relationships": "",
        "Appearances": "",
        "Trivia": "While it was shown Agatha was overrun by a crowd of zombies and eaten alive, her corpse, relatively in good shape, was seen dangling from its feet in Meridian, alluding that a Reaper found Agatha's corpse in the woods and brought her back to Meridian. [2] Agatha appears in the final flashbacks of the last episode \" Rest in Peace \".",
        "References": "",
        "Name": "Agatha"
    }
]