[
    {
        "Alek": "",
        "Overview": "Although he only appeared in one episode, Alek is shown to be a brave and selfless survivor. He helps clear the roads to keep the route to the Kingdom safe. Later, when he, Ozzy , and D.J. find many captured residents in a barn, the three charge in with no hesitation in an attempt to save them and give them a fighting chance against the Whisperers . Though this action costs him his life.",
        "Pre-Apocalypse": "Nothing is known about Alek's life prior to or as the outbreak began.",
        "Post-Apocalypse": "At some point following the outbreak, Alek joined a group of survivors known as \" the Highwaymen \". In the woods, Alek, alongside Ozzy and D.J. , helps clear the road to keep the route to the Kingdom safe for the other communities. Later, he accompanies the others to the site where Hilde was ambushed. The group decides to split up, with Alek and his group leaving to patrol the Kingdom 's outskirts. Later, he, Ozzy, and D.J. find the tied up residents surrounded by several Whisperers in a stable. They rush inside in an act of bravery and start attacking them, giving the group a chance to fight back. In the middle of the chaos, Alpha arrives and the group is subdued and then killed, only leaving Siddiq alive as a witness. Later, Alpha puts Alek's decapitated head on one of the several pikes used for the Whisperers' border. The next day, Daryl , Michonne , Carol , Siddiq, and Yumiko find the border and watch in horror at the victims, a reanimated Alek being among them. Later, in the Kingdom, Siddiq delivers the tragic news to the crowd, tells them how brave everyone was in their final moments and how they all fought back. He encourages everyone to remember the fallen as brave heroes and to honor them.",
        "Death": "Killed By Himself (Caused) Alpha (Alive) Alek, Ozzy, and D.J. find the stable where several residents are kidnapped. They fight valiantly to rescue them, but are overpowered and decapitated alongside them by Alpha. Daryl Dixon , Carol Peletier , Michonne Grimes , or Yumiko Okumura (Zombified) After finding the border, his zombified head is put down by either Daryl, Carol, Michonne, or Yumiko.",
        "Killed Victims": "This list shows the victims Alek has killed: Himself (Caused) Possibly a few unnamed Whisperers Numerous counts of zombies and possibly unnamed people",
        "Relationships": "",
        "Appearances": "\" The Calm Before \" \" A New Deal \" (Archival Footage)",
        "Trivia": "Originally, Jason Kirkpatrick auditioned for the role of Ozzy, but was given the role of Alek instead based on his audition. [1] Alek is the only pike victim to be killed in the episode they were introduced. Alek appears in the archival footage shown at the beginning of \" A New Deal \" as Judith narrates past events of the show to the audience before the episode's story begins. Alek is the only named Highwayman who was not an antagonist at any point.",
        "References": ""
    }
]