[
    {
        "Alex": "",
        "Pre-Apocalypse[]": "Nothing is known about Alex's life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "At some point in the apocalypse, Alex joined a community called the Alexandria Safe Zone , where he was assigned as a nurse. Although unseen, Alex assists an injured Yumiko brought to the infirmary since he and the other nurses are on standby. Once Yumiko is situated at the infirmary, Alex watches over her recovery. Alex is at the infirmary and treats Henry 's leg injury after he arrives at Alexandria along with Daryl , Lydia , and Connie . Following Enid 's death , Alex moved to Hilltop to serve as the medic for the community. One night, after a tree mysteriously falls onto a house and a portion of the Hilltop's walls, a number of residents are injured. Alex is summoned and he directs the injured to the infirmary as others help set up hospital beds in the trailers to accommodate the other injured. Although unseen, Alex works in the infirmary tending to several Alexandrians, including Rosita , Judith , Gracie , and R.J. , who came to Hilltop for medical evaluations after Alexandria was attacked by the Whisperers. The Hilltop Colony was attacked by the Whisperers with their weaponized horde and flaming arrows, the latter of which caused the fire that quickly engulfed the settlement. Ultimately, it can be assumed that Alex was killed by the Whisperers or the zombies that continued to push into the burning Hilltop, as he was not seen among the several survivor groups to escape Hilltop, and was never seen at any point afterwards again. As an injured Rosita is being cared for by Eugene at the rendezvous point, Eugene comments that he will have Alex take a look at her, that is as soon as he is found, as Alex has not been among the survivors to reach the rendezvous point, which likely supports the fact that he did not survive.",
        "Death[]": "Killed By The Whisperers Zombies It can be assumed that Alex was killed by the Whisperers or the zombies that continued to push into the burning Hilltop, as he was not seen among the several survivor groups to escape Hilltop after the battle. It's unknown if he turned or not.",
        "Killed Victims[]": "This list shows the victims Alex has killed: Possibly a few unnamed Whisperers Possibly numerous counts of zombies",
        "Appearances[]": "\" Scars \" (No Lines) \" Silence the Whisperers \"",
        "Trivia[]": "Alex was credited in \" What It Always Is \" but did not appear in the episode. While Alex was not yet cast for Season 9, a stand-in actor was used for the infirmary scene in \" Scars \". Alex was indirectly mentioned by Rosita in \" Stalker \" when speaking to Gabriel that she was going to get checked out by the Hilltop doctor."
    }
]