[
    {
        "Overview": "Initially, Alfred seems to be a normal person within the community . Like Margo , a fellow Highwayman , he demands justice for the Highwaymen, and greatly desires revenge against the Whisperers for causing the deaths of Alek and Ozzy , the latter whom he stated was his best friend. He begins to bully Lydia , a former Whisperer, with Margo and Gage . At night, the three ambush her, but she is saved by Negan . However, he accidentally kills Margo in the process, which Alfred is shown to be distraught over. Alfred is shown to be sly and cunning, as he immediately throws the blame at Negan and plays the victim when confronted by the council . Later, he is shown to have no remorse and brags to a guard about how he and his friends beat Lydia up. In an ironic twist of fate, he states that the Whisperers are weak fighters, only to immediately get killed by Beta .",
        "Pre-Apocalypse": "Nothing is known about Alfred's life prior to or as the outbreak began.",
        "Post-Apocalypse": "At some point following the outbreak, Alfred joined a group of survivors known as \" the Highwaymen \". Some months after the blizzard, Alfred is among the coalition members drafted into the militia that was formed in response to the Whisperer threat. He and the other militia conduct a training exercise on the Oceanside beach. As Ezekiel and Jerry methodically release walkers from a shipwrecked boat, Alfred and the other militia work together as a unit to take out the walker threat. They are successful and return to Oceanside to rest, eat, and socialize with the Oceansiders. That night, Alfred helps put out the fire that was ignited in the woods in Whisperer territory after a satellite from outer space crashes. Alfred attends a training session in Alexandria led by Aaron but watches Gage as he begins to taunt Lydia with a mask made out of a burlap sack when she approaches them. He laughs alongside Margo and Gage when she storms away. Later that day, he is eating lunch with Margo and Gage inside the dining hall when Lydia sits at their table and guts a squirrel, in which blood shoots onto Gage's face. As Gage storms away, Alfred brings up Ozzy and Alek 's deaths to Margo and questions how they can be okay with Lydia living alongside them. That night, Alfred and his friends ambush Lydia and proceed to beat her as Alfred screams that Ozzy was his best friend. When Negan arrives and rescues Lydia, Alfred is horrified to see that Margo was killed when she was thrown off Lydia, hitting her head against a wall. Shortly after, Alfred and Gage are questioned by the council. They feed them lies and are in disbelief when the council begins questioning their story, and eventually they are let go. Alfred and another guard are inside a house helping each other put on their armor before heading out on watch duty. He brags about how he and his friends attacked Lydia and scoff at the Whisperers, claiming they can barely fight one on one. Moments later, Alfred and the man are attacked and killed by Beta , They are left to reanimate to serve as a distraction wandering around Alexandria attacking others before finally being put down.",
        "Death": "Killed By Beta (Alive) Alfred is killed and left to reanimate by Beta when he infiltrates Alexandria to be used as a distraction while he searches for Mary in the community. The Coalition (Zombified) As a reanimated Alfred and other undead residents wander around the streets, they are put down by members of the Coalition before they can attack anyone.",
        "Killed Victims": "This list shows the victims Alfred has killed: Numerous counts of zombies and possibly unnamed people",
        "Relationships": "For a more in-depth look at Alfred's relationships, read here: Alfred (TV Series)/Relationships",
        "Quotes": "The following is a list of some of Alfred's most memorable quotes.",
        "Appearances": "",
        "Trivia": "Alfred is the last named member of the Highwaymen to die. Also as of his death, no named Highwaymen are confirmed to be alive. Alfred is Beta 's first named human kill in the TV Series . Alfred appears in the final flashbacks of the last episode \" Rest in Peace \".",
        "Name": "Alfred"
    }
]