[
    {
        "Pre-Apocalypse[]": "Nothing is known about Alvarado's life prior to or as the outbreak began, except that he was an officer for the Atlanta Police Department .",
        "Post-Apocalypse[]": "Officer Alvarado and another police officer are seen driving on a rural road at night, which captures the attention of survivors Carol Peletier and Daryl Dixon , the latter of whom was in the company of someone kidnapped by the hospital and who decide to follow Alvarado's car in the hope of finding her. Officer Alvarado is seen exiting a female patient's room as Beth Greene explores the hospital ward. Later, Officer Alvarado tries to recapture Beth and Noah as they escape the hospital, however walkers surround Beth and Alvarado starts to shoot at the walkers along with Amanda Shepherd . Officer Alvarado and his colleague are driving back to Atlanta in their car as Carol and Daryl follow them. In the city, his car stops and he gets out to clear some debris from the road before continuing driving back to Grady Memorial Hospital . The next day, Officers Alvarado and O'Donnell are seen patrolling the streets of Atlanta, looking for Noah. When Carol exits a building, she is suddenly hit by their vehicle. Alvarado and O'Donnell load Carol onto a gurney and put her into the car to be taken to the hospital. Officer Alvarado, along with Officer Tanaka and two other patients, attempt to calm Percy , who is having a coughing fit, actually a charade to act as a distraction for Beth to retrieve medicine from the drug cabinet. Officer Alvarado stands with Officers Bello and Tanaka as they prepare to exchange Carol and Beth for Officers Shepherd and Licari off of Rick Grimes . He watches in surprise as Beth and Dawn are killed, but remains calm as Rick's group departs the hospital. With the multi-year time skip, the community of survivors at Grady Memorial eventually fell and everyone was killed, including Alvarado. [1]",
        "Death[]": "Killed By Unknown causes At some point, Alvarado and all the other Grady Memorial residents died due to unknown causes.",
        "Killed Victims[]": "This list shows the victims Officer Alvarado has killed: Numerous counts of zombies",
        "Appearances[]": "",
        "Trivia[]": "The actor confirmed his character's name on Twitter and hints that he may be one of the bad cops. [2]",
        "References[]": "",
        "Name": "Alvarado"
    }
]