[
    {
        "Alvaro": "Alvaro",
        "Overview[]": "Alvaro is a fearless, selfless, and caring man. As a soldier for the Kingdom , he is loyal to his allies and is more than willing to risk his life for his friends, especially his king Ezekiel . He's also somewhat humorous, shown with his interaction with Carol. After a Savior guns down his fellow soldiers, Alvaro is one of the only people to survive. When he sees Ezekiel injured, he refuses to leave him behind. However, Gunther ends up shooting Alvaro in the back, killing him, much to Ezekiel's horror. He's later avenged by Jerry who kills Gunther by chopping him in half.",
        "Pre-Apocalypse[]": "Nothing is known about Alvaro's life prior to or as the outbreak began, except that he had a father.",
        "Post-Apocalypse[]": "At some point in the apocalypse, Alvaro and his father joined a community called the Kingdom. Over time, he became one of Ezekiel 's closest soldiers. Alvaro was present at the time of the arrival of a notorious group of survivors named the Saviors who operated on behalf of Negan . Upon meeting, the Saviors demanded a portion of supplies in exchange for leaving the community unscathed, to which Ezekiel complied under the condition that the Saviors would never step foot inside the Kingdom. Throughout the following months, Alvaro aided his group in gathering supplies in order to compensate the Saviors demands and thus he took part in several conducted weekly trades between the two groups, which he alongside Ezekiel, and several others kept secretly hidden from the rest of the community. Alvaro attends the feral pig hunt with Ezekiel , Morgan , Benjamin , Richard , Dianne , and Jerry. He helps lure the pigs into a garage. After the pigs are loaded up in the truck, he returns to the Kingdom with the others. Alvaro later attends the exchange with the Saviors and raises his weapon after Jared attacks Richard, but the situation is defused by Ezekiel. Alvaro rides with Richard to retrieve Jesus from outside the Kingdom's walls. When approaching Jesus' car, Alvaro hollers out to Jesus and his friends, demanding to know who they are. He then listens on as Richard addresses Rick and the Alexandrians before escorting all of them to the Kingdom. Alvaro is at the Saviors exchange with Ezekiel and the rest of his court, waiting for Gavin and his band of men to arrive. He witnesses the heated exchange between Richard and Jared before the Saviors finally leave. Afterwards, he returns to the Kingdom with the others. Alvaro later goes along with Ezekiel and the other Kingdomers at Carol 's house to deliver a casserole. As Carol says goodbye, Jerry hands her some cobbler which she accepts before telling them to go. Alvaro picks cantaloupes from the Kingdom garden and loads them into a wheelbarrow for the Saviors' supply drop. Later that day, he helps the others search the area when the road is blocked by a row of shopping carts and they come across an empty grave. He helps to clear the carts and they continue on their way. When Gavin tells them to hand over their weapons, Alvaro raises his gun. He then watches in horror as Benjamin is shot in the leg by Jared. He helps load him on to the truck and drives to Carol's house. The next day, Alvaro accompanies Ezekiel and the other Kingdom residents as they load another cantaloupe onto the truck. He later watches helplessly as Morgan strangles Richard to death. He and the others then leave at Morgan's request. Alvaro follows Ezekiel as he leads a regiment from the Kingdom toward Alexandria. Later that day, he and the rest of the Kingdom residents arrive just as Negan is about to execute Carl and begin to kill the Saviors. He works alongside Ezekiel throughout the battle. After the Saviors and Scavengers retreat from Alexandria, Alvaro is then present for Rick, Maggie , and Ezekiel's speech to the communities, all united and ready for war. Alvaro is among the militia to listen to the leaders' speeches before they launch their assault on the Sanctuary . After successfully ambushing the Saviors' headquarters, he and the others leave in their vehicles so the incoming horde may swarm the factory. Alvaro then joins Ezekiel as he leads another group towards a third Savior outpost. They see a Savior guarding the front entrance and shoot at him. However, they all miss and the Savior ducks behind a car for cover. He then throws a smoke grenade at the group which explodes, creating a big cloud of smoke. Alvaro is among the Kingdommers to hunt down Nelson . After a while, he is eventually hunted down and mauled by Shiva. Alvaro and the Kingdommers then regroup in the woods, where they hear on the radio that the nearby Savior outpost is sending out an active patrol, indicating that they know the Kingdommers are coming. Despite the concern of his closest advisors, Ezekiel is unfazed, and confidently prepares for the upcoming attack. Alvaro is among the Kingdommers to successfully ambush two groups of Saviors as they proceed in clearing out the different buildings that make up the outpost controlled by Gavin's men. After Ezekiel realizes there's a gun aiming for his group, he orders everyone to scatter, including Alvaro. Alvaro is one of the few Kingdommers who survives the machine gun attack. He refuses to leave an injured Ezekiel behind and helps him to his feet after killing a reanimated Daniel . While aiding him in walking, the two come across another herd of reanimated Kingdom soldiers, as well as Saviors. As Alvaro is about to suggest a way around them, Gunther shoots him through the back from behind, killing him instantly. Ezekiel attempts to see if he is still alive, but Gunther grabs him and drags him away from Alvaro, as well as the oncoming herd.",
        "Death[]": "Killed By Gunther As Alvaro takes Ezekiel to safety, Gunther comes up from behind and shoots Alvaro in the back, killing him instantly. It's most likely that his body was devoured by the approaching herd of walkers. It is unknown if he reanimated.",
        "Killed Victims[]": "This list shows the victims Alvaro has killed: Daniel (Zombified) 3 unnamed Kingdom soldiers (Zombified) At least 20 unnamed Saviors (Alongside his fellow Kingdommers) Numerous counts of zombies",
        "Appearances[]": "",
        "Trivia[]": "Alvaro may be the TV counterpart of another resident of the Kingdom, from the Comic Series, considering they had the same dialogue. Alvaro was the only Kingdom soldier (other than Jerry ) to survive the Savior's bullet barrage at the end of \" Monsters \".",
        "Name": "Alvaro"
    }
]