[
    {
        "Amanda Shepherd": "Amanda Shepherd",
        "Overview[]": "Among the cops at Grady Memorial Hospital , Amanda is shown to be one of the most good-hearted and friendly. She is one of the few who are not corrupt and generally seems to want the best for everyone. After she is captured by Rick 's group, she is civil and respectful with them. She and Licari agree to help make a deal with their leader Dawn to get Carol and Beth back, even lying about Rick killing Bob Lamson . During the trade, Amanda and Licari honor their deal and the trade goes smoothly at first. However, the situation escalates when Dawn asks for Noah , prompting Beth to stab Dawn. After Daryl kills Dawn for killing Beth, Amanda takes control of the situation and makes sure no one else gets hurt. She seemingly becomes the new leader of the Hospital. She agrees to let Noah go and even offers to allow Rick and his group to stay at the hospital, though he declines.",
        "Pre-Apocalypse[]": "All that is known about Amanda's life prior to the outbreak is that she lived in Atlanta, Georgia, and worked as an officer for the Atlanta Police Department . When the outbreak began, she and the other members of the APD were tasked with evacuating the staff and patients of Grady Memorial Hospital to the evacuation zone, but they were unsuccessful after the military napalmed the evacuation checkpoints. She and the other officers were forced to return to the hospital where they remained until food began to run out. From then, they turned to Hanson , and, later on, Dawn Lerner for leadership and keeping their community going.",
        "Post-Apocalypse[]": "Amanda Shepherd is first seen bringing Gavin Trevitt into the hospital room after he is found injured, from falling off a building. Later she is on watch, while newcomer Beth Greene folds laundry. When Dawn Lerner walks into the room, she relieves Shepherd of her duty, and she walks out of the room. When Noah and Beth try to escape the hospital grounds, she, along with Officers Alvarado and O'Donnell arrive to restrain Beth and to dispatch the zombies wandering the hospital exit. Shepherd, on rooftop duty, alerts Dawn that gunshots have been heard in the city. She is dispatched with Bob Lamson to investigate. They find Noah , a recently escaped ward from the hospital, and apprehend him, but are then captured by Rick Grimes , Tyreese Williams , Tyreese's sister Sasha , and Daryl Dixon . However, Officer Licari arrives and creates a distraction, allowing Shepherd and Lamson to escape. Rick and his group give chase and eventually capture the police officers to be used to retrieve Beth and Carol Peletier , who was also recently captured. While in captivity, Shepherd tries to explain that Dawn won't trade Rick's friends for her or Lamson and Licari, stating that Lerner wants Lamson gone. After Lamson, who attempted to escape back to the hospital, is killed by Rick, Shepherd offers to support the group's exchange plan and states she will claim Lamson was eaten by walkers, a lie Licari also agrees to go along with. Shepherd remains in captivity until she is brought to the hospital to complete the trade. True to her word, Shepherd tells Dawn that walkers killed Lamson and is turned over to the other officers. When Dawn is killed by Daryl after Dawn kills Beth, she orders the officers to stand down. She then reminds both groups that there's no need for anymore fighting because it was all about \"her\", meaning Dawn. And with Dawn dead, the other officers had no reason to follow her rules or fear her. She then shows she means it by agreeing to let Noah go free without any resistance. She suggests Rick and his group remain at the hospital, but Rick declines her offer. With the multi-year time skip, the community of survivors at Grady Memorial eventually fell and everyone was killed, including Amanda. [1]",
        "Death[]": "Killed By Unknown causes At some point, Amanda and all the other Grady Memorial residents died due to unknown causes.",
        "Killed Victims[]": "This list shows the victims Amanda has killed: Numerous counts of zombies and possibly a few unnamed people",
        "Appearances[]": "",
        "Trivia[]": "Shepherd's first name was revealed in a deleted scene for \" Crossed \". Teri Wyble, Amanda's actress, stated on Twitter that she believes Amanda & the other Grady Memorial residents are still alive, albeit low on supplies. This was later debunked by Greg Nicotero during a live Q&A. [1] Though unconfirmed, it appears that Amanda has assumed leadership of Grady Memorial Hospital as a result of Lerner's death; the officers follow her order to stand down unquestioningly, and she demonstrates a degree of authority when telling Rick and his group that they could stay there. Whether this is due to a hierarchy of command or the officers actually respecting and trusting in her leadership remains to be seen.",
        "References[]": "",
        "Name": "Amanda Shepherd"
    }
]