[
    {
        "Amber": "",
        "Overview[]": "Due to not being able to work and needing medication for her mother, Amber volunteered to be one of Negan 's wives. However, overtime this takes a tole on Amber's mental state. After Negan finds out that Amber had been cheating on him with Mark , Negan has Mark punished by burning him with the iron. This causes Amber to become extremely depressed and believes being Negan's wife is a fate worse than death. When Eugene is allowed to hang out with Negan's wives, unlike Frankie and Tanya who play with him, Amber sits away from the group and drinks with a very cynical attitude.",
        "Pre-Apocalypse[]": "Nothing is known about Amber's life prior to or as the outbreak began, except that she had a mother.",
        "Post-Apocalypse[]": "At some point in the apocalypse, Amber and her mother somehow came into contact with a group named \"the Saviors\" which they subsequently joined, during where she developed a relationship with her fellow survivor Mark . Due to her mother needing medication and not being able to work, Amber volunteered to become one of Negan 's \"wives\" to get things for free to provide for her mother. However, Amber and Mark still had lingering feelings for each other. When Negan is informed that Amber cheated on him with Mark, he confronts her as he gives Carl a tour around the Sanctuary . He explains that she can go back to Mark and work for points if she wants to or she can stay with him. Amber pleads she loves Negan and that she is sorry and won't make that mistake again. Later that day, Amber stands with the other wives and is petrified to witness Mark's face being ironed by Negan as Sherry consoles her. When newcomer Eugene gives a solution to preserving the walkers used at the gates, Negan allows him to spend that night with his wives but with the only condition of not having sex with them. At night, Amber, Tanya , and Frankie watch Eugene as he plays video games. However, she sits away from the group, drinking motionless and not listening. Shortly after, the wives accompany Eugene outside and watch as he makes a homemade bomb. As Frankie and Tanya clap giddily, Amber continues to drink depressed still thinking of Mark. The next day, she is present on the factory floor when Dr. Carson is accused of freeing Daryl and is thrown into the furnace and burnt to death as a result of his actions. Amber walks around with Frankie and Tanya at the Sanctuary as the Saviors prepare for the final assault. At some point following Rick's assumed death, the Sanctuary eventually falls as a community, with most of its residents integrating into Alexandria, Hilltop, and the Kingdom, however, Amber was one of the many residents to leave the Sanctuary and find safety on her own. [1]",
        "Killed Victims[]": "This list shows the victims Amber has killed: Possibly numerous counts of zombies",
        "Appearances[]": "",
        "Trivia[]": "In a deleted scene from \" Wrath \", Amber is present with Frankie and Tanya and hundreds of other Saviors in the Sanctuary as they listen to Negan's speech about wiping out the survivors with Eugene's bullets.",
        "References[]": ""
    }
]