[
    {
        "Ancheta": "",
        "Overview[]": "Ancheta is a ruthless survivor who takes part in his group's attacks. He is the group's engineer which most likely makes him one of the most intelligent Reapers . He is responsible for making the Hwacha , which is used to take out Maggie 's entire herd. Although loyal to the Reapers, he is shown to be slightly uneasy with Pope 's leadership, such as being visibly intimidated when Pope yells at him and Washington . Later, Pope orders Ancheta to fire the Hwacha down at the courtyard despite some of the Reapers still being down there. Ancheta is hesitant about this and only does it when Pope yells at him to get on with it. After Leah stabs Pope in the neck, Ancheta is visibly horrified but has a knife thrown into his chest by Daryl before he can intervene. Ancheta's death is what partially motivates Leah to stay with the Reapers, as she is visibly saddened when she looks at his corpse.",
        "Pre-Apocalypse[]": "Prior to the outbreak, Ancheta was fighting in Afghanistan along with the rest of his squad which included a lot of members that would eventually become the Reapers . Upon returning from war, he struggled to find jobs or deal with trauma, but the relationship between him and his comrades remained strong. He then decided to become a mercenary.",
        "Post-Apocalypse[]": "During the beginning of the outbreak, as Operation Cobalt was put into action in an attempt to try and contain the undead threat, Pope and a group of his people managed to escape the bombings by running until they reached an abandoned church, where inside Pope was amazed to see none of them had been killed or injured, leading him to view him and his comrades as \"the chosen ones\". It is unknown if Ancheta was present during this revelation. Regardless, he eventually joined the Reapers, and either found or crafted his own mask with a half-smiling skeletal expression on it, and would use this mask as a scare tactic against those who were \"marked\" by Pope. At some point, Ancheta and his group eventually attacked a group of survivors led by Maggie Rhee despite having no previous hostilities with her group and succeeded in destroying their camp and killing numerous members of her group, causing them to flee to Virginia. He and his group eventually followed them to finish them all off due to his leader, Pope marking Maggie's group. Ancheta and at least a dozen Reapers appear on a dark road adorned on both sides with bodies hanging from posts. Suddenly, the Reapers open fire on Maggie and her group, killing Roy and severely injuring Cole. As the Alexandrians flee into the woods, the Reapers chase after them. Chaos breaks out in the woods as Ancheta and the Reapers hunt down members of Maggie's group, killing Cole and injuring several others, including Duncan, Negan, Daryl, and Gabriel. While Daryl is being taken in for interrogation by Carver and Powell , Ancheta can be seen amongst his comrades within Meridian . He is later seen waiting with his fellow Reapers as Pope declares Daryl 'forged by fire.' Ancheta is seated around the campfire eating dinner with his fellow Reapers including the newly recruited Daryl Dixon. He is shocked and disturbed when Pope horrifically kills Bossie by throwing him in the fire. Ancheta accompanies Washington on a sortie to locate Maggie's group, but fails to find any tracks. For this, he and Washington are admonished by Pope, until Leah comes to their defense. Later that day, Ancheta is seen on Meridian's perimeter wall keeping watch. Ancheta is among the Reapers on the wall speculating why the herd of undead in the distance are meandering around like that. He is present when Pope declares Wells dead. Later, when the walker herd begins ascending upon Meridian, Ancheta is ordered to prepare the Hwacha he built on one of the building rooftops. On the roof, he adds the final touch to the weapon as Daryl and Leah have a hushed discussion about family. When Pope orders Ancheta to fire the Hwacha down at the courtyard despite some Reapers being in the line of fire, Ancheta hesitates until Pope yells at him to get on with it. When Leah betrays Pope and mortally wounds him, Ancheta tries to intervene, but is slain when Daryl throws a knife into his chest. Ancheta's death is partially what motivates Leah to stay with the Reapers, as she sees them as her family.",
        "Death[]": "Killed By Daryl Dixon Ancheta is hit in the chest with a knife thrown by Daryl. He was most likely put down by Leah or one of the other Reapers on the rooftop.",
        "Killed Victims[]": "This list shows the victims Ancheta has killed: Ms. Adams (Possibly) Leo (Possibly) Teresa (Possibly) Roy (Possibly) Duncan (Possibly) Numerous counts of enemy combatants (Pre-Apocalypse) Possibly unnamed Meridian residents Numerous counts of zombies and unnamed people",
        "Appearances[]": "",
        "Trivia[]": "For an unknown reason, Ancheta is not mentioned in the Talking Dead memorial for \" For Blood \"."
    }
]