[
    {
        "Andrew": "",
        "Fate": "",
        "Contents": "",
        "Overview[]": "Although his personality is not well known, Andrew is seen as a sly, cunning and docile young man. Although shown to be somewhat cowardly, Andrew is also shown to be capable of extreme violence and cold-blooded murder and is indeed a dangerous individual. He is shown to be completely loyal to the leader of the prisoners, Tomas, as evident by his horrified reaction to Tomas' brutal murder at the hands of Rick and his desire to bring revenge upon Rick and his group by killing them all and retaking the prison. It appears that Andrew holds respect for his fellow prisoners, as evident by him wanting Rick to help Big Tiny after his infection. He did seem oblivious that Oscar and Axel held grudges against him due to his loyalty to Tomas, as before his demise he believed that Oscar would favor him over Rick, which Oscar clearly did not as he killed him to establish his own place in Rick's group.",
        "Pre-Apocalypse[]": "Nothing is known about Andrew's life prior to or as the outbreak began, except that he was a convicted criminal being held in the prison for an unknown crime.",
        "Post-Apocalypse[]": "At the onset of the outbreak, a riot started at the prison. Andrew, Tomas, Oscar, Big Tiny, and Axel were escorted to the cafeteria by a guard. They were locked inside as the guard went out to call for backup, but he never returned. The five inmates then spent the next 10 months locked inside the cafeteria, without knowing what was going on outside, surviving off the large amount of food left in the cafeteria. Andrew appears after Daryl Dixon , Rick Grimes , Glenn Rhee , T-Dog , and Maggie Greene break open the cafeteria's door to escape walkers to amputate Hershel Greene 's leg. Similar to the other prisoners, Andrew is confused about what was going on. He is shocked after being told by Rick about what has happened to the world. When Tomas claims the prison as theirs, Andrew stands with him, but they end up accepting Rick's offer to give half of their food in exchange for help clearing Cell Block B for the prisoners to live in. On their way to the cell block, while fighting walkers, Big Tiny is scratched and is told by Rick that there is nothing they could do about his infection. Andrew stands up for Big Tiny, desperately pleading to Rick that there must be a way to save him and calls Rick a son of a bitch when he again claims nothing can be done. Andrew witnesses Big Tiny's brutal death at the hands of Tomas, but doesn't show much feeling about it. While clearing out the laundry room, Tomas attempts to kill Rick twice and after a tense standoff, Rick kills Tomas by hacking into his skull with a machete. Furious over the death of his friend, Andrew attempts to attack Rick, but is easily knocked down and disarmed. Andrew flees the room and runs down the corridors attempting to evade Rick, who is pursuing. Eventually, Andrew ends up in a courtyard filled with walkers which begin to approach him. Fearful he attempts to reenter the prison, but Rick, out of revenge for Andrew attacking him holds the entry gate shut. Andrew begs to be let back in but Rick only tells him \"you better run.\" Andrew then attempts to avoid the walkers closing in on him. As Rick turns to leave, he hears Andrew's screams, and presumes he was eaten alive. Later on in the episode, a mysterious figure is seen spying on Carol Peletier from the tree line. At the beginning of the episode, a mysterious figure is seen dragging a deer carcass to the prison gates, and begins to lure walkers into the prison. After breaking the secure lock on the gates with an axe, the figure then leaves a heart on the ground and disappears into the prison. Later on, after walkers begin to flood the prison, the prison's alarms are activated, and Rick, Daryl and Oscar go to shut them down before more walkers arrive. While Daryl is busy holding a door shut, and Rick and Oscar are shutting the alarms down, Andrew appears, revealing that he is the mysterious figure (also from the episode \"Sick\") and that he escaped from the walkers Rick left him in. He then tries to strike Rick with an axe, but misses. Andrew then strikes Oscar in the face with the ax and Rick attacks Andrew, and the two engage in a fight. Rick attempts to shoot Andrew though he kicks his revolver out of his hand and the two continue to scuffle. As Andrew gets back to his feet and prepares to strike Rick with the ax, Oscar throws a barrel at his head and picks up Rick's gun and points it at Rick. Andrew gets back to his feet and tells Oscar to shoot and kill Rick, which will allow them to reclaim their prison. Oscar however hesitates and Andrew questions him of what he's waiting for and tells him to shoot Rick again. However, Oscar turns the gun on Andrew and shoots him in the head, killing him. Although he is killed by Oscar, Andrew's attack on the prison is not without tragedy as T-Dog is bitten and eventually killed by the walkers Andrew lured in and Lori in all the commotion of the attack goes into labor and sacrifices herself in order to give birth to her baby.",
        "Death[]": "Killed By Oscar After leading a horde of walkers to the prison, Andrew attacks Rick in the prison's generator room. During their scuffle, Andrew kicks Rick's gun out of his hand, which is picked up by Oscar after he throws a barrel at Andrew's head. Oscar initially points the gun at Rick, as Andrew encourages him to kill Rick. However, Oscar shoots Andrew in the head, killing him.",
        "Killed Victims[]": "This list shows the victims Andrew has killed: Theodore Douglas (Caused) Lori Grimes (Caused) 1 deer Numerous counts of zombies and possibly unnamed people",
        "Relationships[]": "For a more in-depth look at Andrew's relationships, read here: Andrew (TV Series)/Relationships",
        "Appearances[]": "",
        "Trivia[]": "In \" Sick \", just after Andrew's screams stop, there's noise suggesting that he managed to climb the fence despite the barbed wire on top."
    }
]