[
    {
        "Andy": "",
        "Overview[]": "Initially, Andy and Rick 's group start off on the wrong foot when Ethan stabs Gregory to save Craig . This causes a fight, with Andy almost choking Abraham to death. After Rick kills Ethan, Andy is enraged. However, after he cools off and is asked by Rick to help take down the Saviors , Andy agrees and lets go of his animosity. Andy plays a pivotal part during the Satellite Outpost raid, acting like they have Gregory's head, allowing the group to kill the two guards and storm the base. Andy goes on to become a member of the militia and shows much bravery until his death.",
        "Pre-Apocalypse[]": "Nothing is known about Andy's life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "Andy survived the early stages of the outbreak and took residence in a FEMA camp where he was later evacuated to a safe-zone named the Hilltop Colony , upon where Andy settled into the farming community where he became integrated with the fellow residents, most notably Gregory and Paul Rovia , and thus became a prominent member. Andy was present at the time of the arrival of the Saviors , a notorious group of survivors who demanded half of the Hilltop's supplies in exchange for leaving the farming community unscathed. Though initially reluctant to comply the Saviors demonstrated their motives through publicly executing a 16-year-old resident Rory . Following this barbaric event, the colony entered into a period of dread and submission and thus were forced to comply under Negan 's rule, were due to their limited resources and manpower they were unable to rebel against their savage oppressors. Throughout the following months, the community begrudgingly began to gather supplies to present towards the Saviors in their desperate attempt to keep them at bay. Andy was assigned as a member of a supply group tasked with routinely delivering a portion of supplies directed towards one of the Saviors compounds.",
        "Death[]": "Killed By The Saviors Andy, Freddie, and Morgan prepare to kill some Saviors behind a door. One of the Saviors opens the door and Freddie kills him, but the other Saviors inside the room return fire. Both Andy and Freddie are shot multiple times and die, while Morgan is knocked unconscious. The Militia (Before Reanimation or Zombified) Andy is found by the Militia, either before reanimation or zombified, and has his brain destroyed before being taken back to Hilltop to be buried in the town graveyard.",
        "Killed Victims[]": "This list shows the victims Andy has killed: Possibly numerous counts of zombies",
        "Appearances[]": "\" Knots Untie \" \" Not Tomorrow Yet \" \" Rock in the Road \" \" Mercy \" \" The Damned \"",
        "Trivia[]": "Andy is the first named character to die in Season 8 . Andy is one of five Hilltop residents to be an antagonist, the others being Ethan , Gregory , Earl Sutton , and Gage ."
    }
]