[
    {
        "Anna": "",
        "Fate": "",
        "Contents": "",
        "Overview[]": "Anna is a kind-hearted woman, though like many in Alexandria , she is a weak survivor with no experience outside the walls. She is forced to witness many traumatizing events, including the Wolves slaughtering many people. Unlike many others however, she does seem to remain mostly not combat-proficient, as she is one of the few not to go out and help take down the herd in Alexandria, opting to instead stay inside and look after Judith .",
        "Pre-Apocalypse[]": "Nothing is known about Anna's life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "At some point in the apocalypse, Anna joined a community called the Alexandria Safe Zone . Having survived the deadly attack by the Wolves on Alexandria, Anna is among the many townspeople gathered the front gate, listening to the growing horde forming on the other side of the walls. Pacing back and forth near Barbara and Olivia , Anna is very worried about the unfolding situation and listens to Rick and Aaron when they address the crowd. She is shocked to witness Deanna give up as their leader by walking away from her neighbors. Later that afternoon, she is among a crowd of concerned citizens, including Barbara, Bruce, and Kent , to raid the pantry and ignore Olivia 's pleas to stop until they are eventually calmed down by Spencer . A short time later, Anna and a group of neighbors watch in horror as Jessie is forced to put down a zombified Betsy in the latter's home. When the herd broke into Alexandria, Anna, Tobin , Bob Miller , and Kyle were among the many townspeople to seek refuge inside the church. That night, she was praying when Father Gabriel approached her with baby Judith and asked her to look after the child, to which Anna agreed. She then listened as Gabriel gave a speech to the crowd about having courage to save their town from the herd, to which several Alexandrians are inspired to join him. Anna is seated between Bruce and Aaron during the meeting in the church, listening to Rick's speech about the danger of the Saviors . When Rick asks if anyone objects to the idea of attacking the Saviors for supplies from the Hilltop Colony , she remains silent. Anna stands outside near the front gate with Bruce and Scott watching Negan and his Saviors enter Alexandria in trucks and on foot. They are helpless and watch in disbelief as the Saviors prepare to ransack the houses and loot what they want. Later that day, she is seated next to Scott in the church and is among the townspeople present when Rick informs them that he is no longer in charge and that all guns need to be turned over to the Saviors. Anna is among the several Alexandrians killed during the Saviors' grenade attack on Alexandria, having been unable to evacuate safely into the sewers in time with the other residents. [1]",
        "Death[]": "Killed By Negan Smith (Caused) The Saviors Anna is among the residents killed when Alexandria is attacked by the Saviors with grenades as she wasn't able to safely evacuate into the sewers in time.",
        "Killed Victims[]": "This list shows the victims Anna has killed: Possibly a few zombies",
        "Relationships[]": "",
        "Appearances[]": "",
        "Gallery[]": "For more images of Anna, please visit Anna (TV Series)/Gallery .",
        "Trivia[]": "Originally, Anna was supposed to appear in the episodes \" Mercy \" and \" How It's Gotta Be \" but all of her scenes were cut. During the filming of Season 8, actress Vanessa Cloke moved away and was no longer readily available for filming, which contributed to her eventual off-screen demise as she was no longer working on the show.",
        "References[]": ""
    }
]