[
    {
        "Pre-Apocalypse[]": "In the early 1990s, Annette and her son, Shawn, moved onto the Greene Family Farm when she and Hershel Greene married. They both presumably helped work on the farm along with the rest of the Greene family. Shortly after their marriage, she became pregnant with their daughter, Beth.",
        "Post-Apocalypse[]": "Sometime after the initial outbreak, Annette was killed by walkers along with her son Shawn . Before their initial reanimation, however, Hershel placed them both inside of the barn to roam freely. Maggie relates her sadness for the death of Otis to her sadness for the deaths of Annette and Shawn. She points to pictures of each of them that are hung on the refrigerator. Maggie brings up Annette in a conversation with her father, reminding Hershel of her anger and depression years back when he married Annette and moved her into their house. Towards the end of the episode, Shane Walsh unlocks the doors of the barn. One of the walkers that stumbles out is Annette. Annette's body is seen among the other dead walkers. A distraught Beth hovers over her mother's corpse unaware that she hadn't been killed. She attacks Beth, and as the group gets the girl free from her grasp, Andrea Harrison impales Annette through the head with a scythe , finally putting her down. Later on, she is buried with her son, Shawn, and Sophia Peletier under some trees by the barn. At the Manhattan Tribespeople 's base, Maggie looks through a box of old photos of her family, including Annette.",
        "Death[]": "Killed By Zombies (Alive) Annette and her son are both somehow bitten by walkers. Sometime later, she reanimates and is put in the barn. Andrea Harrison (Zombified) During Shane's rampage of opening the barn, a zombified Annette comes out of the barn and is shot in the cheek by Daryl with his shotgun. After shooting everyone in the barn, Beth runs up to her mother's corpse not realizing that she wasn't fully killed. Her zombified mother attacks Beth as she tries to get away before Annette is impaled through the head with a scythe by Andrea.",
        "Appearances[]": "",
        "Trivia[]": "Annette is credited as Hershel's Walker Wife in \" Nebraska \".",
        "Name": "Annette Greene"
    }
]