[
    {
        "Annie Smith": "",
        "Overview[]": "Annie is a kind and helpful individual and seems to be a leading figure for her group . When Toby orders for his troopers to kill anyone who doesn't talk, she inspires her group to stick together, and reassures them that they have survived through far worse situations. She and Negan have a loving relationship and trust each other very much. She is well-aware of the horrible things Negan has done in the past, but believes that everyone left alive in the world has done horrible things, including herself.",
        "Pre-Apocalypse[]": "Nothing is known about Annie's life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "At some point in the apocalypse, Annie joined a community called Riverbend . In a flashback to twelve hours ago, Jesse flees the complex to unhitch his horse. Negan emerges from the woods with Annie and realizes Aaron and Gabriel are at the complex. Negan gives Jesse a map to Hilltop and asks him to tell Maggie that Gabriel and Aaron are in trouble. Jesse gets on his horse. Annie and Negan sneak into the building and overhear Carlson talking to Aaron. When Carlson runs outside, Annie kills Gabriel's guard as Negan cuts Gabriel's bonds. They flee as Carlson finds the dead guard. Annie, Negan and Gabriel hide in a room with others from the complex. Annie tells Gabriel she doesn't know anything about stolen weapons. Negan's group hears the screams of victims plummeting to their death. Carlson orders his troopers to kill anyone in the building who won't talk. Annie tells her group to stick together and reminds them that they know the building better than the troopers do. While searching an apartment, Annie's group runs into Maggie . She holds Maggie at gunpoint, but Elijah and Lydia turn their weapons on Annie. Negan calms both parties down, as he tells Annie he knows Maggie. They're brought to a secret room where Gabriel and other residents are hiding. Maggie asks Annie if her people stole the Commonwealth guns and hijacked the convoy. Speaking for Riverbend, Annie tells them they didn't take the guns. Maggie's mission is to get the Riverbenders out of the building, but Annie says they can't leave until the rest of her people are out of hiding. Annie proposes they split into teams and sweep each floor to rescue survivors. She leaves with Maggie, while Negan stays behind. Negan reveals to Aaron's group that he's married to Annie. Gabriel insists they didn't know Carlson's ulterior motives when they came to the complex. Annie radios Negan and tells the group to mobilize. Negan sees something troubling outside the window. Annie and Maggie hide while Carlson's team continues to sweep the complex. Annie reveals that she's pregnant with Negan's baby. Negan radios Annie to tell her the troopers found Hershel , but he vows to protect Hershel. Maggie asks why Annie is with Negan despite knowing what he's done. Annie says they've all done things they're not proud of and can only try to be better now. Carlson leads troopers through the building. Annie and Maggie radio Gabriel and Aaron with a plan. Maggie and Annie enter the roof, Aaron guns down Carlson, sending his body toppling off the roof, and he is devoured alive by walkers. Annie regroups with her people as Negan advises Hershel to help Maggie rebuild their community and then come find him in a few years to settle the score. Maggie, Elijah , Marco , and Hershel meet Lydia at a hideout which many Riverbend residents are hiding in, including Annie and Negan. Maggie asks her and Negan to look after Hershel until the fight with the Commonwealth is over. After the fight is over, Annie and the other residents climb out of the bunker. After Hershel shoves Negan away, he runs over to Annie who puts her arm around him. Inside an abandoned building, Annie and Negan meet up with Daryl and Maggie, while hiding from Lance and his troopers . Maggie inquires about the whereabouts of Hershel , only to be reassured he's safely with Elijah and the others from Riverbend . With Lance and his men approaching the building, the group tries to devise a plan regarding their people still back at the Commonwealth , particularly the children such as Judith and Gracie . When at a crossroads of deciding whether to fight Hornsby or get back to the Commonwealth, Daryl realizes they can do both: Negan hasn't been seen or targeted by the community's leaders yet, and will therefore be able to and get to Carol and the others without being arrested. Negan agrees, despite Annie's objections that he go alone, and reassures her that only one of them need to put themselves in the compromising position. He promises her that they will reunite. Later, Annie is seen distracting a trooper as he attempts to radio for reinforcements, giving Maggie the chance to come up from behind and stab him in the back. Maggie throws the radio and breaks it. Annie is seen with the group as Carol explains the deal she made with Pamela, who will provide all the supplies they need to rebuild on their own and let them go free. Whether they want to go back to their old communities or stay at the Commonwealth is up to them. In return, Pamela will have Lance to frame for Sebastian 's crimes. Annie says they'll have more time to talk about the situation with their people, but Negan points out that the Commonwealth killed most of their people. Maggie says the most important thing is everyone is together and doesn't want to go it alone anymore. In a hospital , Annie and Negan are shown the baby on an ultrasound. The doctor comments that her amniotic fluid is a little high, but they caught it early so they can keep an eye on it. She walks away leaving the two to talk. Annie reassures Negan everything will be fine. She believes that staying at the Commonwealth isn't an option since there are people looking to them. Negan says he hears his father's voice in his head, saying that your life is not your own once you have kids. Negan always wanted to know what that meant and now he's finally there. Annie says she still hears the voices of everyone they lost, such as Ian and Jesse , thinking about how the Commonwealth killed them. Annie and Negan kiss. While unseen, Annie is abducted on Pamela Milton 's orders, alongside the other children and almost every other Alexandria, Hilltop and Riverbend resident living at the Commonwealth. Annie is on board the prisoner bus with the other captives, with a bag over her head. She is given a sedative injection by a trooper, keeping her tranquilized for the ride to the bus's destination. On the Commonwealth bus, Ezekiel wakes up and removes his hood, groaning in pain as someone bangs on the side of the bus. The other prisoners, amongst them Negan , Annie, Kelly and Theresa , follow suit. Ezekiel makes sure that everyone is alright, and Kelly confirms that she's unharmed. Annie notices that one of the trucks is missing and Negan notices that there's no sign of Gabriel, Maggie or Rosita either. Kelly reports that the soldiers are unloading a bunch of stuff off of the trucks, but she can't see the kids. Annie tells the other two that she was in and out of consciousness and that they had stopped for a few minutes during which time there had been a crash. Annie guesses that it was their missing friends which Negan admits fits, stating that they likely bailed, but stops himself from bringing up the worst-case scenario. The Warden boards the bus and greets the prisoners, telling them that today is the first day of a new beginning. The world works when everyone knows their place and the prisoners' place is at the bottom. All of the resources that the Commonwealth uses to bring the old world back into the new and sustain it all starts at places like this. The Warden suggests that they should take comfort in knowing that good people will benefit from their labor there which the Warden calls their redemption and salvation. The Warden promises that everyone's children are safe and being tended to and that they will get to see them again if they play by the rules. However, they need to work as one to be able to do that and the Warden announces that nobody has a name anymore as they have no need for them. The Warden won't tell them his name and they are forbidden to address each other by their own names. The Warden directs several prisoners to exit at the rear, including Annie. After sharing a look, Negan allows his wife to leave, but he promises to get his family out of this situation. As Annie exits, the Warden explains that the selected prisoners are being transported to another site while the rest of them will work at their current location until the railroad tracks are clear. The Warden orders everyone to follow him out of the bus, but Negan hesitates, worried about his wife's safety as the selected prisoners are driven off in another direction. At the railroad tracks just outside of Alexandria , the Commonwealth prisoners work under the supervision of the Warden and his soldiers . Negan and Kelly observe the patterns of their captors with Kelly communicating her observations to Magna in sign language. Working with Ezekiel , Princess recognizes the missing Tyler Davis amongst the other prisoners from their brief imprisonment in the rail yard before he later took Max hostage and then mysteriously vanished . While Princess doesn't like Tyler, she knows that he's ballsy and that might be useful to them. As Negan gets a drink, Magna discreetly reports what Kelly had told him about the locations of the soldiers which Negan sketches out. Ezekiel approaches Negan and asks for the map, but Negan spots Annie nearby and, ignoring Ezekiel, approaches Roberts and offers to pick up a couple of extra shifts so that his wife can have her workload loosened. Negan appeals to Roberts personally who appears to consider it before they are interrupted by Sanborn . After being told that Negan is mouthing off, Sanborn decides that they need to show him his place and hits Negan with the butt of his rifle . Negan attacks Sanborn, but he is knocked to the ground by Roberts and kicked in the gut. Seeing her husband's predicament, Annie rushes in to intervene and shoved to the ground by Sanborn and is dragged away with him after a brief scuffle as Roberts keeps Negan from intervening at gunpoint. Hidden in the bushes nearby, a worried Daryl and Carol observe these proceedings. Later, Roberts lets Negan into a bedroom where Annie is resting in bed and stands guard as Negan approaches his wife. Annie reassures her husband that she's fine and that Negan got the worst of it. Negan asks about their baby and Annie tells him that the baby just kicked her so hard that she nearly rolled off of the bed. Annie reassures Negan that they're going to get out of there which Negan knows and is working on. Annie confronts Negan about his reckless actions on the track which he calls old habits dying hard. Negan promises his wife that he would never risk them, and Annie asks him what the Warden had wanted. Negan tries to brush it off, but Annie knows that it's bad. Negan reassures Annie that he's known men like the Warden his whole life and that he used to be him when Negan had led the Saviors . \"Shit. In that case, no wonder everyone hated you,\" Annie quips, causing them both to laugh. Negan promises to handle the Warden and Annie agrees as long as she doesn't get to the Warden first. As the prisoners lay in their bunks that night, Sanborn and several other soldiers burst in, yelling for everyone to get outside immediately. The prisoners are all led to the windmill where the soldiers shine spotlights on them and the Warden, standing in front of Ezekiel and looking at him, announces that there's a traitor in their midst, someone who thinks that he's above the rules. Roberts and another soldier lead out Negan who has admitted to spearheading a rebellion , although any co-conspirators will be given the benefit of the doubt as the Warden trusts that they were not acting of their own free will. As such, only Negan will be punished, but they all need to see and remember. Annie breaks free and runs towards her husband, sobbing, but she is restrained, and Negan reassures his wife that it's alright. The Warden has Negan put on his knees in front of the windmill to be executed by a firing squad while the prisoners murmur to themselves about how they knew that Negan couldn't be trusted and was a liar and Annie pleads for her husband's life to no avail. However, before the Warden can give the order to fire, he notices Negan smirking and, unwilling to let Negan martyr himself, grabs Annie and adds her to the execution. Negan desperately pleads for the Warden to leave Annie alone and take only him, but the sadistic man is determined to make Negan feel this punishment. Ezekiel is conflicted watching this while Negan pleads with Roberts, who has a family, not to do this, causing a moment of hesitation before he proceeds. Unwilling to allow Negan to be executed, Ezekiel moves in between the firing squad and Negan and Annie, standing in their way. A number of the other prisoners quickly follow Ezekiel's lead, including Magna, Kelly, Princess, Tyler, and Nabila , creating a human wall between the soldiers and Negan and Annie. The Warden admits that he admires their bravery, but he nevertheless orders his men to shoot them all. Noticing most of the soldiers hesitating at being ordered to murder so many people, Ezekiel pleads with them that \"you don't have to do this! This world is broken, but we don't have to be.\" Realizing that Ezekiel is right, Roberts lowers his gun and turns to the rest of the soldiers who follow his lead. Roberts turns his gun on the Warden, but Sanborn aims at him in return, causing Roberts to shoot him dead. The Warden grabs Kelly and tries to escape by using her as a hostage as Roberts and the prisoners try to stop him. However, Daryl and Connie come up from behind the Warden and Daryl stabs the Warden in the back, incapacitating him and retaking Alexandria from the Commonwealth. In front of the windmill, Negan prepares to kill the Warden with a rock, but he's stopped by Rosita . Rosita demands to know where her daughter is, but the Warden refuses to answer. Seeing Sanborn reanimate, Rosita grabs him and holds the walker over the Warden's face, once again demanding to know where her daughter is. With a smile, the Warden sadistically tells Rosita that she will lose everything, and Rosita furiously shoves the zombified Sanborn into the Warden's face which Sanborn begins devouring, killing the Warden. Rosita walks away, leaving Sanborn to eat the Warden as her friends, the soldiers and former prisoners watch in shock and horror at the brutal death. As the Coalition soldiers and freed Commonwealth prisoners prepare to leave to confront Pamela Milton , Annie hugs Negan from behind and orders her husband to be careful. Negan states that he always is, and Annie tells Negan to come back in one piece while she holds down the fort in Alexandria and Negan promises to do so. When talking with Negan, Maggie says that he and Annie are welcome to stay, as they have earned their places among the communities. In the year following the defeat of Pamela Milton, Annie chose to depart from the communities with Negan in order to pursue their interests in starting a family. [1] After meeting Negan again years later, Maggie asks Negan about where Annie and his kid are. After looking down for a moment, Negan doesn't answer the question and instead he changes the subject. Negan emotionally reveals to a sympathetic Maggie that \"a few years ago, Joshua , Annie and I, we were living in this little cabin outside of New Babylon . One day, Annie decided to go into town to do some trading. When she wasn't home at nightfall, I uh... I knew something had gone wrong. I went looking for her, I found her. And she had been uh... she had been... she'd been robbed, and beaten and, uh... She begged me not to do something stupid, but hell, you know me. I found 'em. All five of 'em, in some shit drinking hole. Honestly, I don't think I even wanted to kill 'em. After that, we were on the run, and it was very hard for Annie. So, I put 'em on a wagon train to Missouri and I said I'd be right behind 'em. I stayed. I think about them every single day. I hope to God they are okay, and maybe I have no right in hoping that. I don't know, Maggie. I mean, what else do we have besides hope?\" Annie's current fate remains unknown as it is unknown if she managed to reach Missouri or what had happened to her once Annie got there. Perlie tells Negan that saving his life doesn't bring back the magistrate and the four other men with him that Negan had killed. \"Those assholes, they damn near killed my wife. If you had seen what she looked like when I found her, well, I guarantee you'd done the same,\" Negan states. Perlie is visibly surprised by this, apparently having been unaware of what had happened to Negan's wife. Negan reveals to Ginny that her father was one of the five men that he'd killed, meaning that he was one of the men who had attacked Annie.",
        "Killed Victims[]": "This list shows the victims Annie has killed: Sgt. Crowe (Alongside Maggie Rhee ) Radio Trooper (Caused) At least 1 unnamed Commonwealth soldier (Alive) Numerous counts of zombies and unnamed people",
        "Appearances[]": "",
        "Trivia[]": "According to Angela Kang , Annie was in Alexandria during the finale and due to the script being too big, COVID, and Norman Reedus ' ( Daryl Dixon ) accident [2] [3] , they were unable to schedule to film her scenes and include her for the final episode. Annie was always meant to survive the season as they had several versions that would lead into Negan 's spin-off and it involved Annie. [4] As of \" Warlords \", Annie is the only named Riverbend resident confirmed to be alive. Annie is Negan's eighth wife, after Lucille , Sherry , Amber , Tanya , Frankie and two unnamed wives at the Sanctuary .",
        "References[]": ""
    }
]