[
    {
        "April Martens": "",
        "Fate": "",
        "Contents": "",
        "Overview[]": "Once a normal citizen of the Commonwealth , April was in debt but was approached by Sebastian , telling her he could get her out of it. In reality, April was one of many people Sebastian was using to get money for himself. April had gone with a small group of people and was the only survivor. When Daryl and Rosita find her, she is shown to be extremely desperate to get out and is overjoyed when she is freed to the point of hugging Rosita. However, April seems to be much less experienced than the others when dealing with walkers. While walking through a herd, a walker gets stuck to her armor which prompts her to stab it. The rest of the walkers surround her and she ends up being killed, much to the sadness of the others. Ultimately after Sebastian is exposed for his crimes, tons of people begin to protest for him to be punished for what he did to those like April.",
        "Pre-Apocalypse[]": "Nothing is known about April's life prior to or as the outbreak began, except that it's possible she had one or two children.",
        "Post-Apocalypse[]": "At some point during the outbreak, April joined a community in Ohio, where she lived with her parents and two children. April's name appears on a list of names sent to Connie and Kelly and is the fourth from the end. Daryl and Rosita enter the house and find the panic room where the cash is stashed. April pounds on the door from inside the locked room. April explains she was in debt when Sebastian offered her a way out. She was with a group of 12, but only three made it inside. They were able to turn on the generators when the two men she was with turned on each other, so April locked them out and was trapped inside when the power shut off. Daryl turns on the generator. The whirring draws out a walker. Daryl fights it off as the power comes back. Rosita enters the code to free April. Daryl busts into the safe as the panic room alarm blares, threatening to draw even more walkers towards the house. Rosita smashes the alarm, shutting it off. They fill a duffle bag with money and barricade themselves inside. Mercer and Carol rescue them. Rosita and April explain that Sebastian sent them to the house to get cash for him. Daryl's group quietly slips past walkers in the house, covered in walker guts in order to disguise their smell with April wearing Rosita's armor instead. However, April's arm gets caught on a strap hanging off of one of the walkers and she panics and puts it down. This breaks the camouflage, causing the walkers to attack the group, devouring April before Daryl, Rosita, Carol and Mercer put them down. In the aftermath, Rosita sadly stabs April in the head to keep her from reanimating. The group then departs, and they are forced to leave April's body behind in order to sneak out through the herd outside. Rosita and Eugene tell Connie and Kelly about the events at Cooper's house and what happened to April. Connie and Kelly pull out the list that they were sent and point out April's name on it. However, Rosita states that while there could be a connection to Sebastian 's actions, there are way more people on the list than just what Sebastian had sent into that house. After Sebastian is exposed for his crimes, tons of protestors take to the streets calling for him to be punished, including April's parents. Many photographs of April can be seen being held up as they demand justice for her death. Later a memorial is held at Union Square for April which is eventually stopped by Henderson .",
        "Death[]": "Killed By Sebastian Milton (Caused) Alves (Caused) Castle (Caused) Herself (Caused, Accidental) Zombies (Alive) While using the walker guts trick to escape Cooper's House with the group that came to save her, a piece of armor that April is wearing gets caught on a walker's shirt. Panicking, she kills it and ends up being swarmed by multiple other walkers around her. Rosita Espinosa (Before Reanimation) After the room is cleared, Rosita sees that April has been disemboweled and killed. She then stabs her in the head to prevent reanimation.",
        "Killed Victims[]": "This list shows the victims April has killed: Herself (Caused, Accidental) At least 1 zombie",
        "Relationships[]": "",
        "Appearances[]": "\" The Rotten Core \" \" Lockdown \" (Photograph)",
        "Trivia[]": "The list of names Connie receives in \" Rogue Element \" has April's last name as Kelly whereas the list of names in \" Trust \" reveals the character's last name as Martens . This is likely a production error as the same props were not used for both episodes, hence the difference in April's last name. It's possible that her name was intended to be a reference to a character from the comics who is similar to her, as they would then share the same initials of A.K. ."
    }
]