[
    {
        "Austin": "",
        "Fate": "",
        "Contents": "",
        "Overview[]": "Austin is shown to be a feisty, ruthless, aggressive, and violent individual. He takes part in the Reapers ' brutal attacks on innocent survivors. He is a skilled fighter due to his military training and can hold his own when push comes to shove. When Maggie 's group lets in a herd of walkers into Meridian , he, along with Fisher and Boone manage to clear out a good amount of the herd by themselves with just melee weapons. Later, Austin is seen taking aim at Gabriel and almost shoots him before Daryl stops him just in time. He is shown to be vengeful over Pope 's death, saying \"For Pope,\" before fighting Daryl in an attempt to avenge his fallen leader. Austin proves to be a formidable foe, even cutting Daryl in the arm with his machete. However, Daryl manages to stab Austin in the stomach. Despite being stabbed, Austin still has the strength to run to the door trying to retreat. He is quite defiant, continuing to fight with Daryl despite being badly wounded. After his death, Leah and Washington find his corpse and are shown to be devastated by the loss of their comrade, with Leah declaring she won't lose anyone else.",
        "Pre-Apocalypse[]": "Prior to the outbreak, Austin was fighting in Afghanistan along with the rest of his squad which included a lot of members that would eventually become the Reapers . Upon returning from war, he struggled to find jobs or deal with trauma, but the relationship between him and his comrades remained strong. He then decided to become a mercenary.",
        "Post-Apocalypse[]": "During the beginning of the outbreak, as Operation Cobalt was put into action in an attempt to try and contain the undead threat, Pope and a group of his people managed to escape the bombings by running until they reached an abandoned church, where inside Pope was amazed to see none of them had been killed or injured, leading him to view him and his comrades as \"the chosen ones\". It is unknown if Austin was present during this revelation. Regardless, he eventually joined the Reapers, and either found or crafted his own mask with a two-faced design, half of it with no expression and the other half with a large smile, and would use this mask as a scare tactic against those who were \"marked\" by Pope. At some point, Austin and his group eventually attacked a group of survivors led by Maggie Rhee despite having no previous hostilities with her group and succeeded in destroying their camp and killing numerous members of her group, causing them to flee to Virginia. He and his group eventually followed them to finish them all off due to his leader, Pope marking Maggie's group. Austin and at least a dozen Reapers appear on a dark road adorned on both sides with bodies hanging from posts. Suddenly, the Reapers open fire on Maggie and her group, killing Roy and severely injuring Cole. As the Alexandrians flee into the woods, the Reapers chase after them. Chaos breaks out in the woods as Austin and the Reapers hunt down members of Maggie's group, killing Cole and injuring several others, including Duncan, Negan, Daryl, and Gabriel. While Daryl is being taken in for interrogation by Carver and Powell , Austin can be seen amongst his comrades within Meridian . He is later seen waiting with the Reapers as Daryl and Leah emerge from a burning trailer. Austin is seated around the campfire eating dinner with his fellow Reapers including the newly recruited Daryl Dixon . He is shocked and disturbed when Pope horrifically kills Bossie by throwing him in the fire. Austin is seen when he lets Ancheta and Washington inside Meridian after they failed to locate Maggie's group. He witness them getting admonished by Pope, until Leah comes to their defense. Austin is present when Pope and the rest of the Reapers are observing the herd. Later, when Maggie lets a herd of walkers inside the walls, he helps clear them with Boone and Fisher . He retreats with his fellow Reapers when ordered by Leah. Austin is seen taking aim at Gabriel from a window. Daryl manages to stop him and they get into a fight. Austin nearly overpowers him, but Daryl is able to stab him. Austin is initially shocked at the knife stab before attempting to flee out the door. Daryl catches him and puts him into a choke hold. Just then Leah and Washington can be heard in the other room and ask if Austin is in there, prompting Daryl to cover Austin's mouth as he strangles him to death. He hides just as Leah and Washington enter the room and both discover Austin's body. Leah mourns his death and declares she won't lose anyone else.",
        "Death[]": "Killed By Daryl Dixon After stopping Austin from shooting Gabriel, Daryl engages in a fight with him. Austin ends up getting stabbed in the stomach and strangled by Daryl to silence him after he tries to run away. With the rest of the Reapers closing in on them, Daryl covers his mouth and suffocates Austin as well until he dies. He is presumably put down before reanimation by the Reapers.",
        "Killed Victims[]": "This list shows the victims Austin has killed: Ms. Adams (Possibly) Leo (Possibly) Teresa (Possibly) Duncan (Possibly) Numerous counts of enemy combatants (Pre-Apocalypse) Possibly unnamed Meridian residents Numerous counts of zombies and unnamed people",
        "Relationships[]": "",
        "Appearances[]": "",
        "Gallery[]": "For more images of Austin, please visit Austin (TV Series)/Gallery .",
        "Trivia[]": "In the Memoriam on Talking Dead for \" No Other Way \", he is credited as You Got Schooled Reaper ."
    }
]