[
    {
        "Axel": "Axel",
        "Overview[]": "Axel seems to be rather poorly educated and a little ignorant, but a generally well-meaning person. At first, him and Oscar are given a cell block away from the main group, but gradually begins to gain the group's trust. He is shown to have a flirtatious relationship with Carol , and even tells her about his past. Unfortunately, he is shot and killed by the Governor before he can become a bigger aspect of the group.",
        "Pre-Apocalypse[]": "Not much is known about Axel's life prior to or as the outbreak began, except that he had a brother and was imprisoned for armed robbery. One day, he robbed a store with a water pistol, and the police found him hiding at his brother's house the next day with the water pistol. He swore that it was all he had at the robbery, but the police didn't believe that anyone could be that stupid and get away with it, so they searched his brother's house and found his brothers' .38, which \"matched the description\". Axel also said that his brother had a money problem in that he never lent him any.",
        "Post-Apocalypse[]": "At the onset of the outbreak, a riot started at the prison. Axel, Tomas, Oscar, Andrew, and Big Tiny were escorted to the cafeteria by a guard. They were locked inside as the guard went out to call for backup, but he never returned. The five inmates then spent the next 10 months locked inside the cafeteria, without knowing what was going on outside. He, along with the other prisoners, were discovered by Rick Grimes , Daryl Dixon , Glenn Rhee , T-Dog , and Maggie Greene after they broke open the cafeteria's door to escape a group of walkers. He witnessed the amputation of Hershel Greene 's leg, and was quite shocked by the sight. When discovered by Daryl, Axel exclaims, \"Holy shit.\" Just like the rest of the prisoners, Axel is confused about what is happening and constantly attempts to calm everybody down. Rick reveals to them what had happened to the world they had known, of which the prisoners were totally unaware. Following a heated argument between Rick and Tomas, Axel tries to cool things down, offering that he and the other prisoners can find another cell block to live in, giving Rick an idea of an offer: Rick's group gets half of the food supplies from the cafeteria and his group assist in helping the prisoners clear out one of the cell blocks so they can live there. As they kill walkers on the way to Cell Block B, Big Tiny is deeply scratched by a walker and is told by Rick that he has no chance of surviving. Axel, along with Oscar and Andrew, ask Rick if there is anything they can do to save Tiny's life, but they all end up witnessing Big Tiny getting brutally murdered at the hands of Tomas. When they start clearing the laundry room, Tomas attempts to kill Rick twice. In response, Rick impales Tomas' head with a machete, killing him instantly. Andrew tries to fight Rick, but is easily defeated and runs away through the prison corridors. Rick leaves to pursue Andrew while Oscar and Axel are held at gunpoint by Daryl and T-Dog. Axel tries to convince them that he and Oscar aren't killers like Tomas and Andrew. He begs Oscar to help him out but Oscar calmly tells him to stop talking. When Rick returns, he holds Axel at gunpoint, asking him if he was associated with Tomas. Axel begs for his life, pleading that he had problems with pharmaceuticals but he is not a killer. He tells Rick that Tomas and Andrew were the violent ones. He informs Rick that Oscar wasn't in prison for murder either. He also mentions that Big Tiny was a close friend. Rick, convinced that Axel is not like Tomas, holds Oscar at gunpoint. Unlike Axel, Oscar doesn't beg for his life at all. This convinces Rick that he is also not like Tomas. Once they reach Cell Block B. Oscar and Axel are horrified as they discover that every prisoner in the cell block was executed in cold blood, presumably by the guards. Axel says that he knew these guys and they were all good men. T-Dog gives Oscar and Axel a final word of advice before he, Rick, and Daryl head back to Cell Block C: \"Take those bodies outside and burn them.\" Axel and Oscar appear near the beginning of the episode, pleading Rick to be allowed to join their group. They plead their case by saying that they couldn't live in their cell block, unable to dispose of the bodies and live with the deceased inmates, whom they knew and claimed were good people. After they beg to join, Rick denies them both entry into their group, giving them supplies for the road. He then goes on to unsuccessfully try and show to the group that he is a kind person and can help out, to the disgust of Oscar, first by offering Daryl to repair his bike and then calling Glenn \"bro\". Shots were then fired as walkers invaded the prison's courtyard. Rick, Glenn, and Daryl pass, running by the two prisoners, confused about what is occurring, Axel and Oscar decide to follow them. When Glenn informs Rick that somebody had broken the courtyard's gate open, allowing the walkers to get in, Axel and Oscar are instantly blamed. But both are shown innocent as the prison's alarm blares, attracting more walkers to the prison. Oscar presumes that someone had activated the generator, causing Rick to recruit the two into helping them with finding and shutting off the generators. They separate into two groups, Axel with Glenn and Rick with both Oscar and Daryl. The second group ended up discovering the generator room and the person to be blamed for all of this is Andrew. Axel and Glenn later regroup with Rick, Daryl and Oscar, and moments after, find T-Dog's devoured body. Both Axel and Oscar are seen regrouping with the rest of the group at the end of the episode. Axel and Oscar are accepted in the group, but with cold shoulders. They assist Glenn in digging Lori Grimes ', Carol 's, and T-Dog's graves, and attempt bonding with Glenn while doing so. Glenn says he requires two more graves so Axel and Oscar begin to dig. Meanwhile, Glenn talks with Hershel, saying that he wished they had killed all the prisoners on first sight. Hershel talks this thought away, stating that he believes Axel and Oscar are good men. Axel and Oscar later assist Glenn with getting walkers away from the main gate, so that Daryl and Maggie can get inside the prison again. They are later seen with the rest of the group as Daryl is feeding the baby , and they all laugh together when Daryl dubs the baby \"Ass-Kicker.\" Axel appears in the group discussion, arguing about who should go to Woodbury . Even though he volunteers to go, he stays behind, as one of the few males left to protect the prison. At the beginning of the episode, Axel is seen flirting with Beth Greene . Carol pulls him aside and confronts him about it. His response is that he hasn't seen a woman in months and that she was his only option, also stating that he believed Carol to be a lesbian because of her short hair. When she reveals that she isn't, Axel tries to flirt with her but is rejected. Later, when Hershel, Carl, and Beth hear Donna screaming, neither Axel or Carol are present as they are in the guard tower keeping watch. Axel is seen cooking dinner in the common room, wearing civilian clothes, while Hershel doctors Allen . Axel mentions to Tyreese that he feels like the prison is his home. Axel and Beth bring shovels to Tyreese's group so that they can bury Donna. When Rick returns to the prison, he informs Axel of Oscar's death, saying that he went out fighting. Axel is also seen protecting Carol from Rick when he starts yelling and waving his gun over seeing a hallucination of Lori. Axel is seen with the group when Glenn is attempting to take charge. When Glenn is about to leave to secure the front of the prison, Axel offers to drive, but Glenn rejects the offer. Instead, he goes and helps Carol with making the prison better fortified in the event of an attack. The two begin to bond as Axel discusses his life before the apocalypse as well as before his imprisonment. They appear to be getting closer as they get to know one another better. Later on, the two are talking in the courtyard about life before the apocalypse, and when Axel is about to go into detail about a story regarding his brother, he is shot mid-sentence in the head by the Governor much to Carol's horror, who is then forced to use his body as a shield as she is shot at by the Governor and his men. His remains were presumably buried.",
        "Death[]": "Killed By Philip Blake During a conversation with Carol about prison life, Axel is shot in the head from afar by The Governor. His body is then shot multiple times as Carol is forced to use it as a shield from the hail of bullets.",
        "Killed Victims[]": "This list shows the victims Axel has killed: Numerous counts of zombies",
        "Appearances[]": "",
        "Trivia[]": "Originally, Axel was meant to be a serial killer at the prison, and was supposed to lure Beth Greene into the woods and murder her as well as beat Carol Peletier. However, this storyline was scrapped. [1] This is very similar to Thomas Richards ' role in the Comic Series. Axel was described by Lew Temple as \"Axel is a gregarious Southern redneck-biker type, who has big heart no doubt,\" \"He has a sense of compassion for his fellow man, but he is not as meek as he might appear, and though he has had to survive with four other hardened criminals, sans Oscar, this brave new world is something entirely different for him. He wants to associate and assimilate into the group of survivors, to the point of trying too hard to be accepted. He has a wry sense of humor and ironic quick wit. He will make you laugh and cry in the same offering.\" [2] In a Twitter post by Glen Mazzara , Axel's name could be seen on a list, including the names of other characters. His name was under the title, \"You follow me?\", a common saying for his Comic Series counterpart. This ended up being a confirmation of the inclusion of Axel from the Comic Series. It was believed that he was arrested for narcotics as when he pled for his life, he stated that he and Oscar aren't like Tomas, revealing that he \"likes his pharmaceuticals\" , but he \"ain't no killer.\" In an interview with Lew Temple , he claimed that Axel dealt drugs. In \"Home\", however, he tells the truth about how he came to be arrested for \"armed robbery:\" He was imprisoned after robbing a convenience store with a water gun (he is scared of guns), and had originally lied about being a drug dealer so the group would think he wasn't a violent person. The name Axel seems befitting of the character, as the name means \"Father of Peace\", which Axel seems to be. He mentioned in the episode \"Killer Within\" that he likes to work on bikes and even offered to tune-up Daryl's chopper. Axel has a tattoo of two dice on the left side of his neck. Axel is the last member of the prisoners to die. Lew Temple found out about Axel's death about two weeks before the episode \"Home\" was filmed: \" Glen Mazzara had just come down to screen the season 3 premiere episode for cast and crew on location. It was great! It was a lovely evening. We celebrated an amazing kick-off to a great new season. And that particular night was the first time I had met Glen in person. We had a really nice visit about what we were doing with Axel, and he was so effusive and kind and lovely, saying \"I really dig how you're bringing Axel out, and the layers that are there. We can go in so many directions because you're keeping things close to the vest and we're not sure what he's about.\" So I was fairly excited, and I got a call from his assistant the next day saying Glen wanted to speak with me, and I'm like oh, great!, assuming he's going to want to speak more about character development. 15 to 20 seconds into the conversation he says, \"Lew, this is really unfortunate but I've got to let you know that Axel is going to take a bullet to the head.\" This makes Axel's one of the three deaths that was not planned during the initial writing of Season 3, the others being that of Andrea and Merle Dixon.",
        "References[]": "",
        "Name": "Axel"
    }
]