[
    {
        "Beatrice": "",
        "Overview": "Beatrice is a feisty and courageous survivor. She can be ruthless when necessary, but it's usually out of the good of her community . After the Saviors killed all the men, she along with the rest of the community had become untrusting of outsiders and are ordered to kill on sight. After Tara is spotted in the community, she along with the others attempt to kill her. When Tara subdues her and takes her gun, believing Tara will kill her, Beatrice is shown to not be afraid for her life and even beckons Tara to kill her. However, Tara instead knocks Beatrice out. Beatrice takes note of Tara sparing her life, which is the main reason the Oceansiders don't immediately kill Tara. However, she and Kathy are later ordered to kill Tara by Natania . Tara manages to escape but Beatrice later catches her and holds her at gunpoint. She is shown to be remorseful for having to kill Tara, but almost goes through with it believing it'll keep the community safe. However, Cyndie saves Tara by tackling Beatrice at the last moment. Beatrice is shown to have a particular hatred for the Saviors due to them killing her husband. Beatrice greatly fears them along with the rest of her community. While holding Tara at gunpoint, Beatrice tells her that they shouldn't have attacked the Satellite Outpost and now it's too late for her friends. Her main reason for almost shooting Tara is so that she doesn't lead the Saviors to Oceanside. However, later when Rick 's group surrounds the Oceanside residents for their weapons, Beatrice seems interested in joining the fight against the Saviors. Though later she and the other Oceansiders are forbidden to do so by Natania. However, after Natania's death, Cyndie is forced to take over. Though Cyndie is also firm on not joining the fight, she later caves in and she, along with Beatrice and the Oceansiders join the fight, throwing Molotov Cocktails at the Saviors to stop them from entering Hilltop . After the war is over, peace is made throughout the communities. However, this also includes working together with the Saviors, much to Beatrice and the other Oceansider's disdain. But after they see Maggie kill Gregory after he tried to kill her, the Oceansiders become inspired to also take revenge on the Saviors who wronged them. Beatrice captures Justin , the man who had killed her husband, and executes him, finally getting her revenge. After Maggie and Daryl find out it was the Oceansiders who killed the Saviors, Beatrice shows no remorse for what she did, seeing it as justice. During the Whisperer War , Beatrice shows her bravery by volunteering to take audio equipment through a herd. However, a Whisperer stabs Beatrice in the leg, incapacitating her. In her last moments, Beatrice attempts to give Carol the equipment, knowing that she is done for. Though Carol doesn't do it, Lydia manages to grab the equipment shortly after her demise.",
        "Pre-Apocalypse": "Nothing is known about Beatrice's life prior to or as the outbreak began, except that she had a husband.",
        "Post-Apocalypse": "Beatrice and her husband survived the early stages of the outbreak and eventually they found themselves as members of a large group of survivors led by a woman named Natania . Unfortunately, her group would be discovered by a large, hostile organization of survivors led by Simon (who later became Negan Smith 's ruthless and sadistic second-in-command) and under his orders, Beatrice and her people were forced to gather and provide supplies for them under threat of death. Eventually, under Natania's orders, the group initiated a rebellion to fight back against their oppressors. However, due to being outgunned and outnumbered, their group was defeated. As punishment for their defiance and to deter any further resistance, Simon had his group murder every male survivor above the age of 10 in Beatrice's group, with Beatrice's husband being executed by a man named Justin . Following this and being unwilling to continue working for Simon and his group, Beatrice and her group, consisting mainly of females now, fled their community and established a new home at a location called Oceanside and reestablished their community hidden from them. In order to prevent Simon and his group from finding them again, Natania ordered any survivor who happened upon the community to be immediately killed in order to maintain the secrecy of their new home.",
        "Death": "Killed By Whisperer (Caused) Zombies While among the horde, a Whisperer spots Beatrice and Carol , and tries to attack them, but Carol stabs her in the gut and throws her to the ground. The two try to get away, but the Whisperer grabs Beatrice’s leg and stabs it, making her scream and the walkers to grab her. Carol walks away as she gets torn apart and devoured.",
        "Killed Victims": "This list shows the victims Beatrice has killed: Wade (Possibly) Justin (Alive) Norris (Alive, alongside Carol , Jerry , and Kathy ) At least 18 unnamed Saviors (Alongside her fellow Oceansiders) 1 unnamed Whisperer (Caused, alongside Carol ) Numerous counts of zombies and unnamed people",
        "Relationships": "",
        "Appearances": "",
        "Gallery": "For more images of Beatrice, please visit Beatrice (TV Series)/Gallery .",
        "Trivia": "Beatrice is the first Oceanside resident who was killed by the Whisperers . Briana Venskus was available for filming for all of Season 10 but since Sydney Park wasn't as available, Oceanside was not written into the season as much, reducing opportunities for Beatrice to make an appearance. In an interview, the actress confirmed she wanted Beatrice to be gay and was \"waiting for her to come out of the closet\" and hit on Tara in Season 7. The actress also talked about the casting process for Beatrice. She was given a \"dummy script\" where she portrayed a police officer who was trying to take down a violent gang and took one of the members captive to persuade them to leave the gang, which referred to a scene in \" Swear \" where Beatrice captured Tara and told her the Saviors aren't all dead and are more powerful than they think. Beatrice appears in the archival footage shown at the beginning of \" Lockdown \" as Judith narrates past events of the show to the audience before the episode's story begins.",
        "References": ""
    }
]