[
    {
        "Ben": "",
        "Overview[]": "Although his personality is not well known, Ben was shown to be a silent and caring young man, though also greedy and dark. He was shown to love his parents, Allen and Donna, dearly and also appeared to be a good friend to Tyreese and Sasha. He was devastated by his mother's tragic death and also defensive of his father as shown by his anger at Tyreese attacking him. Following the death of his mother, like his father, Ben began to demonstrate a darker side as he agreed with his father's suggestion to attack and kill the Prison survivors and take over the facility in order to avoid being exiled, and later showed no hesitation in offering the Governor his group's services to fight against Rick and his people. It is clear that Ben wanted revenge against the Prison group and appeared to have developed a hatred of them all. He also did not appear unfazed at the plan to use Walkers against them to kill them all. Ultimately, siding with the Governor and turning his back on Tyreese and Sasha would eventually cost Ben his life.",
        "Pre-Apocalypse[]": "Nothing is known about Ben's life prior to or as the outbreak began, except that he had a mother named Donna and a father named Allen .",
        "Post-Apocalypse[]": "Ben first appears fighting off walkers in the woods alongside his mother, Donna , and father, Allen , accompanied by Sasha Williams and her brother, Tyreese , who are looking for safe ground. As they prepare to flee, his mother, Donna, is bitten on the arm by a walker, devastating Allen, who aids her out of the woods with the others. They come upon a collapsed portion of the West Georgia Correctional Facility and enter, knowing it is too dangerous to be anywhere else. Sasha feels they should kill Donna before entering the prison, fearing she will reanimate while they are inside, but Allen pleads with Tyreese to spare her for now, not wanting Ben to witness his mother's death. Tyreese convinces Sasha that they should let her live for a while longer and they proceed into the prison. While inside they face a small horde of walkers, and Donna, who is in severe pain, begins to die in Allen's arms while Ben, Tyreese, and Sasha try to clear out the room. They are then helped by a young boy, Carl Grimes , who is able to clear out the room and lead them to the other survivors. Carl tells them to leave Donna, who has died, but Allen tearfully refuses. Tyreese then offers to carry her as Carl leads them into a cell and locks them in. Tyreese uses a handkerchief to cover Donna's face as he prepares to kill her before she turns. Allen and Ben then mourn over her death. He is seen with his father, attempting to convince Tyreese and Sasha to assist with killing the people in Carl's group and taking their weapons along with the prison, fearing that they will be kicked out once the other group members return. He is later seen with the rest of the group as Tyreese tries to convince Rick let them stay with them, when they are all indirectly kicked out of the prison by a hallucinating Rick Grimes . Ben appears along with the rest of Tyreese's group in the woods where Milton and Andrea are. Milton escorts them back to Woodbury , and Ben is willing to retaliate against Rick's group when they talk to The Governor , telling him that they are in if assistance in dealing with them is needed. Ben is first seen with his father, Allen, helping Martinez and Shumpert load weapons up into a truck, including a .50 Caliber Machine Gun. Later, he is present when Allen and Tyreese begin to fight about Tyreese saving Donna's life and Donna's supposed attachment to Tyreese after that. While Martinez, Shumpert, Tyreese, Allen, Sasha, and himself go help to pick up biters from the pit, Ben witnesses Allen and Tyreese having another argument because Tyreese refuses to help wrangle biters so people can be fed to them. Allen gets angry, and says he isn't going back out on the road, and that he needs to look out for his boy. \"Like you looked out for Donna?\" Tyreese sneered. Allen attacked Tyreese at that moment and Ben tried to intervene, insisting Tyreese leave his father alone, but he is easily pushed back by Tyreese's immense strength. He is later seen when The Governor comes to talk to the group about the pit fight and the burning of the biters. He participates in the shootout against Merle Dixon and steps in front of The Governor just as Merle fires a shot at him, accidentally hitting and killing Ben instead. Later, his corpse is stumbled upon by Merle's brother Daryl , being eaten by a zombified Merle.",
        "Death[]": "Killed By Merle Dixon (Accidental) While Merle is sniping at the Woodbury soldiers from the building he is hiding in, he eventually sets his sights on The Governor and attempts to kill him. Ben, however, unintentionally gets in the way and is fatally shot in the shoulder. Later, his corpse is devoured by a zombified Merle. It is unknown if he reanimated, was put down before or after reanimation by Daryl, or was further devoured.",
        "Killed Victims[]": "This list shows the victims Ben has killed. Numerous counts of zombies",
        "Appearances[]": "",
        "Trivia[]": "In the Making Of video for \"This Sorrowful Life\", Ben was mistakenly credited as Zombie Extra . Ben, Allen, Dante , and Lance Hornsby are the only characters in the TV Series that originated from the Comic Series whose roles were rewritten to be completely antagonistic."
    }
]