[
    {
        "Benjamin": "Benjamin",
        "Overview[]": "Benjamin is a friendly, inquisitive, and eager young man. He dutifully serves his King and wishes to improve himself. Benjamin has supposedly read all of the books in the Kingdom's library and learned a great deal of practical knowledge from them. Although he initially lacks the ability to kill a walker in close combat, his skills improve under the tutelage of Morgan.",
        "Pre-Apocalypse[]": "Nothing is known about Benjamin's life prior to or as the outbreak began, except that he lived with his mother, father, and younger brother, Henry .",
        "Post-Apocalypse[]": "At the onset of the apocalypse, Benjamin and Henry lost their mother, but their father survived. The three were eventually found by Ezekiel and taken to the Kingdom where they settled. However, Henry and Benjamin eventually lost their father too. Benjamin was present at the time of the arrival of a notorious group of survivors named the Saviors who operated on behalf of Negan . Upon meeting, the Saviors demanded a portion of supplies in exchange for leaving the community unscathed, to which Ezekiel complied under the condition that the Saviors would never step foot inside the Kingdom. Throughout the following months, Benjamin aided his group in gathering supplies in order to compensate the Saviors demands and thus he took part in several conducted weekly trades between the two groups, which he alongside Ezekiel, and several others kept secretly hidden from the rest of the community.",
        "Death[]": "Killed By Richard (Indirectly Caused) During a supply drop between the Kingdom and the Saviors, the Kingdommers come out short one cantaloupe, which in reality has been hidden by Richard. Gavin (Indirectly Caused) Jared (Alive) Gavin gives the order to punish the Kingdommers by killing one of their group. Initially considering Richard, Jared then shifts his aim towards Benjamin and shoots him on the leg, rupturing his femoral artery and causing him to start bleeding at an alarming rate. Morgan Jones (Before Reanimation) Benjamin is hastily taken to Carol's house for treatment, as there is little time to reach the Kingdom. Despite the efforts of Carol, Morgan, Ezekiel and the other Kingdommers to save Benjamin, he eventually dies of severe blood loss. Morgan then stabs him in the head to prevent reanimation.",
        "Killed Victims[]": "This list shows the victims Benjamin has killed: Numerous counts of zombies",
        "Appearances[]": "",
        "Trivia[]": "The casting call for this character used the name Blake . Benjamin was described as \"Early 20s. A scruffy, boyish, generally warm-hearted teenager who can be a bit of a wise-ass, but never a bully. He's caring and protective of others but isn't afraid to crack a joke if the situation calls for it. He's overcome loss, eager to take on more responsibility, and knows who he wants to be.\" Benjamin read every book in the Kingdom twice. Benjamin lived in the Kingdom for more than a year. Benjamin is the first resident of the Kingdom to be killed on-screen. While Benjamin was the first named Kingdom resident to die, his brother Henry was the last to die. Considering \" Bury Me Here \" was originally scripted to be the fourteenth episode of Season 7 , then this would've continued the \"trend\" of a supporting character being introduced early in a season, only to be killed in the fourteenth episode of the same season. This trend began in Season 4 with Lizzie and Mika , continued in Season 5 with Noah , and once again occurred in Season 6 with Denise Cloyd . Benjamin is mentioned by Ezekiel to Michonne in \" Silence the Whisperers \" when referring to everything he's lost. Benjamin's death is shown to have a lasting impact on Morgan, Henry and Ezekiel. Both Morgan and Henry seek revenge for his murder, killing Jared and Gavin respectively for their roles in it. Benjamin's death triggers Morgan's second descent into madness following the loss of a loved one that he only snaps out of when Jesus convinces Morgan to stop killing the living again in \" Wrath \". In \" Faith \", Ezekiel refers to Benjamin as his family, alongside his brother Henry, and mentions that even a decade after his death, Ezekiel still hasn't forgotten Benjamin and how Negan and the Saviors caused his demise. As a result, Ezekiel has purposefully avoided interacting with Negan Smith in that time and only reluctantly works with him during the Outpost 22 Rebellion . In \" Family \", Ezekiel has decided to let go of his bitterness and that Negan living to make something of his life is better.",
        "Name": "Benjamin"
    }
]