[
    {
        "Bertie": "",
        "Overview[]": "Bertie is a brave woman who is willing to risk her life for her community . When trying to be convinced to join the fight against the Saviors , Bertie is the first one to step up and join. After being trained, Bertie becomes more and more combat proficient, and helps fight against the Saviors and later the Whisperers .",
        "Pre-Apocalypse[]": "Nothing is known about Bertie's life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "At some point in the apocalypse, Bertie joined a community called the Hilltop Colony where she became one of the supply runners. At the time, she was given one of the FEMA trailers to live in.",
        "Killed Victims[]": "This list shows the victims Bertie has killed: Bruce (Possibly, Before Reanimation or Out of Mercy) Possibly a few unnamed Saviors At least 1 unnamed Whisperer (Alongside Coalition Archers) Numerous counts of zombies",
        "Appearances[]": "",
        "Trivia[]": "Bertie had lines with Gregory in her trailer at Hilltop in \" Something They Need \" but the scene was cut. [2] In an Instagram clip, Karen Ceesay shared a story that she suffered a big cut on her forehead days before filming so the costume department gave her a teal scarf to wear on her head during the episode, including her scene with Gregory. In \" Mercy \", Karen Ceesay revealed that she asked production if she could be included in a shot in the episode as she noticed she was not in the camera's range during filming. As a result, they filmed the short shot of Bertie and Maggie in the beginning of the episode. The actress revealed that she and Lauren Cohan were talking about curtains, as audio in that shot wasn't being included in the episode. [3] In the same clip, Karen confirmed that Bertie is the TV series counterpart for Brianna . In \" The Bridge \", it was revealed that Bertie serves as a teacher who gives lessons to the children of the Hilltop. As of Season 10, Karen Ceesay was promoted from Co-Star to Also Starring. Bertie was credited in \" What It Always Is \" but did not appear in the episode. According to the actress, she had lines with Aaron but the scene was cut. [4]",
        "References[]": ""
    }
]