[
    {
        "Overview": "Beta is shown to be a brutal, sociopathic, cunning, aggressive, and highly analytical man who is devoted to the Whisperer way of life. Prior to his time with the Whisperers however, Beta was revealed to be a solitary, socially awkward, and mentally unstable individual, having apparently turned into a recluse and gone insane after his best friend died. He is shown to be extremely protective of his identity to the point that he even murders a fellow Whisperer for recognizing him from his days as a celebrity before the apocalypse. This shows that Beta, like Alpha and a majority of the Whisperers, has completely shed the identity and life he once had and has adapted fully to the post-apocalyptic hell. He somewhat appears to hate the person he once was and desperately wants to escape his past though it also seems, in a way, that he wants to preserve his image as the inspiring musician he once was. He is completely loyal to his leader, Alpha, following her orders without question and respecting her decisions completely and looking up to her. However despite his loyalty to Alpha, Beta is far from being a complete yes-man, and will occasionally voice any disagreements he has with her, even though he will usually do as commanded, regardless of his opinion on the subject. Due to his large size and strength, Beta is a very dangerous opponent, capable of using excessive force to protect his group and is an extremely skilled fighter, being able to casually overpower Daryl during a fight and later Rosita . He has very fast reflexes, as he effortlessly grabbed Henry's stick when the latter tried to hit him. He is also extremely durable, shrugging off a stab wound and even surviving a more than two-story fall down an elevator shaft after being tricked and shoved in by Daryl. Beta is shown to be quite capable of cold-blooded murder and was fully prepared to kill both Henry and Lydia on Alpha's orders, showing that he has no qualms about harming adolescents and nearly even broke Henry's arm. He appears to be a highly skilled tracker and strategic thinker as well which makes him a vital member of the Whisperers; with Lydia admitting to Daryl that he is the group's best. His strong strategic and combat abilities were demonstrated by his lone attack on Alexandria in which he was able to infiltrate undetected and slaughter numerous residents himself. Beta's final defeat only came when he was focused solely on killing Negan in revenge and so let his guard down to outside attack by Daryl. Even so, he was able to survive being stabbed through both eyes and showed little sign of feeling pain as his end came. He is more than willing to harm any Whisperer who poses a threat to Alpha and to keep the others in line, as he threatened fellow Whisperer Sean upon learning of his and Helen 's disdain for Alpha's decisions and applauded Alpha for murdering them to remind the other Whisperers of her dominance. This shows that he will do whatever is necessary to preserve Alpha's leadership over their \"pack\". Despite this, he does show respect for members who are committed to the Whisperer way of life as seen by him consoling a dying fellow Whisperer who wishes to reanimate as a walker upon death. While Beta has no problem with killing, he doesn't seem to enjoy it under unnecessary circumstances either, as he openly expresses disdain towards Daryl for not handing over Lydia when he was after her, claiming no one else from his group had to be slaughtered as a result. This is further reinforced during his infiltration of Alexandria, as while he does remorselessly kill several residents to create a distraction, he was also willing to spare Laura , initially only disarming and knocking her down so he could pursue Mary , although he still killed her after she attacked him once more. Following Alpha's assassination by Negan, Beta is shown to be utterly devastated and filled with rage and even appears to have a mental breakdown. Upon hearing a fellow Whisperer proclaim him as the \"new Alpha\", Beta punishes him by having Alpha's reanimated head bite his ear off, showing that he refuses to replace Alpha and still accepts her as his leader even though she is dead, showing his respect, loyalty and admiration of Alpha. To honor her, he even adds a piece of her face to his mask, showing that she was one of the people he admired most in life, alongside his best friend. However, in the following episode , Beta's mental breakdown worsens as Beta begins to hear voices in his head, and hallucinates having walkers speak to him, and it's subtly hinted that Beta's refusal to take the mantle of \"Alpha\" is due to an inferiority complex, as the voices urge him to have faith in his own strength. In his final moments after being mortally wounded by Daryl, Beta is shown to be completely accepting of his defeat and death. Before meeting his demise, he remembers his time as a Whisperer and also of Alpha, showing his desire to be reunited with his beloved leader in death. He dies a sociopathic, remorseless mass murderer and fanatical, loyal follower of Alpha fully submitted to the barbarianism and savageness of the Whisperers and overall the polar opposite of the person he once was.",
        "Pre-Apocalypse": "Prior to the outbreak, Beta was a professional and famous country musician known as \"Half Moon\". For unknown reasons, he visited a rehabilitation center, and became close friends with his rehab counsellor while there. At some point shortly before the outbreak, he killed a home invader and felt remorse after seeing that the invader had a \"Half Moon\" T-shirt on.",
        "Post-Apocalypse": "At some point after the outbreak, Beta and his best friend took refuge in a survivor camp though it was eventually overrun by walkers, forcing the two to take refuge in an abandoned hospital. The friend was later bitten, and shortly thereafter died and reanimated, driving Beta to insanity. He could not bring himself to put his friend down and let him roam the hospital as a walker. Beta also decided to wear a ski mask to hide his identity from strangers to preserve his image as an inspiring musician before the apocalypse while descending into a ruthless killer to stay alive. Sometime later, Dee and her daughter Lydia arrived at the hospital to escape from walkers. Beta reluctantly allowed them to stay one night but forbade them from entering his private quarters. He eventually formed a bond with Dee due to them sharing similar views about the new world though after she tried to see his face, he demanded her and her daughter to leave. Lydia however eventually trespassed on his side of the hospital, forcing her mother to follow her and ended up killing Beta's zombified best friend, to his fury. Dee calmed him down and welcomed him to join them. Beta refused to leave his best friend behind and Dee convinced him to skin his face off and wear it to continue hiding his identity (to which she and Lydia learned). Beta accepted and also took his friend's shirt. After meeting Beta, Dee killed Hera , the leader of a large group of survivors that would eventually become known as the \" Whisperers \". The two took over the Whisperers with Beta as the group's second-in-command, while Dee took the name of \"Alpha\" and became the leader. Under their direction, they instructed their people to skin walkers and wear their skin in order to mask their scents and move freely among herds. This was also used as a method to attack other survivor camps and settlements. The group members were also demanded to abandon their previous lives and beliefs and become nothing but hardened, primitive survivors. They survived off the land by moving from place to place. Beta continued to protect his identity strictly and always wears his mask, even in the safety of their camp.",
        "Death": "Killed By Negan Smith (Indirectly Caused) Himself (Indirectly Caused) Daryl Dixon (Caused) After spotting Lydia leading the horde away, Beta is confronted by Negan . Beta charges at him and throws a walker on him, then prepares to kill him in revenge for murdering Alpha . While Beta is focused on Negan and lets his guard down, Daryl sneaks up on Beta and slashes him with a knife and then stabs Beta through both of his eyes. Zombies Blinded and delirious after being stabbed and after Daryl pulls the knives out, the blood seeping from Beta's eyes attracts the walkers to him who proceed to completely devour him.",
        "Killed Victims": "This list shows the victims Beta has killed: Alfred (Alive) Alexandria Guard (Alive) Panicked Woman (Alive) Laura (Alive) Alex (Caused) Brianna (Caused) Quan (Caused) Savior 15 (Caused) Troy (Caused) Earl Sutton (Caused) Mary (Alive) Chanting Whisperer (Alive) Rufus (Caused) Alpha (Zombified) Himself (Indirectly Caused) 1 unnamed home invader (Pre-Apocalypse) 4 unnamed campers (Possibly, Caused or Direct) 2 unnamed Whisperers (1 Alive) At least 6 unnamed Alexandria residents (Alive) Several unnamed members of the Coalition (Caused) Numerous counts of zombies and unnamed people",
        "Relationships": "For a more in depth look at Beta's relationships, read here: Beta (TV Series)/Relationships",
        "Appearances": "",
        "Gallery": "For more images of Beta, please visit Beta (TV Series)/Gallery .",
        "Trivia": "Beta is the third major recurring secondary antagonist in the TV Series , with the first being Merle Dixon , the second being Simon , and the fourth being Leah Shaw . Beta is currently the only major recurring secondary antagonist whose real name is not known. Additionally, he is the second main character to be a secondary antagonist for more than half a season, with Simon being the first. Beta is currently the only major recurring secondary antagonist that did not die before the major recurring primary antagonist. The term \"Beta\" denotes the second most dominant role or position in a particular sphere or group. Even though Beta refuses to accept the position of the alpha after Alpha 's death, he still becomes the de-facto leader of the Whisperers. Just like his comic book counterpart, Beta's signature weapon is a pair of large knives. A holster for these knives can be seen on his belt. Additionally like his comic counterpart, Negan nicknames Beta \"Frowny Mctwoknives\" due to the latter wielding two large knives. Negan has also given him the nickname of \"the Jolly Green Giant\". Like his comic counterpart, Beta doesn't allow anyone to see his face by always wearing a mask. He is so protective with his identity that he will even kill people if they find out. Only nine people are known to have seen his face; Alpha , Lydia , Mary , his best friend , a Whisperer , Negan Smith , Lucille Smith , and Daryl Dixon . Daniel Salazar , Grace Mukherjee , and Dennis Graham also saw his face due to it being on an album cover, albeit unknowingly. Negan Smith, Lucille Smith, Daniel Salazar, and Dennis Graham were fans of his. Dee, Daryl Dixon, and the Whisperer he killed were also familiar with who he once was. Beta demonstrates a strong physical endurance and an extremely high tolerance for pain. He displayed no signs of pain when he was stabbed in the chest with a shiv by Daryl and he quickly removes the shiv from his chest without any resistance. He survives and stands back up after getting pushed down an elevator shaft by Daryl. He is shot in the chest by Judith with Rick 's Colt Python , but survives thanks to the armor he stole from a guard he killed earlier and is able to get up and resume fighting moments later, despite initially appearing dead/unconscious. He is slashed in the gut with Rosita 's macuahitl while fighting her, yet is only momentarily affected by his injury and is still able to overpower her. He is slashed under his arm and then has both of his eyes stabbed out by Daryl. However, it doesn't seem to affect him at all. He showed no sign of pain as walkers were surrounding and tearing him apart. Instead, he smiled at the fact that it was happening. However, this can be chalked up to his diluted mental state right before he died. Beta appears to be missing several teeth, which he has replaced with metal dental prosthetics. He is the second known person in The Walking Dead franchise to wear dentures, the first being Martha Brown . Ryan Hurst hinted on Talking Dead that he may or may not have been a celebrity before the apocalypse, similar to his comic book counterpart who was a basketball player and actor. Indeed, it was confirmed that Beta was a musician. Also on Talking Dead , Ryan Hurst revealed that he came up with the idea to make Beta a singer. It is later revealed in \" Look at the Flowers \" that his stage name was \"Half Moon\". Angela Kang also revealed that \"Half Moon\" was also one of Beta's album names. This makes him one of five main characters in the TV Series to be recognized with a relative \"celebrity\" status prior to the apocalypse. The other four are Tyreese Williams who was a former NFL linebacker, Deanna Monroe who was a congresswoman from Ohio, Connie who was a journalist and was known to have uncovered a huge corruption scandal, and Pamela Milton who was an influential politician. In Fear the Walking Dead , Dante Esquivel , Jim Brauer , Mickey and her husband Cliff also have the \"celebrity\" status. Beta wears his best friend 's face as his walker mask and his shirt. After putting Alpha's zombified head down, Beta adds a piece of her face to his mask. Beta is one of the few known characters to have killed a person before the apocalypse took place. Beta is one of three characters to have lost both of his eyes, the others being Terry and Berto . He is the only one of these characters to have lost both of their eyes while still alive. This also makes him them first, and so far only character in the franchise to be completely blind. His death is similar to that of Jeremiah Garlitz and Ed ; he dies by being happily eaten alive by his \"followers\" in a Christ-like pose. In \" Here's Negan \", Lucille can be spotted wearing a band T-shirt with Half Moon's face on it. \"Beta\" appears on album covers in Fear the Walking Dead and World Beyond . \"Beta\" is the seventh main character to predecease his comic counterpart, with the first being Dale Horvath , the second being Lori Grimes , the third being Andrea Harrison , the fourth being Carl Grimes , and the fifth being Jesus , and the sixth being Siddiq . Beta is the last Whisperer to die in the TV Series. Beta appears in the archival footage shown at the beginning of \" Lockdown \" as Judith narrates past events of the show to the audience before the episode's story begins.",
        "Name": "\"Beta\""
    }
]