[
    {
        "Betsy": "Betsy",
        "Pre-Apocalypse[]": "Nothing is known about Betsy's life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "At some point during the apocalypse, Betsy was found by Aaron after recruiting another survivor as they were making their way to the Alexandria Safe Zone . Soon after, Betsy and David formed a close relationship and eventually got married. Having survived the attack by the the Wolves , Betsy is among the surviving townspeople to gather by the front gate and damaged wall panel. She is in a complete state of shock and stares at the wall, completely despondent over her recently deceased husband, David. As she and the others listen to Rick and Aaron addressing the crowd regarding the attack, she is briefly comforted by fellow widow Jessie Anderson . A short time after the speech, Betsy and two other women create a memorial on one of the wall panels and paint the names of those lost during the attack and the compromised redirection of the walkers from the rock quarry. Later that day, Betsy commits suicide over the loss of her husband and having no will or reason to live. When Jessie walks by Betsy's house, she realizes something is off about her home and approaches the front door. At the window, she discovers a reanimated and bloodied Betsy and proceeds to put her down as other residents watch in horror.",
        "Death[]": "Killed By Herself (Suicide, Alive) Depressed over the death of her husband, or because she thinks it's the end over the hordes at the gates, Betsy kills herself by slashing her wrists. Jessie Anderson (Zombified) Jessie finds a reanimated Betsy in her home, and puts her down by stabbing her in the eye.",
        "Killed Victims[]": "This list shows the victims Betsy has killed: Herself (Suicide, Alive) Possibly a few zombies",
        "Appearances[]": "\" Now \" (No Lines)",
        "Trivia[]": "Betsy is incorrectly credited as Betsey while Talking Dead and David's note in \" Thank You \" spells her name as Betsy. The name of her counterpart in the Comic Series is also spelled as Betsy. Betsy, along with Tommy , are absent from the memorial wall, despite being Alexandrians who recently died. Betsy is the only named character to be killed by Jessie Anderson , albeit zombified.",
        "Name": "Betsy"
    }
]