[
    {
        "Billy": "",
        "Fate": "",
        "Contents": "",
        "Pre-Apocalypse[]": "Nothing is known about Billy's life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "Though unseen, Billy is one of the men who invade the house Rick , Carl , and Michonne were staying in. After Lou turned, Joe mentioned to Daryl that he attacked the whole group before being put down. Billy is first seen with his group gathering around Daryl , while Daryl is sitting down in the middle of a road. After Daryl punches Joe and points his ready-to-fire crossbow at Joe, Billy and the other group members point their guns at Daryl. After Joe talks Daryl into lowering his crossbow, Billy and the other group members lower their guns too. Billy is first seen sleeping on the ground in the forest. As a walker approaches, he wakes up and watches Harley kill it. He sits up and empties a can. Billy along with the rest of the group walks along the tracks. As a walker roams up to them, he hands his gun to Harley. As Tony pushes the walker to Dan, Billy then stabs it with a tire iron. As they walk along the tracks, Joe tells them to take shelter in the car shed. He aims his gun and clears out the shed. As the group is checking the place out he claims the car that Daryl uncovered and kicks aside his trash bag. He is seen sitting on a chair in the background eating food. The next morning he watches as Len confronts Daryl and Len is deemed a liar. Billy along with Harley, Dan and Tony are ordered by Joe to beat up and kill Len. Billy starts kicking and punching Len as he is on the ground. They later shoot a arrow into Len's head killing him. He leaves the shed and walks along the tracks, and he along with the group, finds a sign pointing to Terminus. Joe and his group ambush Rick, Michonne, and Carl. Billy is seen walking out of the forest with his gun and stands behind Daryl. Daryl is deemed a liar by Joe saying that Rick is a good man and Joe orders Billy and Harley to bash him up. Billy proceeds to push him against the car and punches Daryl. Billy and Harley continue to beat up Daryl until Rick bites out Joe's throat. He looks over in shock and becomes distracted. He is then punched in the face by Daryl and is thrown to the ground before Daryl brings his heel down on his head, smashing his skull in and killing him.",
        "Death[]": "Killed By Daryl Dixon As Billy is beating up Daryl along with Harley, the rest of his group start to get killed, confusing him. Daryl knocks him to the ground and then stomps his head.",
        "Killed Victims[]": "This list shows the victims Billy has killed: Lou (Zombified, Possibly, Alongside fellow Claimers ) Len (Alongside his fellow Claimers) Numerous counts of zombies and possibly unnamed people",
        "Relationships[]": "",
        "Appearances[]": ""
    }
]