[
    {
        "Bob Stookey": "",
        "Overview[]": "\"Bob is deeply haunted by his past — pre- and post-zombie apocalypse. As a result, he’s a bit of a loner, although he maintains a charming/self-deprecating/confident public face .\" [1] It should be noted that Bob's outlook improves drastically after surviving the prison assault with Maggie Greene and Sasha, as he was previously the lone survivor of every group he was involved in.",
        "Pre-Apocalypse[]": "Very little is known about Bob's life prior to or as the outbreak began. At some point in his life, he served in the U.S. Military as a medic and is haunted by his past as seen with his bouts of alcoholism that causes a confrontation with Daryl Dixon . Being a former army medic, Bob has experience with firearms and medical training, having been seen treating Glenn Rhee while he was sick from the flu. He is also proficient with most forms of small arms, including but not limited to carbines, rifles, and pistols.",
        "Post-Apocalypse[]": "Bob states that he had been a member of two separate survivor groups before he was found by Glenn and Daryl. He was the sole survivor of both groups after they were overrun and believes it's his curse to see everyone and anything around him die or be destroyed. He has also become heavily dependent on alcohol to cope with his experiences and he admittedly drinks himself to sleep at night. Due to his experiences, Bob suffers from survivor's guilt and goes on to accept his \"curse\". Bob is found by Daryl Dixon and Glenn Rhee about a week before the start of Season 4. He has seen things go bad \"over and over\" and winding up in the safe prison has not shaken those experiences from him. [2] Bob is first seen approaching those who are going on the supply run to the Big Spot . Bob addresses them stating he would like to come with them to help out, saying he needs to start helping out with things since arriving at the prison the previous week and receiving a weeks worth of meals and a roof over his head. Sasha Williams is initially reluctant, but some convincing, mainly from Daryl, changes her opinion and she allows him to join the supply run. While the group is looking for supplies he finds a shelf full of wine, and picks up a bottle. Initially thinking of taking it, Bob changes his mind and puts it back. The entire shelf cracks under the bottle being put back and tips over onto Bob, trapping his foot under the shelf. The sound of the shelving unit collapsing attracts walkers who are on the roof and begin to fall through the worn out ceiling. A legless walker that had fallen through spots Bob and starts crawling towards him. He pulls the remaining skin off the walker's face, hoping that it won't get to him. Then Daryl comes and pulls the zombie away and stomps on its head. Daryl and Zach subsequently lift the shelf, setting Bob free, but Zach is bitten and killed in the process. They manage to escape just before a large, wrecked helicopter that was on the roof crashes through the ceiling, destroying the mall. Later that night back at the prison, Bob lays in his bunk visibly upset about how Zach lost his life saving him. Bob, who lives in Cell Block D, is one of the residents to escape the zombie attack, but not before Rick gives him a shotgun that he seized from an old man who was shooting in the block. Later, Bob is seen alongside Rick Grimes , Hershel Greene , Sasha, and Daryl as Dr. Caleb Subramanian explains the cause of the infections that are developing around the prison, suggesting that a flu may have caused Patrick 's sickness and death. Bob approaches Sasha's brother Tyreese after his fight with Rick and suggests he get his wounds looked at, but Tyreese insists on burying Karen and David first, so Bob grabs a shovel and helps him. Later, Bob goes with Daryl, Tyreese, and Michonne Hawthorne on the supply run to the veterinary college to get medicine for the infected survivors. On the way to the college, between constant static, the group hears a voice over the radio, causing Daryl to get distracted while trying to catch the frequency again. This causes them to run into a few walkers until encountering the largest herd of walkers ever shown thus far, approaching them from the front. Daryl tries to go in reverse, but the car gets stuck with walkers piling under it until the tires have no traction. Seeing that they are trapped, the group leaves the car and plans to run into the woods. Bob uses his pistol to clear a path for himself and notices that Tyreese never left the car and is being surrounded. He urges Tyreese to leave the car. Tyreese snaps and begins smashing skulls, attracting all the walkers, and yelling for the group to go, so they leave him. After regrouping together, Bob, Daryl, and Michonne see a walker approaching and then Tyreese comes out the woods alive so the group help him up and continue with the mission. Bob continues to help Tyreese, Michonne, and Daryl on their mission to retrieve medicine from the veterinary college. While helping Daryl jump-start a van they found, Bob says that he almost started to run when Daryl found him because he was the last man standing in the first two groups he was with, and that he blames himself for Zach's death because of accidentally knocking over the liquor shelf and attracting the herd of walkers, to which Daryl tells him that it is \"bullshit\". After getting the medicine, the group is forced to jump outside onto the roof of a walkway where Bob almost loses his bag to a herd of walkers, but manages to retrieve it despite the protests of the others to let it go. Daryl discovers Bob's bag contains nothing but a bottle of liquor, but Bob has his hand on his holster when Daryl attempts to throw it away. An unintimidated Daryl disarms Bob and grabs him until Tyreese breaks it up, saying that Bob has made his own choice. Daryl says that they should have never let him join the prison group to begin with and threatens to beat Bob into the ground if he takes a sip of the liquor before the medicine is given to the sick members of the group. Bob and the group arrive back at the prison after Rick and Carl successfully defeat the horde of walkers that crashed through the fence. Bob is then shown with Hershel and Maggie in one of the cells, preparing vaccinations and tending to an extremely ill Glenn. Hershel mentions the next morning that Glenn is breathing on his own now that Maggie and Bob are with him. Bob is contemplating his bottle of whiskey when Sasha appears and tells him that she owes him her life. He is next seen outside with the others when The Governor marches on the prison. When Daryl begins to arm the survivors, Bob is the first person he gives a weapon to. After The Governor executes Hershel, he opens fire on him and his militia with his fellow survivors as they storm the prison. During the firefight, he is hit in the shoulder, but finds an exit wound, and is last seen fleeing with Sasha and Maggie. Sasha is seen bandaging Bob's shoulder wound while Maggie sharpens her knife. Maggie then tells them to stay put while she goes to look for the bus full of other survivors, including Glenn. Bob insists that they go together and she refuses but they follow her anyway. The three of them find the bus, but it's full of the now undead survivors. Maggie convinces the other two to clear the bus of walkers, to find out for sure if Glenn died with the other survivors. They clear the bus, and Maggie discovers that Glenn wasn't among those on the bus. The episode begins with a flashback of Bob and his travels before being recruited at the prison. He is seen wandering alone through the forest setting up camp under an old bridge, then getting drunk and later resting on top of a semi-trailer. Presumably a few hours later, Daryl and Glenn pull up on a motorcycle and truck, where they and Bob meet before they ask him the three questions necessary to enter the prison. When asked how many people he has killed, he responds with \"one\", explaining that she asked him to do so. Bob seats himself in the back of the truck and they return to the prison. He is then seen in the current day, surrounded by walkers in the fog with Maggie and Sasha. During the skirmish, he is bitten on the shoulder, but to everyone's relief, the bite did not go through his bandage, and Sasha embraces him. Later, the three of them find a sign with directions to Terminus, and Bob notes that he heard them broadcasting on his way to the college. While Sasha is skeptical, Bob is more than willing to help Maggie get there and possibly find other survivors from the prison. While Maggie is out getting fire wood, Sasha tells Bob that they need to convince Maggie to stop looking and find higher ground to settle down for safety reasons. When Sasha and Bob wake the next morning, they find that Maggie is gone and has left a note telling them to not risk their lives for her. Bob decides to try and catch up to her, with Sasha in tow. Sasha confronts Bob about always smiling since leaving the prison and he tells her that he has broken his streak of being the only survivor again. He proclaims that he is happy to not be alone again. The following night Sasha tells Bob to try and sleep because he is still bleeding and needs to heal. Bob instead confronts Sasha for assuming that Tyreese is dead and being afraid to go to Terminus to find out for herself. He then tells Sasha that he always thought she was the toughest and sweetest. While walking, the two find an area filled with buildings, and Sasha states that she wants to settle in one of the taller buildings and start a new life. But Bob insists they keep moving and catch up with Maggie. The two part ways, with Bob giving Sasha a goodbye kiss. Shortly afterwards Maggie and Sasha reunite and catch up to Bob. The three embrace, then continue down the tracks towards Terminus. Bob appears alongside Maggie, Sasha, Abraham Ford , Rosita Espinosa and Eugene Porter as they gun down walkers in the tunnel, where they find Glenn and Tara Chambler . Later on, as the group settles down for the night, Bob agrees to go to Terminus, and later Washington with Sasha. The next day, the eight survivors reach Terminus, and are greeted by Mary , who offers them something to eat. Bob appears with Maggie, Glenn, Sasha, Tara, Rosita, Abraham, and Eugene inside the boxcar after they were captured upon their arrival, and reunite with Rick, Daryl, Carl, and Michonne when they enter. Bob is first seen making a weapon in the boxcar along with the rest of the group. When the guards arrive and gas the group Bob is removed from the boxcar along with Rick, Daryl and Glenn. They are taken to a trough and Bob is put on the end of the row. After four strangers are killed, Gareth arrives and the killing stops just before Glenn is killed. Bob grabs Gareth's attention and tries to plead with him to take a chance, about getting Eugene to Washington, but Gareth ignores his pleas, telling him \"Can't go back, Bob\". Next Gareth interrogates Rick for information about the bag of guns in the woods. Gareth threatens to put a knife through Bob's eye if Rick doesn't tell him. Bob is saved when Rick tells. After Carol blows up the fence, Rick kills the two men guarding them and frees Bob. Bob then fights his way to the boxcar with Glenn, Rick and Daryl where they free the others. He then helps fight out of Terminus. He is last seen walking away from Terminus next to Sasha after the group reunite with Carol, Tyreese and Judith. As the group is travelling, Bob and Sasha are playing a game where Sasha would name a bad situation or thing and Bob would say the good things in it, like mosquitoes and long socks, or beating sun and a nice tan. Bob helped kill the walkers surrounding Gabriel Stokes , and also helps in clearing the church . He then comes along to the food bank and helps kill the basement walkers. After all of them are dead, he sees bubbling in the water. He believes he can handle it, but the walker bites him on the right shoulder, and Sasha hits it with a box. After celebrating in the church, Bob walks outside to the tree with the L-shaped carving and comes to tears. A Terminite sneaks up on him and knocks him out. He wakes up around a group of people and Gareth is making a speech about an eye for an eye and how it has played out in the relationship between the group and the Terminites, renamed \"The Hunters\". He then goes on to talk about what they had to do to survive, and says, \"You know, Bob, we didn't have to do this,\" and Bob looks down, terrified, at his missing left leg. Gareth then delivers the final line, \"If it makes you feel any better, you taste much better than we thought you would...\" As Bob's leg is being eaten, he begins to cry before breaking into a maniacal laugh, revealing his bite and repeating the words \"Tainted meat!\" before being knocked out by Gareth. Afterwards Bob is left at the church where he is recovered by Sasha as Gareth shoots at them. Bob breaks the bad news about the bite when they were searching the food bank earlier that day. Father Gabriel tells Sasha that he can rest on the couch in one of the rooms before he dies. Sasha and Tyreese are in where Bob is resting. Tyreese recommends that Sasha forgive the Hunters for amputating and eating his leg but Sasha denies this. Tyreese is given a knife by Sasha and says, \"If he stops breathing then put it in his temple, that's what Bob would want\" before leaving the room to search for the Hunters with most of the group excluding Bob, Tyreese, Carl, Judith, Rosita, and Eugene. When Gareth and the Hunters enter into the church, Rick and the others ambush them and massacre them all. The next morning, the group goes to say their goodbyes to Bob. Before Rick departs, Bob tells him to stay and thanks him, telling him he didn't know if there were good people left before he arrived at the prison. He tells Rick to look at Judith if Rick doesn't believe that \"the world isn't gonna change\". Bob and Sasha are later talking to each other and Bob is seen smiling. Sasha asks him why he's smiling and Bob says he had a dream in which she was smiling back at him. Sasha asks him what the good will be out of their bad, referring to the game they were playing the day before, but Bob is dead before he can answer. Sasha is about to put Bob down until Tyreese comes into the room and tells Sasha to give him the knife. Tyreese looks at Bob one last time before stabbing him so he doesn't reanimate. The remains of Bob's amputated foot appear when Gabriel sneaks away from his church, ending up at the school where the Terminus survivors set up camp and kidnapped Bob. Gabriel is visibly disturbed by the sight. Bob appears as a hallucination alongside Martin , the Governor , Lizzie Samuels , Mika Samuels , and Beth Greene , all with bullet holes and stab wounds, after Tyreese is bitten. After Martin scolds Tyreese for not killing him at Terminus and leading Gareth to them which he states is the reason Bob and Beth died, Bob appears and tells Tyreese, \"That's bullshit\", reminding him he was bitten at the food-bank. While the Governor and Martin accuse him of failing to do what's needed, Bob, Beth, Lizzie, and Mika assure him that he did the right thing and tell him it's okay to let go. After Tyreese's arm is amputated by Michonne, he begins to die of blood loss. In the car, he sees Bob, Beth, Lizzie, and Mika again, minus their wounds, and decides to let go to join them in death. Bob appears in a flashback sequence when Sasha has a panic attack. Bob appears very briefly in one of Michonne's flashbacks to \" Isolation \". While Rick is taking out his machete, he remembers his talk with Bob while walking to the food bank in \" Strangers \", and proceeds to hear Bob's voice in his head. Bob appears briefly in a flashback when Rick reflects on memories with all of his friends while panicking over the possibility that his other friends could be killed by the Saviors .",
        "Death[]": "Killed By Zombies During a supply run at the flooded food bank, Bob is dragged underwater and is bitten on his shoulder by a walker that snuck up on him. Tyreese Williams (Before Reanimation) After Bob dies from his bite, Tyreese stabs him in the head to prevent reanimation.",
        "Killed Victims[]": "This list shows the victims Bob has killed: Zach (Indirectly Caused) Tony (Zombified) Teenage Girl (Zombified) Prison Newcomer (Zombified) 1 unnamed woman (Out of Mercy) 1 unnamed Big Tony's Express Mart employee (Zombified) A few unnamed prison residents (Zombified) Numerous counts of zombies",
        "Quotes[]": "For more of Bob's quotes, please visit Bob Stookey (TV Series)/Quotes . The following is a list of some of Bob's most memorable quotes.",
        "Appearances[]": "",
        "Trivia[]": "The casting call for this character used the name Roy Stark. [1] [3] Bob was described as \"A former army medic who is deeply haunted by his past pre- and post-zombie apocalypse. As a result, he's a bit of a loner, although he maintains a charming/self-deprecating/confident public face.\" Bob was an alcoholic, or at least has an alcohol problem (similar to his comic book counterpart ). There are several examples of this: In \" 30 Days Without An Accident \", he walked past a wine aisle and, after some hesitation, picked up a bottle off the shelf only to put it back soon after. Also, in \" Indifference \", he steals a bottle of whiskey instead of the medicine, something that angers Daryl , who knew how Bob had caused Zach 's death in the first place. In \" Alone \", he is seen drinking a bottle of over the counter cold medicine. Some cold medicines contain alcohol. It is also possible that he was taking advantage of a cold medicine containing dextromethorphan, which is sometimes used recreationally to attain a dissociative, euphoric state. Bob said that he was the last living member of two groups he was previously with. He was also the last survivor of the newcomers at the prison introduced in Season 4 , along with being the last in line for execution in Terminus . Bob is the second series regular to die while being credited under \"Also Starring\", the first being Gareth , the third being Deanna Monroe , the fourth being Jessie Anderson , the fifth being Spencer Monroe , the sixth being Simon , the seventh being Gregory , the eighth being Siddiq , and the ninth being Leah Shaw . Bob's jacket carries patches for both the 82nd Airborne and 1st Armored Division. This may imply that he was in the Armored Division and Airborne Division as a soldier as well, or at least a Combat Medic. Bob is the third main character to be bitten by a walker, the first being Hershel Greene , the second being Andrea Harrison , the fourth being Tyreese Williams , the fifth being Deanna Monroe , the sixth being Carl Grimes , and the seventh being Rosita Espinosa . Bob is the last named character who is killed by Tyreese Williams in the TV Series , who put him down before reanimation. Bob is the third main character to receive an amputation, with the first being Hershel Greene , the second being Merle Dixon , the fourth being Tyreese Williams , the fifth being Aaron , and the sixth being Lydia . Bob appears in the final flashbacks of the last episode \" Rest in Peace \". Excluding the original main cast, Bob is one of seven main characters who is listed as a main character upon his first appearance, the others being Lance Hornsby , Philip Blake , Gabriel Stokes , Michael Mercer , Alpha , and Pamela Milton .",
        "References[]": ""
    }
]