[
    {
        "Brady": "",
        "Overview[]": "Brady is a brave soldier who cares for his men. Seemingly the highest ranking member of his group, Brady seems to act as the leader of the soldiers. Though somewhat untrusting to outsiders, he and his men are hostile and converse the Governor when he arrives at their camp. He is shown to be grateful when the Governor informs them of Lieutenant Welles survival. However, this lowers his guard along with his men, which leads them to be gunned down the Governor and his men.",
        "Pre-Apocalypse[]": "Very little is known about Brady's life prior to or as the outbreak began, except that he was a soldier in the U.S. Military and the Georgia National Guard's 48th Brigade Combat Team.",
        "Post-Apocalypse[]": "Sometime after the initial outbreak, Corporal Brady, among other National Guardsmen, was stationed at a fortified refugee center to help protect those inside. Days before the events of the episode \" Walk With Me \", one National Guardsman was bitten by a walker inside the encampment. Panicked individuals opened one of the gates to escape, allowing walkers to overrun the encampment. The corporal and ten other National Guardsmen, among them being Sean , Franklin , Wilson , and Lieutenant Welles , escaped the chaos and traveled for about sixty miles before they were blocked by a jammed highway (which may have been the same highway that prevented Rick Grimes ' group from reaching Fort Benning and detoured them to Hershel Greene's farm ). Welles, Sean, and Franklin then took their helicopter out to scope the landscape ahead, while the Corporal and the rest of the convoy stayed behind, waiting for their return. After the helicopter crashes, Welles is taken to Woodbury by the Governor and his men, where he reveals to the Governor the location of his convoy before he is killed. Later the next day, the Governor drives up in a car to the convoy's location, waving a white flag. In extreme precaution, the convoy aims their sights at the Governor as he approaches. With his M4A1 at the ready, the corporal asks about Welles' location and well-being. The Governor lies, but is able to assure the corporal and his men that Welles is alive and well in Woodbury, and invites them to the town. After the convoy lets their guard down from hearing the \"good news\", the Governor shoots the corporal in the chest with a pistol , leaving the rest of the convoy to be ambushed and killed from a surprise attack by Woodbury soldiers. The Governor approaches the corporal, who is gurgling blood, and beats his face in with the butt of his gun, which inevitably kills him. After the downfall of Woodbury and the massacre of the Woodbury army at the hands of the very man who created it, the Governor, Martinez , and Shumpert go back to the site where they slaughtered Corporal Brady's men and set up camp. The bodies of the corporal and his men are seen almost fully devoured. That night, Martinez and Shumpert abandon the despondent Governor and leave him only little supplies to live off of.",
        "Death[]": "Killed By Lieutenant Welles (Indirectly Caused) While being treated in Woodbury, Welles is tricked by the Governor into revealing his convoy's location by claiming they will be brought to safety in Woodbury when in fact they will be ambushed and killed for their supplies. Philip Blake The Governor arrives at the convoy's location and leads them into believing he is friendly and that he has recovered Welles. Unexpectedly, Philip shoots Brady in the shoulder, while the rest of the soldiers are massacred. Brady, barely alive, then has his face smashed in three times by the Governor, who uses the butt of the corporal's gun.",
        "Killed Victims[]": "This list shows the victims Brady has killed: Possibly numerous unnamed enemy combatants (Pre-Apocalypse) Possibly numerous counts of zombies and unnamed people",
        "Appearances[]": "\" Walk With Me \" \" Live Bait \" (Flashback, Corpse)",
        "Trivia[]": "This character is credited as Corporal in \" Walk With Me \" while his name is visible on his uniform. Brady is the first named character to be directly killed by Philip Blake in the TV Series ."
    }
]