[
    {
        "Brandon": "",
        "Fate": "",
        "Contents": "",
        "Overview[]": "Despite initially coming off as a normal young adult, Brandon is actually a psychotic and dangerous individual, who has little to no sense of morality. Growing up in Alexandria after his parents were killed, Brandon blamed Rick Grimes for their deaths and developed a rather romanticized view of the Saviors , as well as a disturbing obsession with their former leader, Negan Smith . Despite never attempting to free Negan himself, Brandon quickly latches himself onto his idol after he catches up to him, and loyally follows him wherever he goes. At times, Brandon seems completely detached from reality, as he doesn't act any different even in dangerous situations. This can be seen when Negan is attacked by a walker. Rather than help, Brandon oddly enough prioritizes making another \" Lucille \" out of his backpack so he can gift it to Negan. Even after he is rejected and insulted by Negan, Brandon delusionally interprets this as a test and proceeds to murder Amelia , a mother and her child Milo , in order to prove his devotion, which ultimately (and somewhat ironically) results in Negan bashing his head in.",
        "Pre-Apocalypse[]": "Nothing is known about Brandon's life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "At some point in the apocalypse, Brandon and his parents somehow came into contact with a group named \"the Saviors\" which they subsequently joined, during where he developed an obsession with Negan and his leadership based on stories told by his father. After losing his family during the war against the militia , Brandon becomes an orphan and is taken to the Alexandria-Safe Zone , where he is adopted by one of the residents and begins to live with his adoptive father. Brandon is in charge of watching over Negan Smith as he works in the community gardens during the day. He reminds Negan to get back to work after he says hello to the passing council members and calls out to Lydia . When Lydia gets too close while speaking with Negan, Brandon warns her to stay back from him but Lydia ignores him. After Negan rescues Lydia from her bullies one night in Alexandria, Brandon arrives at the scene of the commotion to find Margo 's dead body and takes Negan back into custody. Sometime either during the night or early the next day, Brandon discovers Negan has escaped from his cell and follows him into the woods. Brandon finds Negan by a river and pretends to hold a knife to him. He reveals he is joking and tosses him a canteen. Negan drinks from it and then flashes a smile. Later that day, Brandon tries to mimic the Saviors' whistling and decides to accompany Negan. As they walk around the woods, Brandon starts fantasizing about the Sanctuary and reveals he is mad that Rick Grimes killed his parents. He then claims he heard that Negan shot Carl Grimes . Negan gets angry and corrects him, saying he would never kill a kid. \"We're both Negan\" , Brandon says seemingly understanding him. When they stumble upon one of the Whisperers' borders, Brandon watches as a walker attacks Negan and instead of helping him, makes him another wired wrapped bat that resembles Lucille and also hands him his original leather jacket he took from the community before leaving. Negan smiles but asks him to put it all back in the bag because he doesn't want to be recognized. As they keep looking for shelter, Brandon asks Negan to rate female walkers on hotness when suddenly they hear screams from inside a bus. Negan runs inside and stabs several walkers to save a woman and her son. Brandon arrives and complies Negan on his brutal walker killings, comparing him to his old self. While Amelia takes her son Milo for a walk after sharing her story, Brandon suggests to Negan to rob them, to which Negan stops him and orders him to go back to Alexandria. Brandon says he can't go back, so Negan tells him that he doesn't care and to just leave him alone. \"You're just like all the others,\" Brandon says before leaving. However, Brandon believing Negan to be actually testing him heads back to the bus site and brutally murders Amelia and Milo by beating them with a tire iron. He then starts whistling proudly as Negan arrives. Brandon smiles believing to have passed the test but before he can call himself Negan, he is beaten brutally to death by a furious Negan with a rock.",
        "Death[]": "Killed By Himself (Caused) Believing Negan to be testing him in some form, Brandon murders Amelia and Milo with a tire iron. Negan Smith When Negan returns and discovers the grisly scene, Brandon gloats about his kills. Before he can proudly proclaim he is Negan, Brandon is hit in the head by Negan with a stone, knocking him out cold and allowing Negan to finish Brandon off by bashing his head in several times.",
        "Killed Victims[]": "This list shows the victims Brandon has killed: Amelia Milo Himself (Caused) Possibly numerous counts of zombies",
        "Relationships[]": "For a more in-depth look at Brandon's relationships, read here: Brandon (TV Series)/Relationships Negan Smith - Former Leader and Killer Alexandria Safe Zone Michonne Grimes - Former Leader Milo † - Victim Amelia † - Victim",
        "Appearances[]": "\" Lines We Cross \" \" Silence the Whisperers \" \" What It Always Is \"",
        "Trivia[]": "Unlike his Comic Series counterpart , Brandon is a former Savior who then moved to Alexandria after the war instead of the Hilltop. Furthermore; he is not the son of Tammy Rose . The most notable similarity Brandon has to his Comic Series counterpart is (somewhat more justifiably) blaming Rick Grimes for the death of his parents. On Talking Dead's In Memoriam, he is credited as \" I am Negan ! I am Brandon ! I am Dead! \". Brandon is the last Savior introduced in the TV Series . He is also the only Savior introduced in Season 10 ."
    }
]