[
    {
        "Brandon Carver": "",
        "Fate": "",
        "Contents": "",
        "Overview[]": "Brandon is a brutal, sadistic, abrasive, cocky, and violent individual. He is shown to take sadistic joy out of fighting and takes every opportunity to do so even if it is impractical, such as wanting to take down a herd of walkers by force despite Daryl giving an easy way to diverge them. Brandon seems to be on good terms with his fellow Reapers , particularly Leah despite their occasionally contentious relationship. However, according to Leah, the rest of the Reapers know not to rile him up as he has a hot temper. He is so rageful and sadistic to the point he gets enraged when Daryl has to take over torturing Frost . Despite coming off as just a hotheaded brute, Brandon is shown to be quite smart. While searching a house for Maggie's group, they find nothing, but Brandon believes they are missing something. He almost ends up finding Maggie's group in the basement and most certainly would've if Daryl hadn't stalled for time. Brandon has a high dislike for Daryl, suspecting him to not be truly loyal to the Reapers, which would later be proven correct after finding Pope dead and being told by Leah that Daryl killed him. In turn, Daryl is shown to hate Brandon for his behavior and his actions, but he is willing to spare Brandon's life in the hopes of a peaceful solution to the conflict due to how much he knows that Brandon means to Leah. Due to his military training, Brandon is incredibly skilled in combat, shown when he manages to take on Negan , Maggie , and Elijah all at once and overpower all of them with minimal effort. Before that, he is shown to be on equal level against Daryl, if not slightly more so, when they first encounter each other. He shows no remorse to his enemies, such as when confronted by Elijah about killing his sister , he merely smiles and says \"okay.\" Brandon's ultimate downfall would be his cockiness when his guard is lowered when he is humored when Negan takes out a bell. Elijah manages to distract Brandon by throwing his kama at him, allowing Negan to hit Brandon in the face with the bell, knocking him out. After being released during the standoff, Brandon makes the situation worse by taunting and mocking Elijah and would've harmed him further if Gabriel hadn't shot him in the leg. Brandon's actions would be a contributing factor in Maggie's decision to kill the remaining Reapers. Defiant to the end, as Maggie goes to kill him, Brandon reaches for a knife in a last ditch effort to try to fight back, but it is no use. He would end up being killed with one of Elijah's kamas , avenging his sister's death.",
        "Pre-Apocalypse[]": "Prior to the outbreak, Brandon was fighting in Afghanistan along with the rest of his squad which included a lot of members that would eventually become the Reapers . Upon returning from war, he struggled to find jobs or deal with trauma, but the relationship between him and his comrades remained strong. He then decided to become a mercenary.",
        "Post-Apocalypse[]": "During the beginning of the outbreak, as Operation Cobalt was put into action in an attempt to try and contain the undead threat, Pope and a group of his people managed to escape the bombings by running until they reached an abandoned church, where inside Pope was amazed to see none of them had been killed or injured, leading him to view him and his comrades as \"the chosen ones\". It is unknown if Brandon was present during this revelation. Regardless, he eventually joined the Reapers, and either found or crafted his own mask with a smiling, white skull expression on it. At some point after the outbreak, Brandon and Leah Shaw would find themselves clearing a hospital full of walkers in Rockport, Maryland, where the former would wind up having to be saved by his comrade. At some point, Brandon and his group eventually attacked a group of survivors led by Maggie Rhee despite having no previous hostilities with her group and succeeded in destroying their camp and killing numerous members of her group, causing them to flee to Virginia. He and his group eventually followed them to finish them all off due to his leader, Pope marking Maggie's group. While not part of the Reapers ' initial attack on Maggie's group, Brandon, along with Michael Turner , Jenson , and Leah Shaw , remained hidden near the forest. After escaping into the woods following the Reapers' ambush of Maggie 's group, Daryl is confronted and attacked by a masked Brandon. Dog intervenes, attacking Brandon, who picks the animal up and non-fatally tosses him over a small ledge. Daryl is eventually outnumbered as reinforcements arrive, and again flees into the night. The next morning, when Leah finds Dog wandering about, she confronts Daryl, and Brandon reappears with several other Reapers to take him captive. Brandon drags Daryl back to Meridian with the aid of Powell , where he helps Leah and Paul Wells waterboard him for information about the people he was with. Daryl refuses to divulge any truthful information, much to Brandon's annoyance, but the latter reluctantly leaves along with Paul on Leah's orders, despite his insisting that one more session of water torture will break their prisoner. After Leah talks with Daryl in private, Brandon and Paul drag him off once more to a holding cell, where they subsequently return to bring a similarly captured Frost for interrogation. Brandon later retrieves Leah after Bossie returns with the body of Michael Turner , a revelation of events which greatly upsets the members of the small group. He later taunts Daryl with Wells and Bossie before he meets Pope. Brandon is present at Daryl's initiation, waiting outside with all the other Reapers for the inductee to pass the test. As Pope declares Daryl \"forged by fire\", Brandon and the rest of the Reapers welcome Daryl with a latin mantra. Brandon attends the fireside dinner talking with Leah, where Daryl eats his first meal as a Reaper, and subsequently watches in silence as Pope burns Bossie alive, accusing him of turning his back on his brothers and letting Michael get killed. Carver tortures Frost and demands to know where his people are. Frost says nothing. Pope orders Daryl to take a turn interrogating Carver. Daryl puts Frost in a chokehold and orders him to give up his friends' location. Frost refuses. Daryl chops off Frost's finger and again demands to know the location of his friends. Frost finally reveals the location of the supply depot. Pope dispatches Leah to scout the location with a crew of Reapers. Carver, Leah, Daryl and a crew of Reapers approach the supply depot. The Reapers burst into the supply depot and search the house. No one is there. Leah orders them to search the entire town. The Reapers search another house. Leah finds some wet, bloody bandages, indicating someone was recently there. Daryl notices a trap door under a rug and quietly slides the rug over the door. He offers to track Maggie's group outside. Carver suspects something and quarrels with Daryl. Leah sends Carver upstairs to sweep the rooms one more time and warns Daryl not to anger Carver. At the hideout, Carver comes up with nothing. Daryl argues with Carver, and criticizes the Reapers' plan of attack and slyly incorporates intel about the Reapers as he talks, knowing that Maggie's group is listening. Carver accuses Daryl of being disloyal. Daryl admits that the only reason he joined the Reapers is because he cares about Leah, but says he will follow Pope out of fear. Carver notices the trap door and opens it. The basement is empty. The Reapers return to Meridian. Carver tells Pope that Maggie's group got away. Pope reveals that he continued to interrogate Frost after they left and got all the information he needed. They see Frost tied to a post: he is now a walker. Pope confers privately with Carver as they head inside and laughing with him about something. Carver is among the Reapers on the wall speculating why the herd of undead in the distance are meandering around like that. He suggests that it's nothing but Pope argues there's a reason for everything. When Daryl suggests an easy way to divert the horde, he says the plan has no \"balls.\" He later watches the horde return as they are blown up by mines. Carver radios Pope to report that the horde has returned. After Leah kills Pope and radios everyone that Daryl murdered their leader and is with the enemy, Carver arrives with Boone seconds after Daryl manages to escape. Seeing Pope dead and conforming his suspicions of Daryl, Carver expresses his anger at not killing him when he had the chance. Leah instructs them to close the gate and kill everything inside of the walls. After the destruction of the herd by the hwacha , Brandon joins the other Reapers in hunting Maggie 's group through Meridian 's school. Brandon apparently succeeds in cornering Maggie, only to have Negan and Elijah emerge from nearby doors. Elijah angrily confronts Brandon over his murder of Elijah's sister which Brandon nonchalantly responds to with no remorse. Brandon proves to be more than a match for the three, but after Elijah creates a distraction, Negan manages to subdue Brandon. Before Maggie can kill him, Daryl arrives and knocks Brandon unconscious instead, suggesting that they trade Brandon to get what they want from Leah due to how much she cares for her family, \"especially this asshole.\" Daryl contacts Leah and arranges the trade, holding a knife to a gagged Brandon's throat and threatening to kill him while Brandon makes muffled arguments. Using Jenson as a sniper, Leah forces Daryl to release Brandon who mockingly blows kisses at Elijah. Despite his injuries, Elijah charges at Brandon in an attempt to get his revenge for Josephine 's murder, but collapses. As Brandon moves to kill Elijah, he is suddenly shot in the leg by Gabriel Stokes who has killed Jenson and taken his sniper rifle, forcing Leah to accept Daryl's deal. However, Maggie refuses to release Brandon and Leah says goodbye to him, promising to see him later. As Leah, Boone and Washington leave, Elijah reminds Maggie of her promise to exact revenge upon Brandon and the rest of the Reapers for the massacre of all of their people. Maggie shoots and kills Boone and Washington while Leah gets away. When Maggie tries to shoot Brandon, she discovers that the gun is out of ammunition, giving Brandon time to grab a knife that was dropped by Boone to defend himself. However, Maggie grabs one of Elijah's kamas , kicks the knife from Brandon's hand and drives the kama into his chest, killing Brandon in revenge for his murder of Josephine.",
        "Death[]": "Killed By Gabriel Stokes (Caused) Elijah (Caused) Maggie Rhee Gabriel shoots Carver in the leg in order to prevent him from harming Elijah, leaving him immobilized. After deciding against letting the Reapers go due to Elijah reminding her of her promise to get revenge upon all of them, Maggie kills two of them before turning the gun on Carver. Although she runs out of bullets and allows Carver the chance to reach for a knife, Maggie quickly kicks it out of his hand and stabs Carver in the chest with one of Elijah's kamas , killing him. It is unknown if he was put down or was left to reanimate.",
        "Killed Victims[]": "This list shows the victims Brandon has killed: Ms. Adams (Possibly) Leo (Possibly) Teresa (Possibly) Josephine (Alive) Numerous counts of enemy combatants (Pre-Apocalypse) Possibly unnamed Meridian residents Numerous counts of zombies and unnamed people",
        "Relationships[]": "For a more in-depth look at Carver's relationships, read here; Brandon Carver (TV Series)/Relationships",
        "Quotes[]": "The following is a list of some of Carver's most memorable quotes.",
        "Appearances[]": "",
        "Gallery[]": "For more images of Brandon Carver, please visit Brandon Carver (TV Series)/Gallery .",
        "Trivia[]": "Brandon is indirectly mentioned by Elijah in \" Promises Broken \" when he tells Maggie that he wants to kill the person who murdered his sister personally. However, Brandon isn't identified as the person that Elijah is talking about until \" No Other Way \". Due to Brandon being identified as Josephine 's killer, he is the only Reaper who is specifically identified as having killed a Meridian resident. While the other Reapers took part in the massacre , none of them are identified as having any specific victims from it. In the Memoriam on Talking Dead for \" No Other Way \", he is the only Reaper credited by name. Carver's death was spoiled on the official Walking Dead Instagram account, as a picture of him can be seen with a kama in his chest before the official release of \"No Other Way\". [1] In the episode \" Lockdown \", a voice clip of Carver coughing before he dies is used for a soldier as he bleeds out after being stabbed. Alex Meraz has a background in breakdancing and had the nickname \"Nomak\", who was a character in the movie Blade II , which Norman Reedus was in. Coincidentally, Nomak was also a Reaper, a fact that was jokingly brought up in a conversation between Alex and Norman. [2] When questioned on whether there was a love triangle with Carver, Daryl , and Leah , Alex Meraz stated that Carver and Leah have a brother-sister relationship and nothing sexual. [2] Alex Meraz confirmed that he had no idea he was going to be doing any fight scenes, but luckily he has a background in martial arts and is a black belt in shotokan karate. On his first day on set where they filmed his fight scene with Daryl in the woods, Norman Reedus thought Alex was a stuntman. While filming the hallway fight scene against Maggie , Negan , and Elijah , originally they were going to have a stunt-double do a lot of Carver's fighting, however the director was so impressed with Alex's skills that they had him do most of it. [2] Originally, Elijah was going to be the one to kill Carver, before they later changed it to Maggie. [2] Alex Meraz has expressed interest in reprising his role in Tales of the Walking Dead . [2] Brandon Carver and the Reapers are by far the deadliest combatants in The Walking Dead franchise, which could suggest a background in Black Ops or Special Forces before the Wildfire Virus outbreak.",
        "References[]": ""
    }
]