[
    {
        "Brooks": "",
        "Pre-Apocalypse[]": "Nothing is known about Brooks' life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "At some point during the outbreak, Brooks joined a community in Ohio. Brooks is among the soldiers with Lance as they pursue Daryl , Maggie , and the rest of the group. Later down in the sewers, Brooks, Lance, and the rest of the soldiers emerge and surround the group. However, Daryl appears from behind and grabs Lance while holding a knife to his throat. More and more soldiers emerge as Daryl orders everyone to lower their guns, forcing a tense stand-off. Through it all, Lance merely lets out a psychotic grin. Daryl is holding Hornsby hostage as the group is surrounded by Commonwealth soldiers . Suddenly, Mercer yells for everyone to put their weapons down as he, Pamela , Carol , and Negan arrive at the scene and defuse the situation. Brooks is later seen among the other soldiers at the wrestling ring during Founders Day. Brooks is seen walking around at the Commonwealth Police Department. Brooks stands next to Mercer during Eugene's trial. Trooper Brooks performs a door-to-door search for Eugene Porter , eventually reaching the apartment that Eugene is hiding in. Eugene allows Brooks in, but he hides behind the open door and ambushes the trooper. Tackling Brooks to the floor, Eugene removes his helmet and bashes Brooks' head in with a flashlight, killing him. As Eugene looks at Brooks' corpse, a man calls over his radio asking where Brooks is. Taking Brooks' gun , Eugene flees the apartment.",
        "Death[]": "Killed By Eugene Porter Performing a door-to-door search for Eugene, Brooks enters the apartment where Eugene is hiding. In a struggle, Eugene removes Brooks' helmet and bashes his head in with a flashlight.",
        "Killed Victims[]": "This list shows the victims Brooks has killed: Possibly numerous counts of zombies and unnamed people",
        "Appearances[]": "\" Lockdown \" (No Lines) \" A New Deal \" (No Lines) \" Variant \" (No Lines) \" Faith \" (No Lines) \" Family \"",
        "Trivia[]": "Despite having speaking lines in \" Family \", Brooks remains uncredited. Brooks is Eugene 's first and only named direct kill. Brooks is the final antagonistic Commonwealth soldier to be killed. John Prozny also portrayed Jenson , Sorensen , and a recurring Alexandria resident in Seasons 10 and 11."
    }
]