[
    {
        "Caesar Martinez": "Caesar Martinez",
        "Overview[]": "Martinez has been shown to have a particular hatred of walkers, frequently spearheading missions related to hunting and trapping them. This is revealed to be a grudge for personal losses suffered at the hands of the dead. Up until the end of Season 3, he was fiercely loyal to the Governor and followed his orders without hesitation. As of Season 4, he has gone from pawn to player, first by abandoning his former leader and then by taking leadership of his own survivor camp. As of welcoming the Governor back into his group months later, Martinez has taken on a more dominant personality, making his authority clear to his erstwhile commander and stating he will not tolerate dead weight. Despite his seeming brutality he also shows very human and sympathetic characteristics, showing remorse for having killed the National Guard soldiers and framing Merle Dixon , saving a little girl when Rick's group attacked Woodbury, conversing with Merle's brother Daryl , and being personable with all he considered comrades. In the end, he attempted to reconnect with The Governor, only to be betrayed for his lack of confidence at surviving the apocalypse and the issue of leadership.",
        "Pre-Apocalypse[]": "Little is known about Martinez's life prior to or as the outbreak began, except that his father was a Catholic priest. Martinez was married at one point and eventually had kids with his wife. He also worked as a coach.",
        "Post-Apocalypse[]": "At some point following the outbreak, Martinez's entire family was killed, giving him a deep hatred of the walkers. He eventually arrived at the fortified town of Woodbury and joined the group of survivors living there. He became a trusted lieutenant to the Governor and assisted him in attacking survivor camps and settlements and killing innocent survivors in order to obtain valuable resources and weapons. These atrocities were kept secret from the other Woodbury survivors. Martinez arrives at the helicopter crash scene with the Governor , Merle Dixon , Tim , Shumpert , and Crowley . They pulled up in trucks and Martinez exited the vehicle with a baseball bat in his hands. While searching around the wreck, Martinez kills a few walkers. Eventually, when Merle discovers Andrea Harrison and Michonne Hawthorne , they return to Woodbury . Martinez is not seen again until Lieutenant Welles mentions where his military allies are. The Governor, Merle, Tim, Shumpert, and Crowley head to that location and kill the surviving guardsmen. Following this, Tim, Shumpert, and Crowley are seen standing behind the Governor. They then return to Woodbury with the military vehicles, extra weapons, and supplies. Martinez is in a truck with the Governor's adviser Milton Mamet , Tim, and Merle. They are searching for zombies to take back to Woodbury as part of the arena fighting event. After returning to Woodbury, Michonne requests to leave and Merle allows her. Martinez is seen standing on top of the wall, holding a gun. Once night falls, Martinez and Merle battle in the arena, surrounded by zombies, as Andrea watches in disgust and The Governor, in happiness. Merle pins him to the ground and wins the arena fight, although The Governor admitted it was all staged. Martinez debates with the Governor and Merle about what to do with Glenn Rhee and Maggie Greene . He later threatens Glenn while Glenn, Maggie, and the Governor are talking. Martinez is present at the meeting in Milton's laboratory before the firefight between the Woodbury guards and Rick Grimes 's group. He participates in the firefight between the Woodbury army and Rick's group. He is more intricate in the recapture of Glenn and Maggie, along with Merle and others. Their attempt is interrupted, however, when Rick bombards the group with smoke grenades and rescues their comrades right under their noses. From here, Martinez follows Merle and the others into the streets for the assault. When Merle is branded a traitor by the Governor, Martinez holds a gun to Merle's back but lowers his head in shame, showing that he knows Merle isn't a traitor, but he remains quiet about it. Martinez restrains Andrea from the Governor whilst the Woodbury residents demand Daryl and Merle Dixon 's death. Shortly after the surprise ambush and escape of the Dixons, he hurriedly races towards a frightened young girl, shooting a walker about to bite her arm and bringing her to safety. Later, he is seen trying to control the despair of Woodbury citizens as they demand to open the gates so they can take a chance outside. In the middle of all the screaming and car horns, Martinez points his gun at one driver and forces him out of the car, as Andrea orders him to stop being rude, which he answers by affirming he doesn't take orders from her. As walkers breach the town, he and Andrea manage to kill them and then attempt to calm the townspeople. When the Governor attacks the prison, Rick's base, Martinez is armed with an FN FAL assault rifle and is hiding in the foliage. He fires towards Rick's location keeping him pinned down, but manages to miss every shot. After his gunfight with Rick, he retreats into the bushes. Martinez is put in charge of recruiting the townspeople of Woodbury to an army by the Governor, who wants to arm each and every person in the town to avoid any more invasions. He argues with Karen regarding Noah, an asthmatic teen, when Andrea eventually steps in and diffuses the situation. Near the end, he is seen armed with a gun at the gate and seems to be surprised to see Andrea stepping out of the car they have stopped. Martinez is brought along to the meeting between Rick and The Governor, together with Milton and Andrea. While waiting, walkers approach, and he and Daryl then move in to kill them, both having a competition of-sorts while slaying the walkers. Later on, they have a conversation about past events, where Martinez states that he hates the walkers, after what they did to his wife and kids, revealing that he lost his family to the apocalypse. When the meeting ends, Martinez leaves along with The Governor, Milton and a reluctant Andrea. Martinez is packing the truck full of guns. Andrea asks why, to which Milton replies, \"It's a show of force.\". Martinez spots Andrea on her way out to escape, and asks her for her piece and ammo because the Governor wants them all collected up. Martinez collects Shumpert, Tyreese Williams , Tyreese's sister Sasha , Allen , and Ben to go to the biter pits. Tyreese and Sasha are shocked when they first see the biter pits, and question Martinez as to why they would feed living people to them. Martinez asks why Tyreese should care, to which he replies \"This is sick.\" Martinez threatens Tyreese when he decides to not help with the pits. Martinez and Shumpert watch as Tyreese and Allen get into a physical alteration. Martinez orders Shumpert to take Tyreese and his group back to Woodbury. Martinez greets the Governor on his way back from chasing Andrea. He informs him that the biter pits have been torched. The Governor asks Martinez to go out and collect some more biters. When Merle drives a car to the Governor's meeting place with loud music, Martinez is one of the first to hear it. He orders the other soldiers to check it out and they do. When Merle is inside a shack and a zombie attacks him, he falls through a door and is brutally kicked by Martinez and a few others. Merle is killed shortly after and Martinez survived the ambush, returning to Woodbury with the Governor, Shumpert, Allen, and a few others. Martinez is one of the soldiers involved with the assault on the prison. As the Woodbury convoy approaches the prison, he destroys two of the prison guard towers with a grenade launcher . He is forced to flee the prison with the rest of the soldiers after they are overwhelmed by walkers, smoke grenades, and the prison alarm being activated. He is one of the last people to escape the prison, along with the Governor and Shumpert. Their truck speeds up to the front of the convoy and cuts off the leading car, to stop the Woodbury soldiers from fleeing any further. He and the Governor yell at the soldiers, but he is horrified as the Governor opens fire on the crowd, killing everyone. He backs away in terror as his friends are gunned down, but willingly gets back in the truck when the Governor orders him to. He, the Governor, and Shumpert drive off into the unknown. Martinez, Shumpert, and the Governor return to the abandoned National Guard camp after the Governor's assault on his people. When a walker is about to kill the Governor, he doesn't do anything to save himself. The walker almost bites him, until Martinez steps up and shoots the walker in the head. He then looks at the Governor angrily, and walks away. The next morning, he and Shumpert take the truck and abandon the Governor without warning. Months later, Martinez finds the Governor and Meghan Chambler in the screamer pits, after they fall in. After saving the Governor and Meghan from the pit, he takes them all to his camp and says they can stay, provided the Governor does not try anything. Later, Martinez starts to hang out with Meghan's mother Lilly Chambler , her sister Tara , Philip, and Meghan - sharing stories over lunch and beer. He later takes the Governor golfing on top of the RV to prove there are no hard feelings between the two of them. Martinez gets drunk and mentions that maybe they can \"share the crown\" and run the camp together. In response, the Governor exclaims \"I don't want it!\" and hits Martinez in the head with a club. He then drags him over to the walker pit and lowers him in where he is slowly devoured by walkers. The group later discovers Martinez's remains in the pit and assumes that he got drunk while playing golf and accidentally fell in.",
        "Death[]": "Killed By Philip Blake (Caused) Zombies When golfing on top of the trailer to hit walkers in the heads, Martinez offers the Governor a partner-based leadership position. The Governor, enraged by this, mercilessly hits Martinez in the head with a golf club, kicks him off the trailer and drags him to the pit of walkers, screaming, \"I don't want it, dammit!\". He then holds Martinez over the pit low enough for the walkers to bite into his head and then drag him in to devour him. It is unknown if there was anything left of him to reanimate.",
        "Killed Victims[]": "This list shows the victims Martinez has killed: Wilson (Alongside his fellow survivors) Welles (Alive, Possibly, Direct or Caused) Merle Dixon (Caused) Shumpert (Before Reanimation) 5 unnamed U.S. Military soldiers (Alongside his fellow survivors) Numerous counts of zombies and possibly unnamed people",
        "Appearances[]": "",
        "Trivia[]": "The casting call for this character used the name Manuel . Martinez was described as \"30s to 40s. Hispanic. A working-class survivor, he is confident, physically skilled, a leader when necessary, capable and smart. Has a terrific sense of humor where you wouldn't expect one.\" In \"Arrow On the Doorpost\", Martinez mentions that he \"prefers Menthols\" when Daryl offers him a cigarette from a dead zombie's pocket. He was the last person to die in the trio that witnessed and survived the Governor's murder of the Woodbury citizens after the prison attack, the others being Karen and Shumpert, who former of whom would die around the time of Martinez's death and the latter would die much before. Martinez is one of seven non-main characters to cause the death of a main character by their own hand, the others being Lilly Chambler , Dawn Lerner an unnamed Whisperer , Dante , Bossie , and Montanio .",
        "References[]": "",
        "Name": "Caesar Martinez"
    }
]