[
    {
        "Dr. Candace Jenner": "",
        "Fate": "",
        "Contents": "",
        "Pre-Apocalypse[]": "Candace was born in 1976. She worked alongside her husband Edwin Jenner and the computer-AI Vi at the Center for Disease Control in Atlanta. She was described by her husband as being an exceptional genius and leading mind in their field, to whom his own skills as a scientist could not match.",
        "Post-Apocalypse[]": "During the onset of the outbreak, Candace, along with her husband and colleagues in the CDC attempted to find a cure to reverse the outbreak, however, the situation only worsened despite their efforts and many of her colleagues either fled the CDC to be with their families or committed suicide. At some point, Candace was bitten and infected and resigned to her fate, decided to donate her failing body to be studied in the hopes of developing a cure. Before her death, Candace begged her husband to keep trying to find a cure for as long as he could and Jenner reluctantly agreed at his wife's request. Candace then died and Jenner put her down. He recorded her death and reanimation time, timing it exactly as two hours, one minute, seven seconds.",
        "Death[]": "Killed By Zombies (Alive) Candace was bitten by a walker and resigned to her fate, told her husband that she would donate her failing body to him in an effort to find a cure. Candace eventually succumbed to the infection and died. Edwin Jenner (Zombified) Two hours after her death, she reanimated and once it was clear that her brain couldn't provide any more useful information in an active state, Edwin shot her in the head. He used her body to gain brain tissue samples to aid in the development of a cure.",
        "Killed Victims[]": "This list shows the victims Candace has killed: Possibly numerous counts of zombies",
        "Relationships[]": "Center for Disease Control Edwin Jenner † - Husband Vi †",
        "Appearances[]": "",
        "Trivia[]": "Candace appears in \"TS-19\" as an archived MRI footage and in a photograph on Edwin Jenner's desk. However, she, like Private Gaines , actually appears in a deleted scene for the episode of \" TS-19 \". Candace is the only character in the TV Series whose fate is shown on a tape. She is one of three characters in which it is known how long it took for them to turn, in her case 2 hours, 1 minute, 7 seconds. The other known characters are Tobin at 1 hour and 13 minutes, and Barca at 7 hours and 48 minutes. Originally, Candace was meant to appear in the \" Pilot \" of Fear the Walking Dead , but her scene was cut. [1] In World Beyond , Candice is mentioned in the mid-credit scene of \" The Last Light \" by her husband .",
        "References[]": ""
    }
]