[
    {
        "Overview": "During the first season, Carl is portrayed as a shy and reserved boy, only striking up a conversation with his parents and members of the group with whom he feels comfortable, such as Shane Walsh , Dale Horvath , and Sophia Peletier . Carl, being relatively young, is shown to often be frightened by the horrors of the world, thus looking to his parents for shelter and comfort. Carl is a kind boy who tries his best to comfort those closest to him when he recognizes that they are in need. In the second season, Carl retains his shyness, but he develops a bolder personality and is seen to be less frightened of the world in response to the many ordeals he has experienced. He attempts to take on a more active role, wanting to help out the group, rather than be known as a liability; he finds the arsenal of knives for the group, and he helps with the search for Sophia. Like most children at his age, he is sometimes disobedient, but he shows shame and guilt when his actions negatively impact the group. After accidentally being shot by Otis , Carl is stricken with negative thoughts. He develops the desire to fend for himself and also to prove his independence and maturity. This is especially prevalent when he accompanies the adults in gun training. After his friend Sophia is found zombified in the barn, he begins to form a noticeably colder personality, mentioning that he would have put Sophia down himself. In addition, he follows his father into the barn to watch him execute Randall , and he even eggs Rick on to do the act. Carl is occasionally pessimistic and rude. He also insults Carol for speaking of heaven. Despite this, he is not above apologizing and realizes that some of his words and actions are unacceptable. After Carl indirectly causes the death of Dale Horvath , he is overcome with immense guilt, thinking himself a failure and vowing never to touch a gun again; his growing boldness was an attempt to prove himself worthy of standing alongside the adults of he group. It is not until his father talks to him privately in the barn that his confidence is restored, and Dale's death becomes a lesson. After putting down Shane, Carl finally notices that he will have to mature in order to survive in the new world. By the third season, Carl has become battle-hardened from months on the road. His firearm skills have greatly improved, as well as his tactical abilities. He is no longer shy around most of the group, which is assumed to be a result of spending months with them out on the open road. Despite Carl's increase in capability, he does not appear to be completely immune to emotion, and he retains some of his child-like qualities, such as cracking a joke every now and then, as well as developing a child-like crush on Beth Greene . However, after witnessing Lori's death, delivering his baby sister, and taking it upon himself to put his mother down, his despondent attitude amplifies. Carl goes through a stage of depression, neglecting to speak much unless he feels that it is necessary. He even tells his father to temporarily step down from his leadership position. Despite the traumatic impact that his mother's death has on him, it hardens him immensely. He becomes very brave, frequently helping people and risking his own life to save others; he saves Michonne outside the gates and his father from a hostile Morgan Jones , despite his father's pleading to stay back. Throughout the course of the season, Carl begins to unwind as a result of the brutality of the world with the Governor at the center. Thinking he doing what is necessary to protect the group, Carl mercilessly kills a young boy as the boy was surrendering, which makes known how ruthless he has turned. Rick, frightened of what he has allowed his son to become due to being a relatively inactive parent, spends more time with Carl. He encourages him to pursue other endeavors, such as farming. By the fourth season, Carl has become much more relaxed and accepts the fact that there is more to life than survival. Rick has taken his parental role more seriously and is stricter towards Carl. Although he still yearns for more excitement and is concerned with the possibility of the Governor's survival, Carl understands what his father is trying to do for him and tries to honor his father's wishes by attempting to be a kid again. Of course, he finds this difficult because of the many tragedies he has encountered and all the morbid things he has done. Despite his now more nonchalant personality, he still retains his more serious and realistic viewpoint on the world, such as chastising Lizzie Samuels and the other children for naming the walkers and for falsely believing that they are not so different from the living. Carl's maturity and his worthiness ultimately earn him his gun back, which he accepts honorably. Rick is confident in Carl's ability to use the weapon decisively. Despite Carl being young, he is not hesitant to call out his seniors when he believes that they are doing something illogical. Perhaps the most notable instance is when he tells Hershel Greene that he is not going to allow him to go into the woods alone, and also when he informs Rick that Carol Peletier should be permitted to teach the children of the group how to defend themselves. Throughout the course of the first half of the season, Carl gradually becomes more integrated into the defense of the prison , even fighting beside his father to stop a large horde of walkers, which Carl recognizes was a tough thing for Rick to allow. By the time of the prison's fall, Carl is severely shook up, most probably due to the loss of the prison, the decapitation of Hershel, and the presumed death of Judith. During the second half of the fourth season, Carl struggles to come to terms with what has happened. Scarred from the battle and subsequent loss of the prison, he is recurrently seen to have outbursts of intense anger and frustration, sometimes resembling meltdowns. Driven by a need to pin his anger on something, he directs his rage toward his injured father. Upon Michonne's return, they accept the fact that Carl is becoming an adult in the new world. At the end of the season, Carl reveals to Michonne that he has dark thoughts in his head that he fears would jeopardize his relationship with his father. he believes that he isn't what Rick thinks he is, and that he is a monster. In the fifth season, Carl's mental state improves significantly. After the escape from Terminus , he begins taking on an adult role in the group. Carl helps with the fortification and defense of the church, as well as taking responsibility for protecting baby Judith. He seems to have cooled down a bit in terms of his emotional and mental stability, as evidenced by his ability to laugh and smile but is still capable of fearlessness and even a degree of coldness. He shows his fearless disposition when confronted with Gareth and the other surviving cannibals, and tries to teach Father Gabriel Stokes how to use a weapon. This attitude makes him potentially dangerous, as he is able to do what is necessary to survive. However, he seems to remain in control of his emotional state. He also appears as though to have grown more optimistic in the events following the fall of the prison and escape from Terminus; he immediately implores the group, particularly his father, to save Gabriel when he hears his desperate cries for help and expresses his belief that not everyone in the world can be bad, even when Rick is warning him that he is never safe. After the events at Grady Memorial Hospital , Carl interacts with members of the group with maturity and kindness on the road, including giving a grieving Maggie a gift. The group finds it difficult to survive in the wilderness, and Rick becomes concerned about how Carl is coping, but Glenn assures him that Carl bounces back quicker than any of them. Rick says that kids like Carl are lucky because they can adapt to and inherit the new world. After entering Alexandria , Carl, again, grows fairly sullen, worried that the community will make him weak and dulled to survival. Although he likes the people and enjoys living in large houses, he finds dealing with the other adolescents in the community rather complicated, though he eventually decides that he ought to make friends rather than live in isolation with his outsider group. He becomes fascinated with a withdrawn teenage girl called Enid , who also came in from the outside, and with whom he forms a bond. In the sixth season, Carl continues to mature. He offers Gabriel lessons on how to use weapons and gives him advice on how to reintegrate after his betrayal of the group. Carl did this when few others would have anything to do with Gabriel. Carl often cares for Judith and even helps Enid during the Wolves ' attack. He also attempts to help Ron Anderson , another teen of the community, learn how to adapt, but Ron refuses, revealing his hostility toward Carl due to Rick's execution of Pete , his father. In return, Carl becomes more adverse and somewhat insensible toward Ron. During the herd attack on Alexandria, Ron pulls a gun on Carl, telling him that there is no hope and that everyone is already dead. Carl, displaying his now optimistic and more mature state of mind, disagrees and ensures Ron that there is still hope. Covered in walker guts, the group steps outside into the herd, and Carl hides Judith underneath his cut-up bed sheet and looks on through the herd, exhibiting his sophistication and bravery. After Carl gets shot through the eye by Ron and spends the next two months rehabilitating from the incident, Carl seemingly appears to remain normal, showing his usual smile to his loved ones, but it becomes increasingly clear that this is a crudely put up façade at best and that Carl is absolutely not okay. He presents a noticeably rougher edge when his loved ones aren't around such as when he's with Enid, and this rough edge has been noticed by his father. He tends to try and avoid conversation with people he'd usually be happy to talk to such as with Michonne and he's shown to be rather depressed, even when he's babysitting Judith, something he'd usually be a lot more upbeat about. A comment Carl makes to his father could even hint that he's feeling self-conscious about his own appearance which is reinforced by Rick's taken-aback reaction of hurt. More important and worrying though is that Carl appears to be developing a taste for bloodshed. While initially unnoticeable, he shows some worrying traits when he interacts with threats for the first time since suffering his eye injury. Enid suggests that the reason Carl is joining the journey to the Hilltop Colony with an ailing Maggie is because he wants to run into the Saviors to make them suffer, and the reaction Carl gives is all she needed to confirm this suspicion. This is quite different from S3 where, even though he was walking down a darker path he was still only killing because he thought he had to, not because he wanted to. Even Rick has noticed this and seems quite worried about his son's new attitude. Unlike his father and the majority of the group, Carl was completely unshaken by the Saviors' attempts to antagonize him, zoning out in a trance a couple of times, and glaring wordlessly at Negan when face to face, impressing Negan who refers to Carl as a future serial killer. This and Enid's comments suggest that Carl could be developing a more sadistic side. However, when he was alone with Negan in Negan's room in the Sanctuary, and after being forced to take off his bandage and show his exposed eye socket, Carl was shown to be visibly afraid when forced to sing while Negan swung Lucille around. This shows how self-conscious Carl has become about his appearance, as well as the fact that he is actually afraid of Negan and the Saviors. After noticing this, Negan expresses genuine remorse for his treatment of Carl. During the preparation for the war against Negan and the Saviors, Carl continued to show his more mature side, no longer going against his father's wishes. He showed his bravery, and willing to fight, when he was the first one to fight the Scavengers when they held Alexandria at gunpoint and were distracted by Negan being attacked. Carl was even put in charge of safeguarding Alexandria while the Militia wages war with the Saviors, despite the presence of natural-born leaders such as Michonne and Rosita, a responsibility he took extremely seriously and achieved when he orchestrated Alexandria's evacuation during the Savior's bombardment on the community. While everyone else during the war focuses on the present battles and bloodshed, Carl develops a more progressive way of thinking when contemplating the aftermath of the war and the future. After his death, Carl continues to have a lasting impact upon those who knew him. His dreams of a better future have an enormous impact on Rick who works to make them come true after the defeat of the Saviors. Carl's words also cause Rick to spare Negan and make peace with the defeated Saviors, recalling Carl's constant reminders to Rick that they will have to live with their former enemies once the war is over. Negan, who genuinely cared for the boy, is devastated by his loss as well and over the years of his imprisonment in Alexandria, shares stories with Judith about her brother, forming a close bond with the young girl. Judith ends up adopting Carl's signature hat as a part of her own look which had been passed on to Judith just before Carl's death. Following in Carl's footsteps, Judith eventually passes the hat on to their little brother R.J.",
        "Pre-Apocalypse": "Carl was born in 1998 and grew up in King County, where he experienced an average childhood raised by his father, Rick Grimes (a sheriff deputy) alongside his mother Lori (a housewife). The three lived together as a typical family in a single-story house in King County, Georgia. He also befriended his father's closest friend, Shane Walsh . [2] When Carl was 3 years old, Rick took him on a walk to Ross' farm, where Carl became grateful for the safety and happiness his father provided him. When Carl was in the third grade, he had a best friend whom was allergic to dairy products and thus brought in soy-based meals for lunchtime; one day Carl tasted his friend's milk and almost vomited (which became a humorous memory for him). [3] As he grew, he developed a keen interest in playing video games and reading comic books. [4] [5] Over time however, his parents' marriage became increasingly strained due to their marital issues and Carl was often in the presence of his parents quarrels, where one day, Carl witnessed Lori questioning if Rick truly cared about his family, an incident which affected Carl to a degree. [2]",
        "Post-Apocalypse": "",
        "Death": "Killed By Zombies (Caused) Siddiq (Indirectly Caused) Himself (Indirectly Caused; Suicide) While bringing Siddiq to Alexandria, Carl and Siddiq fight a pack of walkers. In the scuffle, Siddiq knocks into Carl by accident, resulting in him tripping and being bitten on the abdomen by a walker. He initially conceals the bite until the Saviors' attack on Alexandria, where he reveals it to the others while hiding in the sewers. Ultimately, as he approaches death, Carl chooses to commit suicide rather than forcing Rick or Michonne to put him down before reanimation. Later, as Rick and Michonne are outside the church, Carl shoots himself in the head.",
        "Killed Victims": "This list shows the victims Carl has killed: Dale Horvath (Indirectly Caused) Shane Walsh (Zombified) Jimmy (Indirectly Caused) Patricia (Indirectly Caused) Lori Grimes (Before Reanimation) Jody Joe Sr. (Zombified) Red Jacket Wolf George Chris Himself (Indirectly Caused; Suicide) Many unnamed West Georgia Correctional Facility prisoners (Zombified) At least 2 unnamed Scavengers Numerous counts of zombies",
        "Relationships": "For a more in-depth look at Carl's relationships, read here; Carl Grimes (TV Series)/Relationships",
        "Appearances": "",
        "Gallery": "For more images of Carl Grimes, please visit Carl Grimes (TV Series)/Gallery .",
        "Trivia": "Carl is the second longest-running dead character in the series , with the first being Rosita Espinosa . Carl held the longest lifespan of any child in the series prior to his death in the episode \" Honor \", lasting 108 episodes for seven and a half seasons. Carl shares his name with Robert Kirkman 's father. Carl is Robert Kirkman's favorite character in the show. [6] Rick and Carl share the same blood type, which is A+. [7] In the first three seasons, Carl usually wore a Science Dog T-shirt, a character from Robert Kirkman's other comic series, Invincible . Carl's most used weapon was a firearm called Beretta 92FS , but has used other pistols throughout the series. Like his father, Carl appears to be an atheist. He was initially shown to be somewhat of a believer as his mother tells him to say his prayers in \" TS-19 \", however by \" What Lies Ahead \" he shows signs of no longer being a believer as he says nothing while in the church and by \" Judge, Jury, Executioner \" he expresses his atheism by insulting Carol for believing Sophia is in heaven and called her an idiot. By the episode \" Claimed \" however he appears to be more agnostic as seen when he expresses hope that maybe his sister Judith (whom at the time he believes dead) and Michonne's deceased son, Andre are together somewhere, presumably an afterlife. During the season four premiere , when Michonne gives Carl comics as a gift, the comic at the top is Issue #56 from Invincible - Robert Kirkman's other comic book series. Glen Mazzara has stated that he considered killing Carl instead of Axel during the Governor 's attack in the episode \" Home \". The first two times Carl has been shot, it has been by accident. Everyone who has shot Carl has died due to walkers . Otis , Ron Anderson , and himself. Carl's first known kiss was with Enid . Both in the comics and in the TV series, Carl is the first minor to be shown driving a vehicle. Carl has never appeared in the 14th episode of a season. Carl is one of six characters in the The Walking Dead universe to receive a permanent eye injury, the other four being his comic series counterpart , Philip Blake (along with his own comic series counterpart ), Kenny and Violet (Determinant) from The Telltale Series . Ever since he lost his right-eye, Carl's been trying to aim with his left-hand despite being right-handed. It is revealed in the episode \"Honor\" that the flash-forward sequences seen in this episode and the season premiere \" Mercy \" were fantasies thought up by Carl for a brighter future after the war. These fantasies reveal that he sees peace among all communities and that he even views Negan as redeemable. Carl is the third main character to die in a mid-season premiere, the first being Tyreese Williams , the second being Jessie Anderson , and the fourth being Alden . Carl is the third main character to commit suicide, the first being Andrea Harrison and the second being Sasha Williams . He is the second main character to commit suicide to prevent reanimation after being bitten, with Andrea being the first one to do so. He is the first male main character to commit suicide. Carl's last words were \"I love you, Dad\". Following Carl's death, Rick, Carol Peletier , and Daryl Dixon are now the only remaining Atlanta Camp survivors that are still alive. This also makes them and Morgan Jones the only remaining characters introduced in Season 1 who are still currently living on the show. Carl is the fifth main character to predecease his comic counterpart, with the first being Sophia Peletier , the second Dale Horvath , the third being Lori Grimes , the fourth being Andrea Harrison , the sixth being Jesus , the seventh being Siddiq , the eighth being Beta , the ninth being Sebastian Milton , and the tenth being Lance Hornsby . Carl is the second character to die, who does not die in the comics, with the first being Sophia Peletier , the third being Jesus , the fourth being Siddiq , the fifth being Sebastian Milton , and the sixth being Lance Hornsby . Carl is the ninth most-appearing character on the TV Series, having appeared in 83 episodes. Carl is the sixth main character to be bitten by a walker, the first being Hershel Greene , the second being Andrea Harrison , the third being Bob Stookey , the fourth being Tyreese Williams , the fifth being Deanna Monroe , and the seventh being Rosita Espinosa . Carl is the fourth main character to die by being shot in the head, with the first being Dale Horvath , the second being Andrea Harrison , the third being The Governor , the fourth being Beth Greene , and the sixth being Leah Shaw . Carl is the first character whose death was caused by Siddiq , albeit indirectly and accidentally. Carl appears in the archival footage shown at the beginning of \" Lockdown \", \" A New Deal \" and \" Outpost 22 \" as Judith narrates past events of the show to the audience before the episode's story begins. Carl appears in the final flashbacks of the last episode, \" Rest in Peace \". Chandler Riggs, the actor who portrays Carl, also portrays a Hilltop Extra, who can be seen in the background near the end of the episode \" Rest in Peace \".",
        "References": "",
        "Name": "Carl Grimes"
    }
]