[
    {
        "Pre-Apocalypse[]": "Nothing is known about Carm's life prior to or as the outbreak began. It is possible that he was a helicopter pilot.",
        "Post-Apocalypse[]": "At some point, Carm became a lieutenant colonel of a large organization known as Civic Republic Military . While scouting in Virginia , Carm somehow came in contact with Anne and the Scavengers and made a deal with them, in which the Scavengers would trade captured survivors to the CRM in exchange for supplies. When Anne contacts Carm through a long-range walkie-talkie, he asks her if she has \" an A or a B \". Anne wants to be rescued, as she already gave them plenty of survivors, but Carm claims that she had been compensated. When Anne asks what it will take, Carm replies \"an A\". As Anne's van breaks down on the road and Carm radios her to see if she has the \"A,\" Anne lies and confirms she does, saying they're ready for transport. He warns her that if she's tricking them, there will be consequences, however she insisted she wasn't. Anne tells him that she wouldn't ask for evacuation if she wasn't desperate and that she has to get out of there. Abandoning her vehicle, she continues on to the meeting spot on foot. Later, at the meeting spot, the helicopter arrives to pick up Anne and her supposed \"A,\" and she pulls out her gun but suddenly spots a wounded Rick Grimes on the riverbank, still alive after having blown up a bridge he was on. She quickly radios that she never had an \"A\", but has a \"B\" who's strong and needs help immediately. She promises it's not a trick and explains she's just trying to save a friend who once saved her. They agree to her deal and Carm lowers the helicopter. Inside the helicopter, Anne assures Rick that he'll be fine and that \"they\" will save him. Rick falls asleep as Carm flies the helicopter away towards the Civic Republic of Philadelphia.",
        "Killed Victims[]": "This list shows the victims Carm has killed: Possibly numerous counts of zombies and unnamed people",
        "Appearances[]": "\" Warning Signs \" (Voice Only) \" What Comes After \"",
        "Trivia[]": "This character's name was revealed in the dossier Anne wrote for the CRM to find and was visible as Michonne read the letter in \" The Last Time \" in The Walking Dead: The Ones Who Live . With his name revealed, Carm is the only named character from the CRM to appear in the TV Series . Kevin Knotts also portrayed Isabelle in \" The Beginning \" in Fear the Walking Dead due to the actress being unavailable for filming at the time, which explains why her face remained completely covered while she was on-screen.",
        "Name": "Carm Elsick"
    }
]