[
    {
        "Cheryl": "",
        "Overview[]": "Cheryl is a friendly, snarky, humble, and wise old woman. Cheryl falls ill due to Alexandria 's water being poisoned and has to be taken care of by the doctors, Siddiq and Dante , whom she forms a friendship with, particularly with Siddiq. Her interactions with them are civil and humorous, with them engaging in playful banter, such as Dante joking they'd make a great couple together, only for Cheryl to answer that she'd break him like a twig. Cheryl's condition does not improve and it becomes apparent that she most likely won't survive. She becomes aware of this, and rather than being afraid or disheartened, is grateful that she gets to spend her last moments in a comfy bed. Even when on her deathbed, Cheryl uses her last moments to encourage Siddiq to remain strong for the others. Later, Cheryl dies, presumably from her illness, much to Siddiq's sadness. However, in actuality, Dante had killed Cheryl by asphyxiating her. Her grave would later be used by Beta to invade Alexandria.",
        "Pre-Apocalypse[]": "Nothing is known about Cheryl's life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "At some point in the apocalypse, Cheryl joined a community called the Alexandria Safe Zone . Cheryl is among the Alexandrians being examined by Dante after falling sick to a mysterious illness. Dante reassures Cheryl that she will be okay and jokes that they would make a great couple together. Later that day, Cheryl is among the residents admitted to the infirmary as her condition has not improved. Siddiq sits by her bedside and reassures her that she will be okay. She tells him that she is grateful to be lying in a comfortable bed, which is a modern luxury in the present world. Cheryl is eventually moved to a separate room with her own bed and more space. She beckons Siddiq over and they chat about how he needs to remain strong for the others. Later that day, Cheryl seemingly succumbs to the sickness when Siddiq finds her room empty. He finds her body wrapped in a blanket at the graveyard while Dante digs her grave. Learning of this, Siddiq becomes further depressed over her death. In a flashback, it's revealed that Cheryl was asphyxiated with a pillow by Dante. She tries to reach up and stop him, but she is unable to.",
        "Death[]": "Killed By Mary (Indirectly Caused) As a result of Mary poisoning Alexandria's water supply with walker remains, Cheryl contracts cholera and becomes ill, leaving her bedridden. Dante Ultimately, Dante decides to asphyxiate her with her own pillow and then puts her down to prevent her reanimation.",
        "Appearances[]": "",
        "Trivia[]": "In \" Stalker \", it is revealed that Cheryl's grave was actually used as a cover for a tunnel that the Whisperers dug underneath Alexandria's walls. Since Dante was the one that buried Cheryl, it is unclear if her body is actually in the grave or was buried in another location."
    }
]