[
    {
        "Overview[]": "Clara appears to be an affable but delusional, depressed, desperate, and cynical woman. After the death of her husband Eddie , she couldn't move on from his death and kept his decapitated head as a walker. She continued to feed the walker Eddie seemingly in denial of his death. Despite her delusion, she still appears to be relatively good-natured, as she is polite and civil with Rick . However, it's revealed Clara lured Rick to her camp as food for Eddie and tries to kill him. Despite this, she shows immediate remorse for this action. She expresses the belief that people cannot come back from the horrible things they have done. She requests to be left to turn into a walker so she can join Eddie, which Rick obliges. Clara shows what the apocalypse has done to some people and how far humanity has fallen.",
        "Pre-Apocalypse[]": "Not much is known about Clara's early life, except she was from Ireland, and was newly married to her husband Eddie . Sometime before or during the early stages of the global outbreak, Clara was at the Atlanta airport terminal with her husband waiting for a connecting flight for their honeymoon to Puerto Vallarta when their flight was cancelled. They were held in the terminal until the zombies most likely broke in.",
        "Post-Apocalypse[]": "Clara and her husband made it out of Atlanta, surviving both Operation Cobalt and the horde of walkers. The two made their way out to the countryside and lived in a small camp near the prison . Rick Grimes was out in the woods beyond the fences of his base at the West Georgia Correctional Facility , checking snares for animals, and comes across a deer cadaver that had been partially eaten by walkers , and then found a dying boar on the forest floor. Before he could inspect the boar, a \"walker\" stumbles into view and kneels at the boar's side. Wanting to avoid contact, Rick turned to leave, but was forced to turn around when something caught his ear. The \"walker\" spoke. It was a living woman: Clara. She asked Rick to help her carry the boar back to her campsite, in order to nourish herself and her husband, Eddie (both of whom were apparently starving). A leery Rick (noticing Clara's emaciated state) decided to help her out by giving her a tinfoil-wrapped sandwich. When she asked if she can join his shelter, Rick says that he needed to gain the approval of her husband (who, apparently, was back at her own shelter) and to ask them three questions. He asked if she has a weapon, and patted her down to find only a small knife, which he takes. Before handing it back to her, he warned her that if she tried anything, she would be the one to lose, to which she replied that she didn't have anything to lose. As they walked deeper into the forest, she expressed her feelings about her husband, claiming that he sacrificed everything for her. She then explained the horrible things that they had to do, such as eating whatever food they could find, such as animal carcasses, rotten food, leaving people behind, and hiding from people needing their help. She then asked if Rick had to do the things that they did, and if he thought he could come back from them, to which he replied \"I hope so.\" As they reach her camp , Rick inspected their tent as Clara walked to her husband, telling him that a man is here to help. She then lunged at Rick, knife in hand, only to be sidestepped by the latter, thrown to the ground, and then held at gunpoint. She explains that she wanted to take the boar, but returning with Rick would be faster. She wanted to feed Rick to her undead husband, because the latter was \"starving, slowing, and needs something alive\". She then explained that she kept him because she couldn't live without him, while admitting that it was wrong and that she couldn't do things like this, possibly indicating that Rick isn't the first such \"meal\". She plead Rick not to \"end it after\", before driving the knife into her own gut, wanting to turn into a walker and be with her undead husband. While on the verge of death, she asked Rick what the questions were that he was going to ask: Q1: \"How many walkers have you killed.\" Answer: \"Eddie killed them all, until...\" Q2: \"How many people have you killed?\" Answer: \"Just me. Just me.\" Q3: \"Why?\" Answer: \"You don't get to come back from things.\" Clara died shortly thereafter. Rick, upset that another human being has perished, respected her wish to become a walker and didn't destroy her brain. Rick headed back to the prison, and Eddie's zombified head could be seen under a cloth. A zombified Clara is amongst the other walkers streaming into the breached, destroyed prison. Clara is amongst the other walkers overrunning the destroyed prison, moments before Michonne started killing a few walkers that approached her. When Glenn and Tara were making their escape towards the prison's front gates, the zombified Clara enters through the destroyed prison fences, along with other walkers.",
        "Death[]": "Killed By Herself (Suicide, Alive) Clara commits suicide by stabbing herself in the abdomen with her knife, to turn into a walker and to be with her undead husband, Eddie.",
        "Killed Victims[]": "This list shows the victims Clara has killed: Herself (Suicide, Alive) Numerous counts of unnamed people (Caused)",
        "Appearances[]": "",
        "Trivia[]": "Clara and Rick are both in the first picture released for Season 4, where many people originally thought Clara was a standard background zombie in a scene. Scott Gimple stated on Talking Dead that her final words to Rick will be relevant to the rest of the season. The questions that Rick asks Clara are the same questions he was asked in the phone calls in \" Hounded \". Clara is the only miscellaneous survivor to have an undead status. Ironically, her husband Eddie is the only named walker to still be classified as undead. She is also one of nine survivors classified as being undead, the other eight being Jim , Callaway , Pete Dolgen , Eric Raleigh , Winslow , Matias , Lucille , and her husband Eddie . While Duane Jones was also classified as undead at the end of the TV Series, he was finally put down in the episode \" King County \" of Fear the Walking Dead . She bares a bit of a resemblance to Beatrice from the Telltale Series .",
        "Name": "Clara"
    }
]