[
    {
        "Clark": "",
        "Overview[]": "Clark comes off as an extremely stoic, somewhat robotic, and intimidating individual. As an auditor for the Commonwealth , it is Clark's job to interview newcomers through different assessments. Throughout the interview, Clark can be quite rude, often interrupting the interviewees and asking ridiculous questions that no one can remember, which often gets on the interviewees nerves. Though Clark generally is very unemotional, if the interviewee can show their value and intelligence, then she shows that can be impressed. When Yumiko is able to correctly deduce her occupation before the outbreak and the details about the Commonwealth in a short time, Clark is intrigued and even smiles a little.",
        "Pre-Apocalypse[]": "Nothing is known about Clark's life prior to or as the outbreak began, although given her occupation as an auditor for the Commonwealth , it's likely that she possessed a similar career before the apocalypse.",
        "Post-Apocalypse[]": "Serving as an auditor at the Commonwealth Processing Center , Clark and Evans interview Juanita , Yumiko , Ezekiel , and Eugene to get an idea on who they are and if they will pass the initial assessments to be considered entry into the Commonwealth. Over the course of several hours, Clark and Evans ask numerous questions, often irritating their interviewees, especially regarding the private and repetitive nature of their questions. That night, Eugene and his group attempt to sneak out of the detention center, passing by a room where Clark and Evans interview a man and a woman they had briefly met earlier. Yumiko is put back in the interrogation room, with Clark and Evans apparently being the ones in charge. Clark says she isn't sure why Yumiko is talking to them, since she had already been assessed, but the latter asserts that she was the one assessing them instead. She goes on to deduce that their community is large and organized, with a bureaucracy the interrogators are a part of. She also believes the interrogators had similar jobs before the apocalypse, guessing that Clark was a forensic psychologist and Evans an academic researcher. With their role being to assess threats to their community, Yumiko determines that the reason the interrogators asked about their past lives is because someone above them determined that was a good position from which to judge who they were in the present. She also deduces that their currency is the US dollar, as they hounded one of her companions over a $2 bill, with the reason for this being their need to strictly control the amount in circulation. Yumiko also believes the Commonwealth uses old currency as a symbol to remind people of the days before the fall. While she understands their need to determine whether she and her companions are an asset or a liability, she asserts that the Commonwealth needs to justify its existence, too. Taunting her interrogators, Yumiko hypothesizes that manual laborers are more valuable nowadays that someone who can write endless lists of questions, when at the end of the day, they still need to rely on their gut instinct. She pegs the interrogators as people who follow rules, which she likes, as she was a lawyer once, and goes on to proclaim that they need her. Yumiko says that she has reason to believe her brother is alive in the Commonwealth and, thus, requests expedited processing for her and her group. With that, Mercer enters the room, and offers Yumiko a cup of coffee. With the city breached and many civilians killed as reported by Colonel Vickers and the screams heard throughout the invasion, Clark's fate is left unknown. It is possible she was let into the Estates with the crowd of terrified citizens or was rescued later on elsewhere in the city, or was killed by the undead.",
        "Killed Victims[]": "This list shows the victims Clark has killed: Possibly numerous counts of zombies",
        "Appearances[]": "\" Acheron: Part I \" \" Acheron: Part II \"",
        "Trivia[]": "She shares a last name with the Cl ark fam ily in Fear the Walking Dead ."
    }
]