[
    {
        "Craig": "Craig",
        "Pre-Apocalypse[]": "Nothing is known about Craig's life prior to or as the outbreak began, except that he had a brother named Ethan and was a very good cook.",
        "Post-Apocalypse[]": "Craig and Ethan survived the early stages of the outbreak and took residence in a FEMA camp where they were later evacuated to a safe-zone named the Hilltop Colony , upon where Craig settled into the farming community where he became integrated with the fellow residents, most notably Gregory and Paul Rovia , and thus became a prominent member. Craig was present at the time of the arrival of the Saviors , a notorious group of survivors who demanded half of the Hilltop's supplies in exchange for leaving the farming community unscathed. Though initially reluctant to comply the Saviors demonstrated their motives through publicly executing a 16-year-old resident Rory . Following this barbaric event, the colony entered into a period of dread and submission and thus were forced to comply under Negan Smith 's rule, were due to their limited resources and manpower they were unable to rebel against their savage oppressors. Throughout the following months, the community begrudgingly began to gather supplies to present towards the Saviors in their desperate attempt to keep them at bay. Craig was assigned as a member of a supply group tasked with routinely delivering a portion of supplies directed towards one of the Saviors compounds. Approximately 20 months into the apocalypse, Craig was part of a supply exchange conducted between the Hilltop and the Saviors alongside Ethan, Crystal , Andy , Tim , and Marsha . Upon delivering the supplies, Negan personally felt unsatisfied with the amount received and thus had both Tim and Marsha executed and Craig imprisoned located in one of the Saviors' compounds. Negan ordered the remaining Hilltoppers to return home and, in exchange for Craig's release, kill Gregory and return back with his head as evidence of his death. When Andy arrives at the Savior outpost, he shows the head of \" Gregory \" in exchange for his captured friend. After the Saviors accept the gift, one of them brings out a badly beaten Craig, who is then promptly rescued by Rick's group. When the alarm is set off, Craig and Andy drive away from the compound to the Hilltop. Craig is among the several Hilltoppers killed during the Saviors' tainted weapons attack on Hilltop. He was either killed during the battle itself or was injured and later succumbed to his wounds from the tainted weapons. [1]",
        "Death[]": "Killed By Negan Smith (Indirectly Caused) Simon (Caused) The Saviors (Caused) Zombies (Alive) Following the Saviors' attack on the Hilltop, Craig is among the residents killed in battle or devoured by his reanimated militia members, who succumbed to the infection after being wounded by tainted weapons on Simon's orders. The Militia (Before Reanimation) Craig is later put down to prevent reanimation.",
        "Killed Victims[]": "This list shows the victims Craig has killed: Possibly numerous counts of zombies",
        "Appearances[]": "\" Not Tomorrow Yet \" (No Lines)",
        "References[]": "",
        "Name": "Craig"
    }
]