[
    {
        "Overview[]": "Craven is a cruel, selfish, and remorseless man who has no qualms with torture, stealing, and murder. When he captures Negan , he taunts him and demands where he got the drugs. Even when Negan tells him about his dying wife , he pretends to have sympathy even though he clearly doesn't care. Eventually Negan gives in and tells Craven the location of where he got the medicine. Craven is shown to be somewhat honorable, letting Negan go when he holds his end of the deal. However, this would come back to bite him when a vengeful Negan returns. While torturing Franklin , Negan takes out Craven's men. Now with the tables turned against him, the roles of how he and Negan first met are reversed, with Negan being the one in power and Craven at his mercy. Craven's actions and death would be the one of the main turning points for Negan.",
        "Pre-Apocalypse[]": "Nothing is known about Craven's life prior to or as the outbreak began, other than he was the leader of a motorcycle gang known as Valak's Vipers.",
        "Post-Apocalypse[]": "Sometime after the initial outbreak, Craven and his gang started roaming the roads at night and preying on other survivors to steal their supplies. Twelve years earlier, Craven has a terrified Negan tied to a chair in a bar. Negan begs his captors to let him go as his wife has cancer and she needs the chemotherapy drugs in his cooler. Negan insists that keeping him there is killing both Negan and Lucille. Craven claims to be sympathetic to Negan's plight, but the bikers didn't find the doctors where Negan had claimed they had given him the drugs. Negan insists that the doctors move around and it isn't his fault, but Craven doesn't believe him. Craven is sure that if the doctors had something as rare as chemotherapy drugs, they must have a lot of other stuff as well. Negan finds a loose screw in his chair as Craven talks to him and begins unscrewing it, unnoticed by Craven. Craven promises that if Negan helps them find the doctors, he will allow Negan to take the drugs to Lucille but if he doesn't, he will pour it down the toilet and make Negan watch. Craven punches Negan in the face and he agrees to tell Craven what he wants to know if he puts the drugs back into the cooler. Craven has one of his men return the drugs to the cooler and Negan starts to explain how the clinic is true and the doctors have a medical stockpile somewhere he doesn't know the location of. Negan was tracking them for weeks and found them two or three days before. Craven interrupts Negan's story as he continues to loosen the screw, frustrated with being given \"one pointless story after another.\" Craven complains that Negan talks too much and, drawing his gun, demands that Negan tell him where he got the drugs or he will kill Negan and Lucille will die thinking that Negan ran out on her. Negan gives in and asks Craven to bring him his map. Negan marks Franklin's location on the map and explains that security is light and that they are dealing with a guy and his daughter, the guys on top of the RV are decoys and while there could be a couple of others, they have no guns. Craven has Negan locked in the storage room while he checks it out. In the morning, Craven releases Negan, having found Franklin and Laura exactly where Negan told him they would be. Negan leaves on his motorcycle, briefly hesitating after hearing Laura struggling with the bikers in the RV now parked outside of the bar. Craven and his men are torturing Franklin for the location of his drug stash. Negan returns and kills one of the bikers with Lucille and after staring at the bat in shock for a moment, searches the body and finds a gun. As another biker comes around the corner and finds him, Negan shoots and kills the man. Negan engages in a gunfight with the bikers, killing them all single-handedly before smashing in the glass door of the bar. As Craven shoots at Negan, Franklin breaks free and smashes his chair over the man's back and Negan enters and subdues Craven with a blow to the face from Lucille. As Franklin binds Craven, Negan tells him that he thinks he got all of the bikers. Giving Franklin his gun, Negan tells him to go find Laura and make sure that she's ok. Left alone with Craven, Negan remarks on the irony of their situation being reversed and states that he has a lot of stuff to get off of his chest this time too and \"something very terrible is going to happen to you\" when Negan stops talking this time. Negan states that he's never killed a man before that night, but he came close once. Negan explains how one night at his and Lucille's favorite bar, they were playing their favorite song \"You Are So Beautiful\" by Joe Crocker when a man was being completely obnoxious while the song was playing. When the man refused to stop, Negan demanded 50 cents to play the song again for his wife and when the man refused and came at him, Negan saw red and beat the man badly before taking a dollar from his wallet to play the song again twice. However, the man had kids at the school where Negan worked which got him fired. The guy then sued Negan, forcing Lucille to pay his medical bills since Negan didn't have a job anymore. \"The point of this is there are consequences to me seeing red. Seeing red was a bad thing then. I was a bad man. Then. But seeing red now? Nobody's suing anybody. Nobody's getting fired. Hell, nobody's keeping score. Now, when I see red, it's just a question of what I am capable of. And well, man, I hate to break it to ya, but I am starting think I am capable of damn near anything.\" Stating that this is for not killing him, Negan bashes Craven's head in with Lucille.",
        "Death[]": "Killed By Negan Smith After telling him a story about his past, Negan bashes Craven's head in with his baseball bat, Lucille.",
        "Killed Victims[]": "This list shows the victims Craven has killed: Possibly numerous counts of zombies and unnamed people (Pre- and Post-Apocalypse)",
        "Appearances[]": "\" Here's Negan \" (Flashback)",
        "Trivia[]": "The casting call for this character used the name Baxter . Craven is the last named character to die in Season 10 . Chronologically, Craven is the first named character to be killed by Negan Smith in the TV Series .",
        "Name": "Craven"
    }
]