[
    {
        "Crowe": "",
        "Fate": "",
        "Contents": "",
        "Pre-Apocalypse[]": "Nothing is known about Crowe's life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "At some point during the outbreak, Crowe joined a community in Ohio. Sergeant Crowe and a group of soldiers accompany Toby Carlson and his emissaries to Riverbend . Prior to raiding the survivor community, Sergeant Crowe helps set up base camp a short distance away from Riverbend. He is busy setting up camp when Carlson radios him despite him standing five feet away. The soldier sighs and stops his task before turning around and replying on the radio while looking at Carlson. Later when Riverbend was under siege, Sergeant Crowe and his fellow soldiers began to search the large apartment building for any other survivors and the missing weapons from the Commonwealth caravan. When Trooper Daniels apprehended a young boy found near the perimeter, he radioed Sergeant Crowe about the discovery. However before Crowe could ask any further questions, Daniels was killed by Negan. Meanwhile, Sergeant Crowe accompanies Carlson as they make their way up the building, executing innocent civilians hiding in their homes. Eventually he and another solider split up from Carlson's group and continue their way through the building. When Carlson radios for help from the roof, Crowe radios back that they have enemy combatants incoming, referring to the Riverbend residents fighting back, eventually leading to the death of Crowe and any remaining soldiers.",
        "Death[]": "Killed By Maggie Rhee or Annie Smith During a skirmish with the remaining Riverbend residents, Crowe is shot and killed by either Maggie or Annie.",
        "Killed Victims[]": "This list shows the victims Crowe has killed: Hart (Possibly) At least 10 unnamed Riverbend residents (6 Caused, Alive, 4 Possibly, alongside Commonwealth Army ) Numerous counts of zombies",
        "Relationships[]": "",
        "Appearances[]": "\" Warlords \" \" The Rotten Core \""
    }
]