[
    {
        "Crowley": "",
        "Fate": "",
        "Contents": "",
        "Overview[]": "Crowley is brutal, reckless, and one of the Governor 's most trusted soldiers. It is said that he wasn't raised with much discipline growing up. He takes part in the Governor's killing of National Guard. He takes humor in Michonne 's \"biter gram\", only for him to be decapitated by Michonne moments later.",
        "Pre-Apocalypse[]": "Very little is known about Crowley's life prior to or as the outbreak began. Crowley had some sort of quasi-military training and grew up in the woods of Georgia, spending his time hunting and with firearms, and did not have much discipline. [1]",
        "Post-Apocalypse[]": "Crowley was first seen at the helicopter crash site with the Governor , Merle Dixon , Tim , Martinez and Shumpert . He exited the jeeps once they arrived and was seen wielding an assault rifle. He began investigating the area, searching for walkers. When Merle discovered Andrea Harrison and Michonne Hawthorne , the group returned to Woodbury. While there, Andrea and Michonne were locked into a room by the Governor and carefully guarded by Crowley and Shumpert. Crowley was not seen again until the next day when Lieutenant Welles revealed where his U.S. Military allies had been holding up. The Governor, Shumpert, Tim, Martinez, Merle, and Crowley arrived at the location and eliminated every National Guard soldier present. Afterwards, Crowley was seen with Tim, Caesar, and Shumpert standing behind the Governor, before taking the armored vehicles, medicine, food, and other supplies. They eventually returned to Woodbury. Crowley assisted Merle Dixon, Tim, and Gargulio during a search party in pursuit of Michonne. Michonne abruptly revealed her position to the group, decapitating Crowley, and stabbing Tim. Moments after, Merle ordered Gargulio to stab Crowley's head before reanimation. Gargulio hesitated, but finally went through with the deed.",
        "Death[]": "Killed By Michonne Hawthorne After being sent out to kill her, the group is ambushed by Michonne, who had snuck up behind Crowley and Tim. Before he can react, Crowley is decapitated. Gargulio (Before Reanimation) Later, Gargulio stabs him through his temple to prevent reanimation after Merle told him to do so.",
        "Killed Victims[]": "This list shows the victims that Crowley has killed: Wilson (Alongside his fellow survivors) Welles (Alive, Possibly, Direct or Caused) 5 unnamed U.S. Military soldiers (Alongside his fellow survivors) Numerous counts of zombies and possibly unnamed people",
        "Relationships[]": "",
        "Appearances[]": "",
        "Trivia[]": "Crowley is the first Woodbury citizen to die on-screen. It was stated by the Governor to Merle Dixon that Crowley had several close calls in past scouting/supply runs. [2] Crowley had several lines that were deleted from \"Walk With Me\", showing him exchanging heated words with Andrea in the infirmary. [3] . In an interview, Arthur Bridgers revealed that Crowley had \"some quasi-military training\". Crowley is the first named character to be directly killed by Michonne Grimes in the TV Series .",
        "References[]": ""
    }
]