[
    {
        "D.J.": "",
        "Fate": "",
        "Contents": "",
        "Overview[]": "During his time as a Savior, D.J. was like many other members: an aggressive extortionist and raider that imposed his will onto others. However, he is not as much of an extremist as some of the other Saviors like Simon . After the Saviors are defeated, D.J. tries to cooperate with the communities and live in peace, but decides to follow Jed in his rebellion against their new leader, Carol , after several of his fellow Saviors are killed. Despite aiding Jed in ambushing Rick and Carol, D.J. stands aside and makes no actual aggressive moves towards the two himself. After Carol overpowers Jed, D.J. surrenders without a fight. Six years after the apparent death of Rick Grimes and the fall of the Sanctuary, D.J. has a change of heart, opting not to follow Jed in continuing the Savior ways and joining Alexandria , eventually becoming a trusted and civil member who watches over the gate, escorts newcomers to holding, and helps transport Magna's group to the Hilltop , holding no grudge against his former enemies. In return, his former enemies show him no animosity and easily treat D.J. as one of their own. D.J. is also shown to have an unwavering loyalty to Michonne, as she is shown to have complete trust in him, referring to him and Siddiq as “her men”. D.J.'s most noticeable trait seems to be loyalty. Just as he was staunchly loyal to Negan, he is loyal to Alexandria and Michonne seven and a half years later. Despite this, D.J. has enough sense not to fight for a lost cause, as he never attempted to free Negan and refused to join Jed's group of marauders following the demise of the Sanctuary, despite initially joining his rebellion. Over the six years following Rick's disappearance, D.J. became a trusted member of Alexandria, earning Michonne's respect as a loyal survivor. D.J. has been shown on many occasions to be brave. At the end of his life, D.J., along with Ozzy and Alek , assaulted the Whisperers to give the captives a chance to escape despite being heavily outnumbered. Though he ultimately fell, D.J.'s actions along with that of Ozzy and Alek gave the captives a chance to fight back in a heroic last stand, something that D.J. is remembered for.",
        "Pre-Apocalypse[]": "Nothing is known about D.J.'s life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "At some point in the apocalypse, D.J. somehow came into contact with a group named \"the Saviors\" which he subsequently joined upon where he was appointed as one of the Sanctuary guards. D.J. aided his group in terrorizing other survivors and communities around the area into subjugating to Negan's will, where their victims would be forced to give half their supplies in exchange for not being murdered.",
        "Death[]": "Killed By Himself (Caused) Alpha (Alive) D.J., Ozzy, and Alek find the barn where several residents are kidnapped. They fight valiantly to rescue them, but are overpowered and decapitated alongside them by Alpha. Daryl Dixon , Carol Peletier , Michonne Grimes , or Yumiko Okumura (Zombified, Off-Screen) After finding the border, his zombified head is put down by either Daryl, Carol, Michonne, or Yumiko.",
        "Killed Victims[]": "This list shows the victims D.J. has killed: Gary (Alongside Norris and Arat ) Simon (Possibly, Zombified) Himself (Caused) 10 unnamed Saviors (Alongside Norris and Arat) At least 1 unnamed Whisperer Numerous counts of zombies and unnamed people",
        "Relationships[]": "For a more in-depth look at D.J.'s relationships, read here: D.J. (TV Series)/Relationships",
        "Appearances[]": "",
        "Gallery[]": "For more images of D.J., please visit D.J. (TV Series)/Gallery .",
        "Trivia[]": "So far, D.J. is the one of two known survivor in the TV Series to renounce his antagonistic ways twice, the other being Anne. The first time being after Negan was defeated and the second after the shootout at the campsite. He is also the only known member of Jed 's group to have done so. This is despite his former status as Jed's second-in-command. Despite being a fiercely loyal and prominent Savior during the war, D.J. never actually killed or even harmed any of the survivors. The only living people he has ever killed on-screen were Simon 's loyalists in \" Worth \", an act that benefited the other survivors. D.J. was the last known member of Jed 's group of rebels to die. Actor Matt Mangum stated that D.J.'s loyalty to Jed was more out of a sense of survival than actual loyalty. D.J. is one of five Savior lieutenants to renounce his antagonistic ways, with the other four being Laura , Arat , Eugene Porter , and Dwight . According to actor Matt Mangum, there was a cut line in the episode \" Stradivarius \" where Siddiq asks Michonne to allow him to come with her on the journey to Hilltop with Magna's group , stating that \"All D.J. talks about is horses.\" This is likely a reference to Matt Mangum's horse tattoos, which have appeared in the show before. In an interview with BMNY, Matt Mangum joked that D.J.'s name was Don Johnson. However, there is no official confirmation that this is true. [1] D.J. is the only recurring character pike victim with a proper death scene, as it was shown in flashbacks during the episode \" Open Your Eyes \". It's hinted in \" What We Become \" that D.J. may have been present during the events of \" Last Day on Earth \" and \" The Day Will Come When You Won't Be \". This may not be the case, however, as Michonne's memories are very warped during her hallucinogenic experience, so several characters are present where they weren't originally, like Laura dying at the Satellite Outpost. It is most likely that Michonne was simply imagining these events with Saviors she was most familiar with, such as D.J. and Laura, who joined Alexandria after the Sanctuary fell. D.J. appears in the archival footage shown at the beginning of \" A New Deal \" as Judith narrates past events of the show to the audience before the episode's story begins.",
        "References[]": ""
    }
]