[
    {
        "Dana": "",
        "Fate": "",
        "Contents": "",
        "Overview[]": "Dana comes off as a rather condescending and strict person. As the doctor of the Kingdom , she is shown to be intelligent and is quite experienced. However, to those who she seems as not ready or uneducated, she often gives a hard time, saying \"In my experience people who don't know enough are more dangerous than people who don't know shit.\" She initially gives Siddiq a hard time, hitting him with my questions about what he knows believing him to be not ready. However, Siddiq stands up for himself and shows that he is capable. Dana is admires this, stating that she likes Siddiq before sending him back to work.",
        "Pre-Apocalypse[]": "Nothing is known about Dana's life prior to or as the outbreak began, except that she was a surgeon.",
        "Post-Apocalypse[]": "At some point in the apocalypse, Dana joined a community called the Kingdom where she became the main doctor. Following her evacuation to the Hilltop with the other Kingdommers, Dana has taken up the role of the community doctor. While the militia prepares for the upcoming battle against the Saviors , she is busy gathering supplies at the infirmary when Siddiq arrives with blankets and offers to help. Dana gives Siddiq a hard time until he snaps and demands that she start cooperating with him instead of fighting. Taken back in admiration, she tells Siddiq that she approves of him and sends him to work. That night, at around 4:00 am, Dana heads towards the medical trailer until she finds the door wide open with a pool of blood at the doorway. Before she can react, she is bitten on the neck and killed by a zombified Tobin . A short time later, a reanimated Dana is along the zombified residents and refugees to attack the people sleeping inside the Barrington House. During the attack, Dana is put down with a knife to the face by Daryl . The next morning, she is buried in the graveyard with the other casualties.",
        "Death[]": "Killed By Negan Smith (Indirectly Caused) Simon (Caused) Derek (Caused) Tobin (Infected, Alive) After turning into a walker due to the Saviors' tainted weapons, Tobin attacks Dana, biting into the side of her neck. Daryl Dixon (Zombified) As a zombified Dana advances on Daryl, he stabs her in the forehead, putting her down.",
        "Killed Victims[]": "This list shows the victims Dana has killed: At least 1 unnamed Hilltop refugee (Infected) Possibly many unnamed patients Numerous counts of zombies and possibly unnamed people",
        "Relationships[]": "",
        "Appearances[]": "\" Do Not Send Us Astray \"",
        "Trivia[]": "While Dana was not introduced until Season 8, Episode 13 \" Do Not Send Us Astray \", she was referenced multiple times by other characters in Season 7 and Season 8. In \" The Well \", Morgan made a reference to Dana while speaking with a recovering Carol in her hospital bed. In \" Rock in the Road \", Morgan made a reference to Dana when mentioning to Rick that the \"doctors\" took care of Carol. In \" Mercy \", Ezekiel suggested to Maggie that she visit their doctor at the Kingdom, quoting her as a “woman of talent”. In \" JSS \", Denise the Alexandrian doctor is mistakenly referred to as \"Dana\" by Tara. She is the third known character (after Tobin and Kurt ) to have a time of death, in her case between 3:57 AM and 3:58 AM. Dana is the second doctor to die during All Out War , the first being Harlan Carson . She is also the fourth doctor killed by the Saviors , the first is Denise Cloyd , then Emmett Carson , next Harlan Carson, and Dana being the last (though Denise, Emmett, and Harlan are directly caused and Dana is indirectly caused). Technically, Dana is the last named Kingdom resident to die on-screen, since both Henry 's alive and zombified deaths were off-screen."
    }
]