[
    {
        "Daryl Dixon": "",
        "Contents": "",
        "Overview[]": "Daryl is both physically and mentally strong. He is often surly and very resourceful, but his compassion and loyalty towards the people he cares about are second-to-none. Despite his hardened personality, he is not without a softer, more emotional side. He is often volatile, but still significantly more level-headed than his older brother, Merle Dixon. Usually distant, Daryl is often shown to be caring and selfless under extreme circumstances. Without being asked, he attempts to find the lost Sophia Peletier on multiple occasions, one of which nearly cost him his life. He also takes the initiative to go back to find Andrea when she gets separated from the group. In Season 1 , Daryl is portrayed as a southern specialist tracker who constantly lives in the shadow of his older brother, Merle. Despite his hostility and distant behavior, he is a member of the team for a multitude of reasons - some of which being his hunting and tracking skills, his creativity in dealing with walkers , and his uncanny knack for surviving some of the worst possible conditions. In Season 2 , Daryl becomes more complacent and cooperative within the group, showing signs of respect and affection to the members he's growing closer to through mutual respect. He also begins to develop a special bond with fellow survivor Carol, helping her find her lost daughter, Sophia. Daryl begins to realize his older brother's way isn't the only way to do things, taking on more responsibility for his actions and the group itself. Having been an outsider for most of his life, he is now starting to become a loyal member of the increasingly closely-bound team. However, after Sophia's death, he reverts to his original hostility and becomes emotionally detached from the group. With the help of Carol and the rest of the group, he is involved in some issues (eg. helping Rick and Shane handle Randall ) and seems to care about the farm and his shelter. On the night the farm is destroyed, he escapes with Carol and while she tries to persuade him to leave with her, Daryl, with a sense of respect for Rick, seems to be committed to keep the group safe. In Season 3 , Daryl proves to be invaluable, helping Rick and the rest of the group to clear the prison from the walkers so they can turn it into their new home. Moreover, he helps defend the prison after Rick's psychological collapse due to Lori 's death, takes care of Judith , and also demonstrates his leadership capabilities by keeping the team united. The group has now become a large family, for which he is willing to kill or die for. Not surprisingly, when he learns that Glenn and Maggie are detained by The Governor at Woodbury , Daryl is one of the first members of the group to voluntarily go with Rick and penetrate the town to get their people back. However, Daryl ends up imprisoned there and after many hardships manages to escape with his brother, Merle. Daryl is then forced to choose between his old family and his new family. He finally decides to go with his brother. Daryl and Merle meet a family that is threatened by walkers. Daryl shows his altruistic mentality, leaping in to save them while Merle ignores them and then tries to plunder their car. However, Daryl prevents him, deciding to leave his brother behind and return to the prison. Merle then decides to follows him as he has nowhere to go. Merle eventually sacrifices himself while trying to kill the Governor. Daryl later finds that Merle has turned, and for the first time Daryl shows his conflicting feelings. He is understandably devastated by his brother's death, yet he unleashes frustration and anger he's felt for his brother since childhood on Merle's body. In Season 4 , his role in the group is even more important. He has become a member of the Prison Council , being responsible for the prison administration and is also one of the key members of the group. However, the security of the prison does not last long, as the Governor leads a new team that manages to eventually destroy the team's shelter. After the Governor's assault, Daryl and Beth are separated from the others and Daryl firmly believes that they all died during the assault. He feels guilty about not being able to protect Rick, Hershel and the rest of the group. However, everything changes when Daryl meets Rick, Michonne , and Carl once again just before they all head to Terminus . Rick's relationship with Daryl has become so strong that Rick considers him a brother. In Season 5 , the group is trapped in Terminus. They all face great risk, but an explosion gives them the opportunity to escape. Thanks to Carol, the group is able to reunite. During the fifth season, Daryl and Carol's bond gets stronger, having been separated from each other for a long time. However, Daryl hasn't forgotten what happened to Beth. At the same time, the group meets a new survivor, Father Gabriel . At one point, Daryl sees the car he had seen the night Beth was lost and follows it with Carol. In their effort to find Beth, they meet Noah , who informs the pair that there are people kept as hostages and Beth, who had helped him escape, was one of them. Throughout the previous seasons, Daryl has begun to mature. He prevents Carol from killing Noah, saying \"He's just a kid\". Later in the season, the group who captured Beth, captures Carol as well after being hit by one of the hospital's scavenging cars. Daryl returns to Father Gabriel's church with his main motivation being revenge. The whole group is preparing to get back its members. Unfortunately, only Carol manages to come back as Beth ends up with a bullet on her head. Daryl responds with swift vengeance on Dawn Lerner . After a long search for a shelter, the group finds a barn and temporarily stays there, but a new and seemingly suspicious survivor named Aaron approaches them and suggests they follow him. After a lot of discussion, they finally join Aaron and end up in Alexandria . At first, Daryl cannot adapt to Alexandria's life and is isolated. However, soon, due to his hunting and tracking skills, he is offered to be Alexandria's new recruiter along with Aaron. In Season 6, he uses an newly acquired RPG to destroy a group of Saviors, saving Abraham and Sasha. During a supply/scavenging run, they meet up with Jesus, a survivor from another camp called the Hilltop Colony which is run by Gregory. In order to open up talks of trading between the Hilltop and Alexandria, Rick and the group agree to attack the Saviors to ensure the safety of the Hilltop. The group sets out to attack what turns out to be just one outpost of many. Though they win that particular battle, it starts a full out war with the remaining Saviors and their leader, Negan. Later in the season, Daryl ends up injured and hostage to Dwight. The events of the sixth season culminate in the last episode, wherein the group is circumvented in getting Maggie to Hilltop for medical attention for a sudden complication with her pregnancy. The season finale is left open as to who is on the receiving end of Negan's punishment. In Season 7, after the deaths of Abraham and Glenn, Daryl is seen for the first time truly broken. Alexandria ends up working for Negan and for the first half of the seventh season, Daryl is imprisoned in The Sanctuary. Through the hardships and psychological torture, Daryl still manages to maintain his sanity. With the help of Dwight's wife Shelly, Daryl escapes the daily torture at the Sanctuary, and after killing a Savior named Fat Joey, is reunited with his group at Hilltop. The group's mission becomes recruitment of other communities to help add numbers to their fight against the Saviors. Hilltop and Alexandria commit fully to the war, however the Kingdom, The Scavengers and Seaside are both wary to join them. At the Sanctuary, Dwight's allegiance shifts now that his wife has escaped. Dwight arrives at Alexandria with an offer of intelligence on The Saviors and his help in defeating them. Still upset at Dwight for killing Denise, he slams him against the wall, but Dwight insists he's on their side and offers to work with them, saying his only reason left for staying with the Saviors, Sherry, is now gone, he begrudgingly stands down. In Season 8, Daryl is the key character for the success of the plan to trap The Saviors inside of the Sanctuary. Daryl, along with Rick separate from the rest in order to get some weapons from a Savior outpost. However, it soon becomes clear that Daryl, seething over Glenn's death and the torture he suffered at the hands of the Saviors while imprisoned by them, is determined to kill them all, not caring what their reason for following Negan's orders may be. This is shown when he kills Morales despite their history prior to his joining the Saviors stating that the history in question no longer matters, murders an unarmed Todd despite the fact that Todd was just a worker and that Rick had just promised Todd they would spare him if he gave them the information he'd agreed to give them and drives a bus through the Sanctuary wall in a determined attempt to allow walkers they'd lured to the Sanctuary to get in and kill everyone inside, so blind with hate that he was unconcerned that many of the people the walkers subsequently killed were innocent prisoners and workers. Upon Carl's death, he reminds the teenager that he saved the entire Alexandria community with his actions. Still stunned from Carl's death, Daryl and the group reluctantly decide to \"trust\" Dwight, but he still says that he will kill him when the war is over. Finally, Daryl participates in the final battle against The Saviors. Then, he leads Dwight into a forest, where Dwight waits to be killed. However, Daryl, finally accepting that Dwight had been forced to follow Negan's orders against his will, drives him away and encourages him to look for his wife Sherry, warning that he will kill him if he returns. In Season 9, eighteen months after the victory of the communities against the Saviors, Daryl has become the leader of the Sanctuary, which seems to not entirely please him. Indeed, he expresses to Rick his desire to do what he is good at; being out there, but Rick doesn't agree. The relationship between the two men is not at its best, as they have different beliefs and it seems clear when Daryl is eager to help Maggie, who wants to kill Negan, contrary to Rick's \"belief\". Later, Daryl tries to prevent Rick from stopping Maggie. They have a brief fight, but in the end, they reconcile. Then, when a horde of walkers is preparing to attack the communities, Daryl and Rick split up with the latter presumably dead. After a six year time jump, everything has changed and Daryl now lives alone with a dog. Daryl later assists Jesus and Aaron in looking for a missing Eugene. In their effort to find him, they notice that something strange is going on with the horde of walkers. When they finally find Eugene they are confronted by The Whisperers . In \" Omega \", Daryl shows a knowledge of how abusive parents work and sympathy for Lydia when he realizes that the girl has been abused. Upon confronting Daryl, Henry realizes that Daryl himself is likely a victim of abuse, explaining his knowledge and sympathies. Henry tells Daryl that \"sometimes you act like the kind of guy that slams people against walls, but I don't think that's it,\" implying that Daryl was the one who was abused rather than being an abuser. Henry suggests that Daryl's perspective could help to show Lydia that Daryl could be the one person to show Lydia that there's nothing to be afraid of with Daryl suggesting that Henry could as well. In Season 10, Daryl continues helping to lead the fight against the Whisperers as well as struggling to act as a father figure towards Lydia. Despite his bad past with Negan , Daryl comes to his defense and even votes not to kill him, trusting the word of both Negan and Lydia about what had actually happened during the altercation with Margo , Gage and Alfred . However, Daryl becomes filled with rage when Magna and Connie , whom Daryl had developed a close friendship bordering on possibly romantic, disappear after the collapse of Alpha's Cave . With Carol's reckless actions having caused it, this develops a rift between the two formerly close friends and Daryl recklessly attacks Alpha, nearly getting himself killed in the process. Following the end of the war and the defeat of the Whisperers, Daryl remains distant and bitter towards Carol, particularly after returning to Leah's Cabin and finding Leah to be still missing. In Season 11, Daryl has lost some of his bitter rage and willingly works with Negan during the mission to take down the Reapers . Daryl's surprise reunion with Leah allows him to infiltrate the group with Daryl trying to both take them down and protect both his former lover and his adopted family, something that Daryl and Leah share in common. Although the mission ends with Leah being forced on the run, Daryl is finally reunited with Connie which softens his attitude once more. With both Rick and Michonne gone, Daryl takes up the role of parent towards Judith and R.J. , something that he struggles with at times, although Daryl makes for a good father overall. Daryl also seems to have mended his relationship with Carol after Connie's return and moving to the Commonwealth , the two even planning to have lunch together at one point. Working as a soldier in the Commonwealth Army , Daryl maintains his loyalty to his friends and family, even threatening Lance Hornsby at gunpoint when he steps out of line. Commonwealth General Michael Mercer , who has to deal with corruption in his forces, is shown to have a great deal of respect and trust in Daryl despite them having a short relationship. During this period, while Daryl wears his armor often, he also discards it in situations where he's around his friends, such as the standoff at the Hilltop and working with Gabriel and Aaron despite them being with a number of other Commonwealth soldiers. When Leah resurfaces, Daryl kills his former lover to protect Maggie and tells her that he feels he owes it to Glenn to protect her in the stead of Daryl's deceased friend. When the Coalition and the Commonwealth go their separate ways, Daryl argues with Judith who wants to stay and help, revealing in the process that Daryl does too, but to him, keeping Judith and R.J. safe is more important which means taking them and leaving instead of staying. However, while Daryl is protective over them, he is not overprotective, allowing Judith to join him in putting down a small herd of walkers that are attacking and killing innocent people. After the Commonwealth is saved and having learned that Rick is still alive, Daryl decides to go looking for his best friend with the encouragement on Carol and Judith, the latter of whom encourages Daryl to find his own happy ending. After being transported to France by the Power of the Living , Daryl at first focuses on returning home to America, wanting to keep his promise to Judith. However, things change for Daryl after he meets Isabelle and Laurent who need his help. Daryl finds himself drawn to Isabelle while becoming a father figure to Laurent who has never had a father in his life before. Daryl helps to bring them to Paris and the Union of Hope , building the start of a family with Isabelle and Laurent which scares him. When Daryl gets the chance to return home, he takes it, but is clearly conflicted. However, Laurent following him and falling into danger causes Daryl to change his plans. Staying in France for the time being, Daryl takes up a leadership role in the fight against Genet and her forces and trains Laurent in how to defend himself, putting him at odds with Losang 's more pacifist approach. Isabelle tells Daryl that she thinks that he simply does what's necessary, even when no one else is willing to do it, \"especially then, in fact,\" but now that they've made it to the Nest , Laurent needs something else from Daryl. However, Daryl isn't sure that he can ever be happy at the Nest and constantly thinks of the people that he had left behind in America.",
        "Pre-Apocalypse[]": "Main article: Daryl Dixon (TV Universe Games)#Survival Instinct Daryl grew up in the Appalachian Mountains of Northern Georgia alongside his older brother Merle , under the roof of their neglectful redneck parents, their father, an abusive alcoholic alongside their chain-smoker mother. Merle was the only inspirational figure he had during his youth and thus inherited his backward views on society, however, due to his older brother's service in juvenile detentions, he became frequently absent from Daryl's life and thus he was reluctantly forced to fend for himself, upon where he developed a hard-boiled survivalist mindset. [2] At a young age, the brothers lost their mother in a house fire which had been caused by a cigarette while she was asleep or presumably drunk. [3] Some point after this event Daryl found himself lost in the woods for nine days during where he was forced to consume wild berries and utilize poison oak as a substitute for toilet paper. Eventually, he managed to find his way back home. Upon arrival however, he discovered that his father had not noticed his absence and thus Daryl simply walked through the back door and made himself a sandwich. [4] Over the course of several years, the brothers were mentally and physically abused by their father, which eventually caused Merle to abandon the family and join the military, subsequently leaving Daryl in the process which resulted in severe scars located on his back, this abuse however was unknown to Merle. [5] Following an altercation with his father, Daryl moved out from his birth home and eventually reconnected with Merle and thus simply followed his brother's lead upon where they entered into a drifter lifestyle, where the pair utilized their survival instincts, upon where Daryl grew into a proficient hunter and tracker, hunting for food and dealing in contraband. [6] At one point, the pair resided in Merle's drug supplier's house where the trio watched TV and by noon had become intoxicated, a discussion turned violent where the dealer punched his older brother, where Daryl retaliated by savagely beating the man. However, the dealer then threatened to shoot Daryl, a large argument ensued, which ended with the dealer punching Daryl in the gut, causing him to vomit. Merle and the dealer laughed the incident off. Following this near-death experience, Daryl came to view himself as an unimportant individual who held no value or purpose in life. [7]",
        "Post-Apocalypse[]": "Main article: Daryl Dixon (TV Universe Games)#Onslaught",
        "Killed Victims[]": "This list shows the victims Daryl has killed:",
        "Relationships[]": "For a more in-depth look at Daryl Dixon's relationships, read here; Daryl Dixon (TV Universe)/Relationships",
        "Appearances[]": "",
        "Gallery[]": "For more images of Daryl, please visit Daryl Dixon (TV Universe)/Gallery .",
        "Trivia[]": "Daryl has been shown to survive some of the most severe situations. In the episode \" Chupacabra \", Daryl fell off a horse and, in result, getting impaled through the torso by one of his own arrows. Later in the episode, he got shot in the side of the head by Andrea . In \" A \", he was beaten severely by the Claimers . In \" Consumed \", he and Carol Peletier were pushed off a bridge in a van. In \" East \", he got shot in the shoulder by Dwight . In \" The Day Will Come When You Won't Be \", he had enough strength to land a single punch on Negan although suffering from the aforementioned gunshot wound. In \" Chokepoint \" he managed to engage Beta in a knife fight and knock him down an elevator shaft although the latter was a much larger and physically stronger individual. In \" Scars \" he was shot with an arrow by a child then branded with an X mark by Linus , which clearly pained him. In \" Stalker \" he was stabbed in the leg by Alpha . In \" Deux Amours \" he's shown to have survived out at sea for an extended period of time before arriving at the shores of France . Originally Daryl was never planned for the AMC show, however after Norman Reedus ' audition for the role of Merle Dixon , the producers admired his performance so much they created Daryl Dixon specifically for Norman. According to the Cutting Room Floor for Issue 65 , Daryl was originally going to die in \" Vatos \". Daryl has been responsible for three of the original Atlanta group member's deaths. He put Dale out of his misery by shooting him in the head. His violent outburst during Abraham's execution resulted in Glenn's death. He shot and killed Morales with a crossbow bolt because he had a gun pointed at Rick. In addition, after the destruction of the Atlanta camp, Daryl used a pickaxe to put down those that had died before they could reanimate aside from Ed Peletier and Amy Harrison who were taken care of by Carol and Andrea instead. Daryl won IGN's \"Best TV Hero\" of 2012. [8] Daryl's signature weapon is a Stryker crossbow which he also used before the apocalypse. Throughout the series, Daryl sometime changes a different model of the crossbow from time to time. Starting in Season 9 , Daryl often uses a pair of dual-wielded large knives for close range combat. As revealed in an interview by Angela Kang , the knives were custom designed with Norman Reedus ' help to make sure that Daryl had a good secondary weapon for hand-to-hand combat as the characters were starting to be more stingy with their bullets going into Season 9 and a crossbow is difficult to reload so it's not good for quick combat. [9] After joining the Commonwealth Army , Daryl appears to adopt an AR-15 as his preferred weapon instead of his crossbow. Daryl has been one of the most frequent users of Rick's Colt Python , and at one point carried it after Judith refused to take it before he returned it to her. Daryl has been captured ten times. He was captured in the episode \" Made to Suffer \" by Woodbury and forced to fight his brother Merle. He was captured a second time in the episode \" A \" by Gareth at Terminus . He was captured again by Dwight and The Saviors in \" East \" after he and Rosita were trying to free Glenn and Michonne . He was captured in the episode \" The Day Will Come When You Won't Be \" after being recaptured by the Saviors because Negan liked the way he stood up to him. He was captured along with Michonne in \" Scars \" by Jocelyn and her kids. He was in the episode \" The Calm Before \" when he, along with Michonne, Carol, and Yumiko were captured by the Whisperers, however they were released afterwards. In a flashback, he was temporarily captured in the episode \" Find Me \" by Leah in her cabin . He was captured in \" Rendition \" by the Reapers before reluctantly joining them. In a flashback, he was captured in the episode \" Deux Amours \" by Pouvoir 's people on their boat . He was captured again by Pouvoir's people in the episode \"Deux Amours\" in Maison Mère , along with Quinn . Daryl has the highest number of appearances than any other character in the show, appearing in a total of 148 episodes. Additionally, Daryl's pet, Dog , is the animal with the most appearances in the show, appearing in 25 episodes. Daryl's crossbow has been stolen 6 times on the show. The first time was by Shumpert when he was captured by The Governor and forced to fight Merle. The second time was when the group attempted to flee Terminus, but were guided by multiple gunshots to a train car, and being made to drop their weapons for confiscation. The third was when Carol and Daryl visited Atlanta in Season 5 while looking for Beth , but got held-up by Noah in an abandoned building. The fourth time was when he saved Dwight and Sherry in the woods from the Saviors and Dwight double crossed him, stealing his bow and motorcycle. The fifth time was by Dwight again when he shot Daryl in his upper shoulder area and added him into Negan's lineup. The sixth time was when he was captured by the Power of the Living and brought aboard their ship. Daryl has the highest number of uses of the walker guts trick aside from Nicholas Clark in Fear the Walking Dead . In \" Bonds \", Daryl snaps a walker's neck and uses its blood to disguise himself from both the Whisperers and a nearby herd. In \" A Certain Doom \", Daryl uses the walker guts trick in order to sneak out through the Whisperers' horde surrounding the Tower and then to sneak into the horde and assassinate the Whisperers. In \" Rendition \", Daryl covers himself in walker guts after getting separated from the others by the Reapers , presumably in order to avoid attention from any passing herds that he encounters. In \" The Rotten Core \", Daryl and Rosita reluctantly use the walker guts trick in order to infiltrate Cooper's House and retrieve money for Sebastian Milton . Daryl has joined or infiltrated an enemy group on two occasions before later helping his friends to take them down. From \" Alone \" to \" A \", Daryl joins the Claimers before helping his friends to wipe them out. After being captured by the Reapers in \" Rendition \", Daryl joins and infiltrates the group before revealing his true allegiance in \" For Blood \" and helping to take them out in \"For Blood\" and \" No Other Way \". Daryl is the longest male living character of the TV Series, and the second longest living character behind Carol. Skybound published a 2014 April Fools Joke in which it was \"spoiled\" that Daryl would appear in Issue 129 of the Comic Series . Though Daryl is a fan favorite on the show, Kirkman confirmed that he has no interest in including him in the comics. [10] Daryl never appeared in the Comic Series . Daryl displays several stereotypes of a redneck . He possesses a southern American accent. His most consistent trait is his aggressive and hostile demeanor. He has shown to have a fondness for alcohol. He has shown to be a chain-smoker. Daryl may be a motorcycle enthusiast - this can be theorized through several hints throughout the series. He owns a personal motorcycle jacket He drove a 1976 Triumph Bonneville Hardtail Frame Conversion , which was originally owned by his older brother Merle. When questioned by Aaron , Daryl dryly remarks, \"I ride bikes\". Daryl appears to have a proficient knowledge of mechanical engineering where he has been seen repairing several broken vehicles to the point of being able to construct a fully working 1992 Honda CB 750 Nighthawk out of spare parts in a garage. In \" Still \", Beth guesses that Daryl was a motorcycle mechanic before the apocalypse, which is what Norman Reedus did before he became an actor. Daryl possesses several tattoos including one located on his left chest which says 'Norman' - (Reedus' own and father's name), a small devil located on his upper right arm, a red tattoo with the name \"Mingus\" (Norman's son's name), two individual demons located on his back and a skull on his right hand. On Talking Dead for \" Coda \", Robert Kirkman confirmed that Daryl is straight, if slightly asexual, as previous fan theories suggested that Daryl was gay and Kirkman himself had alluded to the possibility. Daryl had previously owned Beth's Browning Hunter Knife, which he kept as a memento of her, which was possibly taken by Dwight. Daryl has killed the fourth largest amount of living characters on the TV Universe with a total of at least 150 victims, Simon has the third largest with a total of at least 170, Negan has the second largest with a total of at least 235 and Rick has the largest with a total of at least 3,070 victims. Coincidentally, whenever the group comes into conflict with an antagonistic force, Daryl often finds himself with the antagonists in some way and is separated from Rick's group . When the Survivors began a conflict with the Governor, Daryl left with Merle. When the Survivors encountered The Claimers , Daryl was associated with them. Right after meeting Negan, Daryl is then held captive by the Saviors and shortly after meeting Alpha, he, Carol, Michonne, and Yumiko are then temporarily held captive by the Whisperers. When the Reapers attacked his group and killing several of their people, Daryl is captured by them and is forced to join them temporarily. Daryl is one of three original Atlanta camp members still alive out of 33 others. Rick and Carol are the other ones. Originally, Daryl was named Dwight in the scripts for Season 1. [11] The \"A\" on Daryl's sweatshirt while in Savior captivity stands for \"asshole\", as confirmed by Angela Kang . She also revealed Daryl was supposed to be in a factory jumpsuit, but they did not want it to look similar to the jumpsuits worn by the DHARMA Initiative in Lost . [11] Daryl bears a scar, similar of a black eye, on his right eye due to the fight with The Claimers in the Season 4 finale episode . In \" East \" Daryl lost his vest after getting shot by Dwight who took it from him and wore it. Thus Season 7 was the only season where Daryl wasn't seen wearing his vest. He would finally get it back from a wounded Dwight in \" How It's Gotta Be \". As of \" The Cell \" onwards, Daryl appears to no longer wear any kind of sleeveless shirt. The last time he did was in \" The Day Will Come When You Won't Be \". As of \" Stradivarius \", Daryl is missing the whole right wing off of his vest, first only missing half of his right wing in \" What Comes After \". In \" Omega \" Daryl told Lydia how some abusive fathers are, possibly referring how Daryl was abused in his past. This is more noticeable in \" Home \", when Merle rips off Daryl's shirt, revealing the scars on his back. Daryl has the most scars among any other characters in the series. In Season 9 , Daryl, like Michonne, bares an X shaped scar on his back. \" Scars \" reveals he was branded this scar by Linus , on Jocelyn 's orders. Interestingly Daryl already had a x scar back in \"Home\". In \" The Little Prince \" from Fear the Walking Dead , Dwight mentions Daryl to John about how he let him go because he knew of his love for Sherry and wanted to give him a chance to find her. Daryl is one of eight people to know ASL. The others being Carol Peletier , Gabriel Stokes , Connie , Kelly , Magna , Yumiko Okumura , and Luke Abrams . He is one of eleven known characters to have seen Beta's face. The other ten characters being Alpha , Lydia , Mary , Negan Smith , Beta's best friend , a Whisperer , Daniel , Grace , Dennis and Silas with the latter four being unknowingly. Daryl is a playable character in other media such as PlayerUnknown's Battlegrounds Mobile , Magic: The Gathering , Brawlhalla , Fortnite , and State of Survival . He is one of the nine main characters who did not originate from the Comic or Novel series, the others being Merle Dixon , Sasha Williams , Enid , Simon , Jerry , Alden , Anne , and Leah Shaw . In \" Rendition \", he confirms that he used to believe in God but lost his faith sometime during the apocalypse. Norman Reedus and Scott Gimple confirmed on Twitter that Daryl was originally in talks to get his arm cut off in Season 7 as a punishment for punching Negan. Ultimately, the writers did not follow through with the concept and instead the scene was changed to Negan psychologically torturing Rick by tricking him into thinking that he needed to cut off Carl 's arm instead. [12] [13] Daryl is one of fifteen characters in the TV universe to have dropped an uncensored f-bomb. The others are Nick Clark , Madison Clark , Hope Bennett , Rosita Espinosa , Jason Riley , Winokur , Alvarez , Joe , Evie , Sandra , Erika , Negan Smith , Juanita Sanchez , and Michael Mercer . He said it three times in Season 11 . Daryl is the only main character who has met all the other main characters. Because of the announcement of the Daryl Dixon series prior to the show ending, Daryl is one of three characters confirmed to survive the events of The Walking Dead , the other two being Maggie Rhee and Negan Smith. Daryl and Maggie are the only characters in the series, who killed at least one person from every major antagonistic groups ( Woodbury Army , The Saviors , The Scavengers , The Whisperers , The Reapers and Commonwealth Army ) As confirmed in \" Rest in Peace \", he is Blood O Negative which makes him a universal blood donor. As a child, Merle and him used to sell his blood for cash. Daryl is one of four main characters in Season 11 who appears in all eight episodes of part three. The others three are Judith Grimes , Negan Smith , and Ezekiel Sutton . Daryl, Rick Grimes , Morgan Jones , and Carol Peletier are the only confirmed survivors of the outbreak introduced in Season 1 to not die in the TV Series . Daryl, Rick Grimes and Carol Peletier are the only characters to appear in all eleven seasons. Daryl is one of the two TV Universe characters to appear in Daryl Dixon , the other being Carol Peletier . Growing up Daryl and his brother Merle watched an American sitcom called \"Mork and Mindy\" . It's implied in \" Paris Sera Toujours Paris \" that Daryl is a fan of The Doors . Daryl is mentioned by name by Dwight in the Fear the Walking Dead episode \" Sanctuary \". As revealed in Survival Instinct , the red bandana, which can be seen hanging out his back pocket throughtout the TV Series, was given to him by Anna Turner .",
        "External Wikis[]": "Daryl on the Brawlhalla Wiki Daryl on the Call of Duty Wiki Daryl on the Dragon City Wiki Daryl on the Fortnite Wiki Daryl on the Monster Legends Wiki Daryl on the State of Survival Wiki Hansk - Daryl's counterpart on the Magic: The Gathering Wiki",
        "References[]": ""
    }
]