[
    {
        "Overview[]": "Dawn is described as \"A formidable woman. She is stern, focused and intensely pragmatic, but has a tendency to crack under pressure and lash out violently. Though she presents a stoic façade, she has a softer side that she feels the need to suppress in order to be an effective leader. She is charismatic with a vibrant energy…\" As time progresses, it's revealed Dawn's real façade was her softer side. As seen on many occasions, she would use this persona with vulnerable individuals to make them believe she cared deeply for them, when in actuality this was a manipulation tactic for her own personal gain, most infamously used with her ward Beth Greene . Despite Dawn protecting her, her seemingly kind actions were not for Beth's personal welfare, but for her own benefit as her kind treatment towards her would direct her to feel inclined to side with Dawn in case of a debacle questioning her leadership became the topic of conversation among the hospital. An example of such an incident occurring was during a brawl between Dawn and one of her officers, with Beth pushing him down an elevator shaft in order to save the matriarch. As for her charisma and vibrant energy, it consisted of violence and a deeply overbearing nature. This is directly highlighted when a valuable patient was being lost, causing Dawn to smack Beth in the face in order to gain some measure of control, and perhaps the most obvious evidence was when she threatened action unless Rick 's group returned Noah to her. Dawn did this knowing that Noah would give himself up thus giving her power and control over the situation, further proving the manipulative nature of her character.",
        "Pre-Apocalypse[]": "Dawn was a police officer with the Atlanta Police Department . She worked closely with police sergeant Bob Lamson , as well their senior officer, Captain Hanson .",
        "Post-Apocalypse[]": "Dawn is first introduced when Beth Greene wakes up in Grady Memorial Hospital . Dawn tells her that Beth owes her officers for saving her. She is later seen whisking in Gavin Trevitt , who fell from a second floor window. After she learns that Trevitt is a doctor, she urges their current physician, Dr. Steven Edwards , to save his life, despite his protests. When Dr. Steven tries to explain to Dawn that the man can't be saved, Dawn slaps Beth to motivate him, re-opening her sutured cheek. She later forces Beth to help Dr. Steven amputate Joan 's arm after she was bitten trying to escape. Joan tries to resist, but Dawn refuses to let her die and cuts her arm off. Dawn brings Beth some food and Beth tells her she's not staying any longer than they make her. Dawn tries to sell her on staying at the hospital. She thinks that the world will return to normal and it's important to keep safety and order. \"Try to look at the good we're doing,\" she tells Beth. Beth eats the food but doesn't seem to change her decision to leave. When Gavin dies, Dawn demands to know what happened, Noah takes the blame, saying he accidentally unplugged the ventilator. Dawn tells an officer to take Noah to her office. When Beth tries to explain what happened to Dr. Edwards, he says, \"You gave him Clonazepam (a different drug, a sedative), right?\" Beth is confused and hears Noah being beaten in the other room. Later, Dawn comes to Beth's room. She knows that Noah didn't unplug the ventilator. She says she had to beat Noah. She proceeds to tell Beth that she isn't the greater good and hence isn't keeping her worth. \"The wards keep my officers happy. The happier my officers are the harder they work to keep us going.\" She is later seen patrolling the hospital and Beth tells her that Gorman and Joan are looking for her in her office. When she arrives, she is attacked by a zombified Joan and the officer with her is killed before she can kill Joan. She later puts both officers down before they can turn and meets with Beth after she is recaptured. Dawn calls Beth out for having Gorman killed but is shocked when Beth retaliates with the fact that Gorman tried to rape her and Dawn let it happen. She tries to justify her actions and tells Beth that she believes government forces will eventually rescue everyone, but Beth is not very convinced by this. Dawn looks at the floor and sees a shattered picture of her and Hanson before lashing out at Beth again. At the hospital, Dawn is dealing with her officer’s inability to find Noah while Beth mops the floor and listens. When the conversation turns to Carol Peletier , who was injured and brought in the day before, and the officer wants to let Carol die, Beth interrupts on Carol’s behalf. Her outburst prompts Dawn to back the officer against Beth by telling the officer to pull the plug on Carol. When the officer leaves, Dawn explains this, and that she can't help Carol. She gives Beth a key to the drug locker and tells her to save Carol. Dawn is shown exercising in the beginning while talking to Beth about the situation with her group. O'Donnell laters confronts Dawn and engages in a brutal fight with her for control of the hospital. Beth saves Dawn by pushing O'Donnell down the elevator shaft to his death. Dawn agrees to the exchange Rick Grimes proposes where she gives Beth back to the group, but she changes the terms and states she wants Noah back as well. Beth approaches Dawn and states she understands now, before stabbing her in the shoulder with a concealed pair of scissors; this results in Dawn accidentally firing her gun into Beth's head, killing her instantly. Horrified at what she has done, she attempts to plead that it was an accident, only to be shot in the head and killed by an enraged Daryl Dixon .",
        "Death[]": "Killed By Beth Greene (Caused) Herself (Indirectly Caused) Shortly after the trade between Rick's group and the Grady Memorial survivors, Dawn demands Noah to be returned to her. After Noah agrees to return, Beth runs up to him and hugs him, before turning to Dawn. Beth tells Dawn that she \"gets it now\", as she slips the scissors out from beneath her cast and stabs her vest in a futile attempt to prove her point. Dawn reflexively pulls out her gun and shoots Beth in the head, instantly killing her. Daryl Dixon Dawn, horrified by what she has done, begs for Rick's group to wait before doing anything, but Daryl vengefully approaches her and then shoots her in the head in cold blood.",
        "Killed Victims[]": "This list shows the victims Dawn has killed: Hanson Gavin Trevitt (Before Reanimation) Joan (Zombified) Gorman (Before Reanimation) Jeffries (Before Reanimation) O'Donnell (Caused) Beth Greene (Accidental) Herself (Indirectly Caused) Numerous counts of Grady Memorial Hospital patients (Alive, Caused, Before Reanimation, or Zombified) Numerous counts of zombies and unnamed people",
        "Appearances[]": "",
        "Trivia[]": "The casting call for this character used the name Vivian Bishop . Dawn was described as \"Mid to Late 30s. A formidable woman. She is stern, focused and intensely pragmatic, but has a tendency to crack under pressure and lash out violently. Though she presents a stoic façade, she has a softer side that she feels the need to suppress in order to be an effective leader. She is charismatic with vibrant energy.\" Christine Woods stated that Dawn was originally described as \"a judge who justified sacrificing for the greater good\". [1] Dawn is the first female character to be classified as a season's primary antagonist, with the second being Alpha and the third being Pamela Milton . Christine Woods does not view her as such, however, but more so as \"someone who is trying to keep it together and be a hero.\" Dawn's motivations are very similar to Shane of the comic series , as Dawn was determined to keep Grady Hospital together and organized so that they'll be the first rescued and the foundation of rebuilding society. Shane, despite the camp being dangerously close to the overrun city, was determined to have the group stay because he believed the government and military still existed and would rescue them first because they were already in the city limits. She is the first primary antagonist of a half season whose death did not involve Rick . This character was first introduced in the Comic Con 2014 trailer for Season 5, where Executive Producer Gale Anne Hurd confirmed the actress as Christine Woods. [2] It was confirmed on Talking Dead 's \"Inside the Dead\" segment that she suffers from Obsessive Compulsive Disorder. This makes her the second person known to have OCD in The Walking Dead universe, with Reese Hawthorne and Samora Sinclair being the other two. Presumably as a result of this, Dawn and the other officers in her group wear spotless police uniforms, which is supported based off of her conversation with Noah regarding her laundry. Dawn is one of seven non-main characters to cause the death of a main character by their own hand, the others being Caesar Martinez , Lilly Chambler , an unnamed Whisperer , Dante , Bossie , and Montanio .",
        "References[]": "",
        "Name": "Dawn Lerner"
    }
]