[
    {
        "Deanna Monroe": "",
        "Fate": "",
        "Contents": "",
        "Overview[]": "Deanna Monroe is known to be an extremely intelligent woman. Several times throughout her appearance, she picks up on small subtleties that other survivors give off about themselves and on what they are thinking. An example of this is when she realized that Rick Grimes had been telling her that letting his group in might not have been a good decision. Deanna claimed that she would have been a professional poker player if she ever lost her status as a congresswoman. Her political party, presumably, advocated for her because of her deep understanding of people, and she was re-elected as an Ohio congresswoman. Deanna also shrewdly came up with a way to force integration of Rick's group into her community: with a house party in their honor. In doing this, she had each of her people situate themselves in knowing Rick's people (except for Daryl Dixon and Abraham Ford , who did not socialize at the party and the former of whom did not even show up), become comfortable in the company of the strangers who would soon receive jobs in the community, and teach people that even people outside of their community could be good people. Deanna is capable of looking at a conflict from both sides. Although she herself claims to care for the safety of only her people, she is able to perceive how Rick's group would have seen them at first glance. She's also very optimistic, wise and ambitious. Deanna is very committed to her community. She barely let her son's death affect her rule of the safe zone, save for what exactly she spent her free time doing. However, Reg's death drove her into a depression that caused her to shirk her responsibilities to an extent, though she continued to lead the community as best as she could up until her death, with the help of Rick and Maggie . In her last moments she is shown to be bold and strong-willed. Years later, Deanna would be remembered as the founder of Alexandria and an inspiration to it's residents who would rebuild the community any time that it had fallen rather than allowing Alexandria to be permanently destroyed. Daryl tells Pamela Milton that he has enormous respect for Deanna and what she did, and that Rick's group had never met someone like her before who welcomed strangers into her community. Daryl admits that he admires Deanna greatly and that she had built something worth fighting for for them. Maggie later cites Deanna and Georgie as the people that she models her leadership of the Hilltop upon.",
        "Pre-Apocalypse[]": "Not much is known about Deanna's early life. In her adult life, she entered into a career of politics. She later married Reg Monroe , a professor of architecture, and had two sons, Spencer and Aiden . Around 2006-2008, Deanna eventually became a Representative for the 15th District of Ohio. She also spent time in philanthropy circles, many times working with Pamela Milton , whose father was the former President of the United States. In 2010, Deanna Monroe was running for re-election as Representative in the mid-terms. While she was expecting to win, she was also prepared to lose. In the event that she would lose, Deanna decided that she would retire from politics and become a professional poker player. Deanna prided herself at being able to read people. She attributed this to being a successful at politics and poker. However, as the mid-term elections grew closer, so did the spread of the Wildfire Virus - causing widespread panic.",
        "Post-Apocalypse[]": "In the early days of the global outbreak , Deanna Monroe and her family drove to Washington D.C. to gather information and resources on how to help provide for Ohio. As the outbreak occurred, Washington D.C. was overrun with the undead and looters. Martial law was enacted by the Army and only allowed politicians and select people to evacuate first. Deanna and her family tried driving back to Ohio so that she could help her district manage the crisis. While traveling on a backroad, the army stopped Deanna's family and directed them to a nearby residential development established as a safe zone built for politicians in Alexandria, Virginia. Deanna and her family arrived at the community of Alexandria. Also with them were Aaron and his husband, Eric Raleigh . The soldiers who directed them to the community were supposed to come back later, but they never returned due to Operation Cobalt . Deanna and the other survivors found supplies in the community and used them to survive. The community was designed to be self-sustaining; built with its own cistern, eco-based sewage filtration system, and electrical grid powered by solar panels. Deanna saw Alexandria as the start of sustainability. With the Woodlands Mall Construction Site nearby the community, Deanna and her family used the material sources from the construction site to fortify the community. At first, Deanna and her family only built one of the walls, but after a few weeks, more people came in; including Tobin , Bruce , and Francine . Together the newcomers helped to finish building the walls. Deanna's husband being a professor of architecture made her realize who people were before mattered in rebuilding the world, and thus assigned roles in the community based on previous occupations. Aaron and Eric, who once traversed West Africa to deliver supplies to those in need became the recruiters for Alexandria. Aaron and Eric eventually recruited a man named Davidson , who led a small group. He and his people did not work well in Alexandria, so Deanna had to make the decision to exile him and his people. She knew in her conscience that it was as good as killing them, but she argued it was needed to be done. However, she could not exile certain people. Pete Anderson , the community's surgeon, was physically abusing his wife, Jessie , and their sons Ron and Sam . Deanna encouraged him to end it, but was not able to stop the abuse due to the desperation of the community needing a doctor. Due to what happened with Davidson's people, Deanna had Aaron and Eric recruit lone survivors rather than large groups. As time went on, however, Deanna realized that most of her people had been behind the walls since the beginning and have not had a reason to go out and face the realities of the world that most survivors had faced. Admitting that they needed experienced people who could protect their community and teach them how to survive, Deanna allowed Aaron and Eric to recruit large groups once again. After this order, Aaron and Eric spotted a large group of survivors from Georgia led by a man named Rick Grimes . Deanna is first introduced as she interviews Rick Grimes over his experiences since the apocalypse. She goes on to interview Michonne Hawthorne , Glenn Rhee , Carol Peletier , Daryl Dixon , Rick's son Carl , and the rest of the survivors in Rick's group. She realizes Rick's group is good and they stick together and expresses she wants to be part of his family. By the first night she has given everyone a job but Rick, Michonne, Sasha Williams , and Daryl and stops by to see them all sleeping in one room. When her son Aiden and Glenn get into a confrontation by the town gates, she steps in and restores order while assigning Rick and Michonne jobs as police constables for Alexandria. Rick first talks to her about defending the walls with patrols and arming a few select people inside the walls, something Deanna believes to be unnecessary. When asked about the shifts people take in the clock tower, Deanna reveals that the town has no official lookout, which surprises and angers Rick. Sasha vehemently volunteers to be the first lookout on patrol and asks to have as many shifts as possible. Deanna notices this and refuses to let Sasha have a job like this so early, understanding Sasha's desire to shoot someone alive. Deanna tells them that she will host a house party for all residents for Alexandria to celebrate the induction of Rick's group (especially his infant daughter Judith ) into their community, and tells Rick that she will authorize the use of a lookout in the tower if his group attends. He accepts, and Deanna leaves to make preparations for their party. She is later seen introducing her husband, Reg Monroe , to Rick and Michonne. She being the leader of the community, much of her time is monopolized by requests from residents, and she is therefore left not to socialize with Rick and his group. The following day, Deanna personally oversees the departure of Sasha for a quick walk. Deanna is first seen with Reg, seeing off their son Aiden who is heading out on the supply run. Later Tobin , the concurrent head of the construction crew, comes to the house to make her elect Abraham Ford as head of the construction crew to replace him after his valiant actions earlier that day in the face of oncoming walkers. After he has gone, she is concerned about electing another of Rick's people into a position of power but Maggie Rhee , who is her assistant now, reassures her it'll be okay. Father Gabriel Stokes then comes to the house to warn her that Rick's group are bad people. Deanna is first seen playing back Aiden's run mix CD, depressed over the sudden death of her son. She later receives Carol's casserole and burns the note that was included. The next day she has a conversation with Rick regarding the domestically-abusive Pete Anderson , and she reveals that she only kept Pete in the Safe Zone due to his medical experience. She is called over by her husband when Pete and Rick are brawling in the streets. She repeatedly tries to break up the situation until Rick points a gun at her and the other Safe Zone residents. She stands listening to Rick's speech. Deanna first appears in the episode the day after the fight when she is talking with Maggie about what happened between Rick and Pete. She later says that a meeting will be held in the community that evening. Maggie tries to convince her that Rick did not mean any harm from what he did, but Deanna refuses to believe that, and tells Maggie that everything will be settled in the meeting later that night. At the meeting, Deanna notices that Rick is not in present, escalating her distrust of him and the group. Deanna reveals what Gabriel told her about Rick's group, which angers Maggie, who storms off. Deanna and the others then were shocked when Rick threw a dead walker in front of them and told Deanna that walkers got in because the gate was left open. Spencer notes that he asked Gabriel to secure the gate, and Deanna sends Spencer off to find Gabriel. Pete then appears with Michonne's katana. Reg tries to calm Pete down, only to be slashed across the throat. Deanna becomes hysterical, holding Reg and feeling helpless. Enraged, she says \"Rick, do it\". Rick, without hesitating, shoots Pete in the head. After Rick kills Pete, Gabriel arrives at the scene of the murder and finds Deanna, alone, sitting beside the pool of her husband's blood. She croaks, \"You were wrong.\" She is later seen after Rick argues with Gabriel about burying Pete's corpse within Alexandria. Deanna arrives and agrees with Rick, telling them to bury \"it\" out in the woods, to \"let the trees have him.\" Another day, after Rick explains the plan to the Alexandrians about moving the mega-herd out of a nearby quarry and away from the Safe Zone, Deanna agrees with Rick's proposition. Deanna and Maggie head outside the walls by the burned-down houses to begin preparing the land for farming. When people are heard screaming inside the Safe Zone, Deanna calls out to Richards , a look-out, to find out what's going on before a Molotov cocktail strikes him, setting him aflame and bringing him down off the wall. Deanna and Maggie, who has drawn her gun, head over to investigate. When Maggie and Deanna try to get inside they find Spencer. Maggie says they need to go inside and help, but Deanna acknowledges that she cannot use a gun and would only be another person to protect, and so Maggie heads in by herself while Spencer stays outside to protect his mother. After the skirmish, Deanna finds Richards' charred, reanimated corpse. She watches Maggie put it out of its misery. Deanna is first seen in the beginning of the episode, where she is shown climbing up a ladder onto the walls. She absorbs the aftermath of the Wolf attack, and seems distant. When Rick arrives, it is obvious that the sheer amount of walkers behind him shocks her. She is also present for Rick's impromptu meeting, and for Aaron's confession to the Alexandrians. She leaves the meeting in a daze, obviously still struggling to cope with everything. When Spencer steps up and stops the Alexandrians from taking surplus food items from the pantry, Deanna appears to be proud of his actions. Later, at her home, Deanna is phased by Reg's wedding ring, but snaps out of it. She then proceeds to take out a map of Alexandria, which she marks up with her various plans for expansion. She marks spaces for farm plots, future areas of development, and various other things. This seems to indicate that Deanna hasn't given up hope quite yet. However, the next scene shows her finding Spencer drunk in the kitchen, with stolen alcohol and food. She berates him for his hypocritical actions, but he simply remarks that he only wanted to prevent the chaos what could result from the Alexandrians acting solely on their own behalf's. He then proceeds drunkenly to blame her for the deaths of her husband and son. That night, she returns the stolen items, only to discover a reanimated Wolf . She drops the crate of food that she was carrying, and uses a broken bottle to stab it multiple times. Rick intervenes and stabs it in the head before anything else can occur and comments that Carol had shot a Wolf whose body she couldn't find, speculating that the Wolf had crawled under a nearby house where he'd eventually died and then reanimated. Covered in walker blood, Deanna states that she wants Alexandria to stay standing, and asks Rick if that's unrealistic. Rick acknowledges this by saying that it isn't unrealistic for Alexandria to remain standing. Deanna, with regained confidence, walks up to the gates. She watches the walkers at the gate, who are banging at the fence. She responds by banging on the fence herself, an obvious act of resistance. She leaves, and observes blood leaking through a part of the walls. Deanna first appears where she thanks Rick for saving Spencer, where Rick says that she should be thanking Tara instead of him, but she says that she already did. Rick then tells her that he could have jumped off the wall, got into one of the cars at the quarry and let the walkers corner Spencer, which would have resulted in his death, which Deanna remarks that he didn't and asks him why he didn't do so. When Rick tells her that the reason he didn't do so was because Spencer is her son, where she then tells him that he gave the wrong answer. Later, along with most of the residents of Alexandria, she witnesses in horror as one of the watchtower leans, falls and eventually destroys a part of the wall, letting the herd outside in to Alexandria. Deanna appears by helping Rick shoot at the herd that are now entering Alexandria through a part of the wall that was destroyed by the watchtower that had fallen. She and Rick runs from and fight the walkers that begin to come up on them. When a walker is about to attack Rick, Deanna pulls it away and struggles against it and later a second walker comes up on her, causing her to fall onto a sharp gear, injuring her thigh. Rick is able to dispatch both of the walkers and helps Deanna up, although injured. She and Rick are later joined by Michonne, Carl, Ron and Gabriel, as they flee from the herd that are coming after them, however, they are later cornered by some of the herd ahead of the road, where she and Rick shoot at the walkers who are getting close. Eventually, Jessie shoots at the walkers coming for them and lets them in at her house to hide in. She is then put on one of the couches upstairs, where Michonne tends to her injury. When Rick asks her afterwards if she is okay, Michonne finds a bite mark on her side. Later on, now becoming weak from the bite mark she had received, she talks to Michonne about their current situation and about Alexandria. Michonne says that she believes in Alexandria and that they can get through on what they are currently in and her plan of expanding the community. She then asks Michonne if there's something that she wants for herself, whom replies by admitting that she doesn't know. Deanna then makes her way to the room Judith is in and, after being confronted by Rick who almost kills her after assuming that she had turned, she says that she wants to see her one last time. She then admits that she tried to go to the room herself, but her weakened state made it hard for her to do so easily. Rick then gently carries and puts her on the bed nearby where she gives him farewell notes to both Spencer and Maggie. She then asks Rick to look after Spencer for her, as he would with his own people, stating that the people of Alexandria are now Rick's people. When the herd manages to break through the makeshift defenses Rick and the others had made downstairs, Michonne comes to Deanna's side and offers to kill her, saying that they're leaving, before she turns, however, Deanna insists that she will kill herself when the time comes, referring to when she and the others leave and when the herd reaches her upstairs. After Rick and the others leave, blending into the herd, she is about to kill herself when she hears the herd moving around outside and decides to open the door and open fire at them, killing a few of the walkers coming after her, before letting out one last scream of defiance against the herd. Although not seen on-screen, Spencer spotted the reanimated Deanna during the final battle with the herd . Despite the slaughter, she was somehow able to escape the town and into the nearby woods. For the weeks following the final battle with the herd , Spencer combed the nearby forest in search of his zombified mother, convinced that he had seen her during the battle. About two months after the survivors reclaim the safe zone for themselves, Carl and Enid encounter Deanna in the woods. Carl, knowing that Spencer is out there and having deduced that he is searching for her, leads the walker to her living son. Spencer, with the help of Michonne, who had followed him into the woods that day, puts down his mother and buries her under a tree. Michonne etches a \"D\" into the tree above the grave before the two head back to town. Deanna appears briefly in a flashback when Rick reflects on memories with all of his friends while panicking over the possibility that his other friends could be killed by the Saviors . While visiting Alexandria , Pamela Milton looks at a picture of Deanna and Reg and reveals to Daryl that she had known Deanna, much to Daryl's surprise. Pamela explains that before the outbreak, she and Deanna had crossed paths quite a bit in philanthropy circles and although Pamela wasn't interested in politics at the time, Deanna was born to run things. Daryl tells Pamela that Deanna had brought Rick's group in and that they'd never met anyone like that before. Daryl admits that he admires Deanna greatly and that she had built something worth fighting for for them. Although Alexandria has fallen several times, they've always brought it right back. As a breach in the weakened wall lets in a walker, Pamela asks Aaron about Deanna's death. Aaron explains that Deanna was bitten and he admits that she turned and they had to put Deanna down. Maggie later tells Pamela that she leads the Hilltop the way that Deanna and Georgie had taught her to, and the Hilltop is fair, which is not how she sees the Commonwealth .",
        "Death[]": "Killed By Zombies (Alive) When the herd gets into Alexandria, Deanna is bitten on her side. Later, Deanna is about to kill herself when she hears walkers outside the hallway, so she decides to open the door and kill some of them while letting out one last defiant yell, before eventually succumbing to the infection. Michonne Hawthorne (Caused, Zombified) Spencer Monroe (Zombified) About two months after the herd's assault on Alexandria, a zombified Deanna is spotted wandering the woods outside of the town. After finding her, Michonne restrains her while Spencer unsheathes his knife and tearfully stabs her in the back of the head, putting her down.",
        "Killed Victims[]": "This list shows the victims Deanna has killed: Pete Anderson (Caused) 1 unnamed Wolf (Caused, Zombified) At least 7 zombies",
        "Relationships[]": "For a more in-depth look at Deanna's relationships, read here: Deanna Monroe (TV Series)/Relationships",
        "Appearances[]": "",
        "Gallery[]": "For more images of Deanna Monroe, please visit Deanna Monroe (TV Series)/Gallery .",
        "Trivia[]": "The casting call for this character used the name Donna . Deanna was described as \"A formidable, respected and influential journalist with integrity, strength and occasionally wise-ass humor. She's a leader, a mother and someone who reads people very well.\" Tovah Feldshuh used Hillary Clinton as an inspiration to portray Deanna. Deanna is the second politician that was encountered in the TV Series . The first being Aaron , who was a former politician but left the circuit before he became an actual official politician, due to him believing his best assets can be better used in a hands-on approach, prompting him to join a non-government organization. The third politician is Pamela Milton . Dante Esquivel from Fear the Walking Dead is also a politician, being the Municipal President of Tijuana. Qaletaqa Walker can also count as someone who is in politics as being the Chief of the Hopi Tribe. Deanna is one of five main characters in the TV Series to be recognized with a relative \"celebrity\" status prior to the apocalypse (as an Ohio Congresswoman). The other four are Tyreese Williams who was a former NFL linebacker, Connie who was a journalist and was known to have uncovered a huge corruption scandal, \" Beta \" who was formerly a musician, and Pamela Milton who was an influential politician. Despite being in Fear the Walking Dead , Dante Esquivel, Jim Brauer , Mickey and her husband Cliff also have the \"celebrity\" status. Deanna is the third series regular to die while being credited under \"Also Starring\", the first being Gareth , the second being Bob Stookey , the fourth being Jessie Anderson , the fifth being Spencer Monroe , the sixth being Simon , the seventh being Gregory , the eighth being Siddiq , and the ninth being Leah Shaw . Deanna is the first main character from Alexandria to die. She is also the first member of the Monroe family to die during a mid-season finale, the second being one of her two sons, Spencer . Deanna is the fourth main character to die in a mid-season finale, the first being Hershel , the second being Philip Blake , the third being Beth . the fifth being her son Spencer and the sixth being Jesus . Deanna is the fourth character to have a death in a mid-season finale. First being Sophia , the second being Hershel and the third being Beth. Her death is then followed by Spencer, Olivia , Natania and Jesus. Deanna is the first female main character in the series to be directly killed by walkers , and also the first to reanimate. Deanna represented Ohio's 15th Congressional District. The real-life district lies primarily to the Southeast of the City of Columbus, Ohio. Deanna is the first female main character to become a walker, the second being Sasha . In a deleted scene for \" Honor \", serving as a callback to Deanna, Michonne can be seen picking up a piece of paper while scavenging in the ruins of Alexandria. The paper is the plans for Alexandria's expansion drawn up by Deanna in Season 6 . It is unclear how Deanna found her way out of Alexandria after she reanimated, nor why it took several weeks for someone to discover her on the outskirts of Alexandria. Deanna is the fourth main character to become a walker, the first being Shane Walsh , the second being Merle Dixon , the third being Hershel Greene , the fifth being Spencer Monroe , the sixth being Sasha Williams , the seventh being Simon , the eighth being Enid , the ninth being Tara Chambler , the tenth being Siddiq , the eleventh being Alpha , the twelfth being Alden , and the thirteenth being Lance Hornsby . Deanna is the fifth main character to be bitten by a walker, the first being Hershel Greene , the second being Andrea Harrison , the third being Bob Stookey , the fourth being Tyreese Williams , the sixth being Carl Grimes , and the seventh being Rosita Espinosa . Deanna is the only named character to be killed by Spencer Monroe in the TV Series , albeit zombified. Deanna appears in the final flashbacks of the last episode \" Rest in Peace \"."
    }
]