[
    {
        "Dean": "Dean",
        "Overview[]": "Dean is a sly, cunning, and guileful individual. He is shown to be deceptive and a good liar as he initially puts on the façade of a helpless worker to the point of peeing himself. He comes up with a convincing story that he is a worker and has a family. However this is revealed to be a ruse. Jesus attempts to spare his life which Dean takes advantage of. Dean is shown to be heartless and cruel, intentionally stomping pills for Maggie 's pregnancy out of pure spite. After Jesus overpowers him, Dean shows little fear and firmly believes that Jesus will not kill him, which he is correct about. Ultimately however, Dean's action do not go unpunished as he is later killed by Maggie since he tried to kill Jesus.",
        "Pre-Apocalypse[]": "Nothing is known about Dean's life prior to or as the outbreak began. He claimed to have had a wife and children, although it is likely that he was lying.",
        "Post-Apocalypse[]": "At some point in the apocalypse, Dean somehow came into contact with a group named \"the Saviors\" which he subsequently joined. Dean aided his group in terrorizing other survivors and communities around the area into subjugating to Negan's will, where their victims would be forced to give half their supplies in exchange for not being murdered. During the militia assault on the Satellite Outpost , Dean hides in a closet and pees his pants to convince his enemies he isn't a threat to them. When Jesus and Tara find him, Tara is determined to kill him, though Dean claims he is a worker and has a family, which convinces Jesus to stop her from shooting him. However, Dean attacks and is able to hold a gun to Jesus' head. He purposely stomps on pills that Maggie needs for her pregnancy and Dean threatens that Maggie and her unborn child will die, along with Tara and Jesus. Eventually, Jesus is able to overpower him and instead of killing him, he knocks him out and ties him up, much to Tara's anger. An unconscious Dean is tied up and placed in the back of the pick-up truck with the bodies of Freddie and Andy as the Hilltoppers and Kingdommers make their way to the Hilltop Colony with a large group of captured Saviors. Dean is among the captured Saviors sitting outside the Hilltop as their fates are discussed by Maggie and the others. Ultimately, Dean is allowed to stay at the Hilltop in a makeshift prison that was built when Maggie chose to side with Jesus over Gregory . However, he and the others are only being kept alive as bargaining chips and will be killed if there are no prisoners to be released by the Saviors. After Simon kills Neil while Maggie was leading a convoy back to Hilltop, Maggie decides to kill one of the captured Saviors in retaliation. Upon returning to Hilltop and identifying Dean as the one who attacked Jesus back at the outpost, she pulls Dean out of the cell. Despite Alden trying to defuse the situation, Dean tells him to shut up, stating if Maggie wants to \"put on a show\" they should let her. He is then abruptly shot in the cheek by Maggie, killing him instantly. The coffin containing Dean, who had reanimated while being transported to the Sanctuary, is delivered to Negan's conference room by Gary . He announces that the coffin is back from the Hilltop. Negan orders Simon to open the nailed-shut coffin and proceeds to put a zombified Dean down with a nail gun . Recognizing Dean as one of his men from the satellite outpost , Simon is left furious by his death and the message that came with him; stating that Hilltop has 38 more Saviors captive.",
        "Death[]": "Killed By Simon (Indirectly Caused) Maggie Rhee (Alive) In retaliation for Simon killing Neil, Maggie executes Dean in order to deliver a \"message\" to Negan. Negan Smith (Zombified) The coffin carrying a zombified Dean inside is brought before Negan. After everyone but Simon leaves, Negan puts Dean down with several shots from a nail gun to the head.",
        "Killed Victims[]": "This list shows the victims Dean has killed: Possibly numerous counts of zombies and unnamed people",
        "Quotes[]": "The following is a list of some of Dean's most memorable quotes.",
        "Appearances[]": "",
        "Trivia[]": "",
        "Name": "Dean"
    }
]