[
    {
        "Derek": "Derek",
        "Overview[]": "Derek is a rough, aggressive, and crude man. He is shown to be a loyal Savior and has no mercy towards his enemies. Even to his own allies, he often speaks to them in a really hostile and aggressive manner when they mess up, such as berating a Savior for shooting Dr. Harlan Carson . He later takes part in the Savior's attack on the Hilltop and is relentless in the fight. He manages to cut Tobin though he is quickly killed after. Despite his death, the damage is already done and Tobin ends up turning due to Derek's weapon being tainted with walker blood, causing the deaths of many residents.",
        "Pre-Apocalypse[]": "Nothing is known about Derek's life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "At some point in the apocalypse, Derek somehow came into contact with a group named \"the Saviors\" which he subsequently joined. Derek aided his group in terrorizing other survivors and communities around the area into subjugating to Negan's will, where their victims would be forced to give half their supplies in exchange for not being murdered. While searching for the missing Alexandrians, Derek and his fellow Saviors get a call on the radio that Gabriel and Dr. Carson have gone missing from the Sanctuary along with Jeremy 's green Jaguar. They quickly get in their truck and drive away in search of the two missing prisoners. Later that day, the group finds the escapees in a garage and takes them into custody as Derek berates a fellow Savior for shooting Dr. Carson. When they arrive at the bullet factory outpost , Derek and Mel drop off Gabriel at the outpost as Eugene's newest worker. Derek is among the Saviors to attack the Hilltop and slashes Tobin across the chest. Before he can kill Tobin, Derek is shot and killed by Carol .",
        "Death[]": "Killed By Carol Peletier During the Saviors' attack on the Hilltop, Derek attacks Tobin with his tainted knife, seriously wounding him. Before he can kill him, Derek is shot by Carol.",
        "Killed Victims[]": "This list shows the victims Derek has killed: Tobin (Caused, Alive) Kurt (Caused, Alive) Dana (Caused, Alive) Possibly numerous counts of zombies and unnamed people",
        "Appearances[]": "\" Dead or Alive Or \" \" Do Not Send Us Astray \"",
        "Trivia[]": "",
        "Name": "Derek"
    }
]