[
    {
        "Overview[]": "Dianne is a stoic woman of few words, choosing when to chime in and voice her opinion. She is also one of action, preferring not to stand by while things go on around her, always willing to fight with her allies. She is shown to have a sarcastic sense of humor and is very loyal to the communities she lives in, proving to be a valuable asset in any kind of confrontation.",
        "Pre-Apocalypse[]": "Nothing is known about Dianne's life prior to or as the outbreak began, except that she had a sister.",
        "Post-Apocalypse[]": "At some point in the apocalypse, Dianne joined a community called the Kingdom where she became one of Ezekiel 's closest soldiers. Dianne was present at the time of the arrival of a notorious group of survivors named the Saviors who operated on behalf of Negan . Upon meeting, the Saviors demanded a portion of supplies in exchange for leaving the community unscathed, to which Ezekiel complied under the condition that the Saviors would never step foot inside the Kingdom. Throughout the following months, Dianne aided her group in gathering supplies in order to compensate the Saviors demands and thus she took part in several conducted weekly trades between the two groups, which she alongside Ezekiel, and several others kept secretly hidden from the rest of the community. Dianne attends the feral pig hunt with Ezekiel , Morgan , Benjamin , Richard , Alvaro , and Jerry . After the pigs are herded into a garage, she shuts the door in order to trap the pigs inside and is then tasked with retrieving the truck to load up the pigs. After the pigs are loaded up in the truck, she returns to the Kingdom with the others. Dianne later attends the exchange with the Saviors and begins to explain to Morgan who the men are until he interrupts, stating he knows about the Saviors. She raises her weapon after Jared attacks Richard, but the situation is diffused by Ezekiel. Dianne is at the Saviors exchange with Ezekiel and the rest of his court, waiting for Gavin and his band of men to arrive. When a walker stumbles into the vicinity, she comments that it's wearing the same dress her sister has and then puts it down with an arrow. After the heated exchange with the Saviors, she comments again on the walker and the dress before heading back to the Kingdom. Dianne later goes along with Ezekiel and the other Kingdommers at Carol's house to deliver a casserole. Dianne picks cantaloupes from the Kingdom garden and loads them into a wheelbarrow for the Saviors' supply drop. Later that day, she drives the truck to the exchange spot when she is forced to stop due to the road being blocked by a row of shopping carts. She searches the area with the others when they come across the empty grave and then helps to clear the carts so they can continue on their way. When Gavin tells them to hand over their weapons, Dianne raises her gun. She then watches in horror as Benjamin is shot in the leg by Jared . She helps load him on to the truck and drives to Carol's house. The next day, Dianne accompanies Ezekiel and the other Kingdom residents as they load another cantaloupe onto the truck. She watches helplessly as Morgan strangles Richard to death. She and the others then leave at Morgan's request. Dianne follows Ezekiel as he leads a regiment from the Kingdom toward Alexandria . Later that day, she and the rest of the Kingdom residents arrive just as Negan is about to execute Carl and begin to kill the Saviors. She works alongside Ezekiel throughout the battle. After the Saviors and Scavengers retreat from Alexandria, Dianne walks alongside Carl and Enid as everyone is looking for Sasha as a walker. She is then present for Rick, Maggie and Ezekiel's speech to the communities, all united and ready for war. Dianne is among the militia to listen to the leaders' speeches before they launch their assault on the Sanctuary . As the other prepares for the upcoming assault, she calms down Andy 's nerves about fighting alongside so many strangers, stating that she will look out after him. After successfully ambushing the Saviors' headquarters, she and the others leave in their vehicles so the incoming horde may swarm the factory. Dianne is later part of a small group of soldiers from the militia, which includes Tara , Jesus , and Morgan that stands outside the fence of the satellite station outpost they previously cleared out. It has since been re-settled by Saviors. Morgan asks Dianne if she’ll be able to hit the guards through the fence using her arrows. She expresses doubt. Dianne is among the Militia to sneak into the satellite outpost that has been re-occupied by the Saviors in order to take it over. When Morgan creates a gap, distracting the two Saviors, Dianne silently takes out the guards with her bow. She then gets into position as the Hilltoppers prepare to assault the unsuspecting Saviors. Inside, she and Oscar are with a group of Hilltoppers pinned in a hallway as Saviors shoot from a distance. Oscar comments that they've lost touch with one of the groups. He is unable to answer Tara when she asks about Morgan. After a lengthy gunfight, Dianne and her allies are able to gain the upper hand as the Saviors call a retreat. Before Alden , Jared , and the other Saviors can flee, they are captured by Dianne and the rest of the militia. Dianne is among the Hilltop and Kingdom forces escorting the captured and shackled Saviors along a road at by an armed guard. As the militia gets ambushed by walkers, she helps defend their prisoners, and watches as Morgan chases after Jared and his chain gang into the woods. Dianne later arrives after Morgan and Jesus have their fight about the Saviors' fate. Morgan leaves the group while Dianne and the others proceed to return to Hilltop. Dianne is among the Kingdommers and Hilltoppers to watch over the captured Saviors at the Hilltop. She helps move the Saviors inside the walls and into the makeshift prison that was built to hold the prisoners, and then locks them up. Dianne is in the car with Jesus, Maggie, and Neil on their way to the Kingdom when they are stopped by Simon and the Saviors. Despite Simon's threats to kill Jerry, Simon tells Gary to lower his gun and proceeds to shoot Neil in the head, killing him instantly, much to Dianne's horror. She then returns back to Hilltop with the convoy. Dianne completes an inventory of the Hilltop's rations with Bertie and informs Maggie that they'll get by if they reduce the rations by a third for the week, but adds that it will be worse if they account for the captured Saviors. Later, Dianne, along with Jerry, Scott, and Oscar, accompanies Maggie to the makeshift prison and listens on as Maggie declares the Saviors will be let out for a few minutes a day in pairs and under the close watch of the guards. Dianne and the other Hilltoppers bring the Savior prisoners out onto the balcony as Maggie addresses Simon on the radio. After the Saviors open fire, she helps usher everyone inside the Barrington House. She survives the attack on the Hilltop and the subsequent outbreak that leaves several more dead. She escorts Alden to Maggie at the graveyard after the first attack and later confides in Maggie that she believes in her and that she is a good leader. After the second attack, Dianne is part of a group consisting of Maggie, Jesus, Oscar, Eduardo, and Kal doing a sweep of the Hilltop grounds when they find Alden and Siddiq. Alden alerts the group that several Saviors defected and are trying to close the gates to protect the community from incoming walkers. Dianne and the others then go to assist the Saviors in barricading the gates. The next morning, Dianne is at the graveyard alongside Rick, Michonne, Jerry, Jesus, and Maggie paying her respects to those who were killed in the double attack. Dianne talks with the others and updates Maggie on the situation. She says that they might not have enough bullets to fend off the Saviors if they come back. Daryl points out that the Saviors might have to go hand to hand if the walker guts were their only option while Rosita points out that they have their bullet maker. That night, Dianne sits at a campfire with Alden as a bloody Rick makes his return back to the Hilltop. Dianne accompanies Rick and the rest of the militia to fight the Saviors in the final battle. After most of the Saviors are wiped out due to Eugene's faulty bullets, Dianne and the others fight the surviving Saviors until they surrender. She watches on as Negan is defeated and captured while Rick addresses the crowd, declaring peace among all communities. Afterwards, Dianne returns home to the Kingdom. Having moved from the Kingdom to the work camp along with several other residents, Dianne is part of the team of laborers working to build a bridge connecting the communities' trade routes. When a group of walkers suddenly ambushed the lumber yard, Dianne is among those to arrive in time to save Daryl , Jed , another Savior, and the injured Aaron . At night, Dianne plays cards with Eugene, Tara, and Rosita around the campfire. When the work camp is informed of Justin 's death, Dianne watches as the Saviors become furious and she draws her gun along with the crowd as they start accusing Daryl and Anne of being the culprits. Before a conflict can ensure between the different sides, Rick rides in the middle of the group with his gun drawn and warns everyone to back off. When Maggie decides to travel to Alexandria to confront Negan, Dianne accompanies her and, along the way, they pass by a pile of decapitated walkers lying on the road. Dianne watches as Maggie stops her horse along the way so she can kill a walker furiously, bashing its head with a crowbar. Shortly after arriving at Alexandria, she informs Maggie and Michonne about the shooting at the camp. Later that day, Dianne and members of the communities arrive nearby the nearly constructed bridge as Rick tries to lead a herd away from the other side. While everyone sprints towards to help him, Rick shoots at a box of dynamite and the bridge ignites and explodes as Dianne and the rest can only watch in horror, assuming Rick to be dead. Six years after Rick's assumed death, Dianne moves to Hilltop and becomes a guard, while also overseeing the training of new recruits. The next day, as the rescue mission gets ready to go look for Eugene, she helps Jesus gear up. When Michonne and Siddiq arrive at Hilltop with a group of newcomers , Dianne makes them all surrender their weapons before entering. Later that day, Dianne asks Carol if she can ride back with her to the Kingdom, explaining that she can help over there, and she agrees. They then ride away from the community. Dianne goes to Ezekiel and catches him up on plans to head out to hunt deers. Having completed their main mission, she heads out with a group of soldiers to the abandoned movie theater to retrieve a projector bulb for the fair. While a group distracts the walkers inside the theater, Dianne accompanies Jerry as he gingerly retrieves the bulbs. Suddenly, some walkers attack them, causing him to drop the bulb into the walker infested room. Upon informing Ezekiel about it, Carol steps in and sets up a plan to retrieve it. They take out the walkers, grab the bulb and finally head out. During a supply mission, Dianne and Jerry are confronted and robbed on the road by a group called \"The Highwaymen,\" who gave them a note warning anyone traveling to the fair will be turned back unless they are paid a toll and demands. Upon informing Carol and Ezekiel, Dianne guesses it could be Jed’s group of Saviors, but Carol politely rules that out. Ezekiel eventually decides to confront the bandits. When the Kingdommers confront the Highwaymen later that day, Dianne points her arrow at Ozzy but feels relieved when the opposites groups come to an agreement after Carol offers them a movie in exchange for protecting the roads to the fair. After returning to the Kingdom, Dianne helps the Hilltoppers unpack their supplies for the fair. Dianne watches from the crowd as Ezekiel declares they’ve finally accomplished Rick, Carl, and Jesus' dreams of reuniting the communities. “Let the fair of a new beginning begin!” Ezekiel says as everyone celebrates and applauds. Later that day, Dianne and a group prepare to leave the Kingdom to go to Hilltop and leave some soldiers in case of a possible attack. She then fist bumps Tara goodbye. In the woods, Dianne and the rest encounter Ozzy, Alek, and D.J. and find one of Hilltop's carts overturned. The group decides to split up, with Dianne going to the Hilltop. The next day, Dianne listens from the crowd as Siddiq delivers the tragic news about the fate of the missing fair attendees, tells them how brave the victims were in their final moments and how he was intentionally kept alive to tell this very story. He encourages everyone to remember the fallen as brave heroes and to honor them. Several months after the fair massacre, the Kingdommers are forced to abandon their fallen community due to an incoming blizzard and move to the Hilltop. When snow starts falling later that day, Dianne and the convoy is forced to take shelter inside the Sanctuary for the night where she helps the residents rest and stay warm. Later that night, the convoy leaves the factory and is forced to cross into Alpha's territory. When they encounter a frozen lake, Dianne and members of the group kill walkers that emerge from the snowbanks before the whole convoy manages to escape safely across the ice. The next morning, Dianne and the convoy finally arrive at the Hilltop. Some months after the blizzard, Dianne is among the coalition members drafted into the militia that was formed in response to the Whisperer threat. She and the other militia conduct a training exercise on the Oceanside beach. As Ezekiel and Jerry methodically release walkers from a shipwrecked boat, Dianne and the other militia work together as a unit to take out the walker threat. They are successful and return to Oceanside to rest, eat, and socialize with the Oceansiders. That night, Dianne helps put out the fire that was ignited in the woods in Whisperer territory after a satellite from outer space crashes. Dianne is alerted to the commotion of a tree falling onto a house and a portion of Hilltop's walls. She then helps the other residents rescue the trapped injured from the rubble. The next day, Dianne and the other residents kill the incoming walkers with the help of the Alexandria convoy when the herd invades the community that night. The following morning, Dianne attends the council meeting where Michonne announces she will be delivering supplies to Oceanside after receiving reports of potential Whisperer activity. Later that day, Dianne and a group prepare their convoy and head out on their journey towards Oceanside. Dianne and the group continue their journey towards Oceanside when they stop briefly after Scott comes across recent footprints on their path. When Luke convinces Michonne to stop at a library along the way, Dianne and Marco stay outside as lookouts as the rest of the group heads inside. Later that day, the group arrives at Oceanside where Dianne witnesses as the residents bring a captured man to the camp and accuse him of being a Whisperer. When walkers suddenly invade, she helps take out the threat and secure the community. The next day, Dianne bids farewell to Michonne after she explains her plan to bring back weapons in exchange for helping Virgil get back home. She and the rest of the group then travel back to their communities. Dianne joins the discussion about what should be done with the Whisperers. Lydia thinks they should run, explaining that even if the explosion at the cave took out half the horde, Alpha would still have thousands of walkers left. Earl thinks the Whisperers might bypass them and go for Alexandria first, but Lydia negates this. Jerry wishes to stay and fight instead, while Dianne agrees with Lydia, believing that they can rebuild in another location. Earl is skeptical, however, and reckons that they will never find a place as good as Hilltop. While Yumiko points out they're heavily outnumbered, Earl insists that fighting is the best course of action, and even if they die, they will die for a place that means something. Aaron points out that there are children at Hilltop, too. Daryl agrees that they should get the kids out first, and instructs the others to pack up and regroup at Oceanside. The caravan doesn't make it far before they hit a roadblock and discover Felix and Penny (the scouts they sent earlier) dead. Daryl identifies this as one of Negan's tactics and concludes that all the other roads will be blocked, too, making a retreat impossible. The caravan returns to the Hilltop, with Daryl informing the others of the situation. Luke suggests calling Alexandria for reinforcements, but Dianne thinks that neither Alexandria nor Oceanside can get to them in time. Earl is confident that Hilltop is prepared, and tries to rally everyone for the upcoming conflict. Dianne is seen gathered on the front lines, Kelly confirms that the horde is close. Indeed, the horde soon emerges from the bushes and approaches the Hilltop. While they are momentarily halted by the electric fence, the walkers soon break through it and approach the second line of defense. Aaron orders the survivors to split ranks. The shield-wielding survivors reinforce the makeshift barbed wire fence, while the melee weapon-wielding survivors start taking out the walkers. The archers, meanwhile, stay in the back and rain arrows on the herd. With no choice, the defenders begin to retreat towards the Hilltop, but are trapped when the Whisperers launch another volley of fire-arrows into the Hilltop's walls, setting the community ablaze. Dianne is among a group of survivors consisting of Rosita, Daryl, Jerry, Nabila, Mariam, two Hilltop women, and two Alexandrian soldiers trudging through the wilderness as they attempt to reach the rendezvous point to find Ezekiel, Earl, and the children, including Jerry and Nabila’s kids. Dianne meets up with the others at the rendezvous point. She and the other Hilltop survivors welcome Magna back and later listens to Eugene as he explains that he has been talking to a woman over the radio and plans to meet her as he believes she can help them. Dianne is among the Hilltoppers to relocate to the abandoned hospital being referred to as the \" Tower \". She keeps a close watch for incoming Whisperers. Dianne is among the militia scrambling to prepare for the incoming Whisperer herd when she bumps into Father Gabriel, knocking the weapons she was carrying out of her arms. She helps Father Gabriel to his feet before moving on. Later, she is in the makeshift armory with Bertie when Carol walks in. After Bertie gives Carol a dirty look and leaves, Dianne gently confronts Carol about Negan and his role with the Whisperers when she is dismissed by Carol, to which she returns her focus to preparing for battle. When the time comes, Dianne is among the archers stationed at the windows to help shoot Whisperers going after the group of survivors with the music wagon equipment. After the Whisperers breach the hospital, she helps Gabriel, Scott, and Rachel defend until it is time to evacuate, in which she is able to escape via the elevator shaft. She is among the survivors to escape the hospital in time and make it to the rendezvous point in the woods, where she helps tend to the wounded survivors. Following the conclusion of the Whisperer War, Dianne is among the Hilltop refugees to move to Alexandria. Dianne is among the Alexandrians seeking refuge from the storm inside Aaron's house. She and her neighbors help secure the windows and keep the children calm as the storm rages. When a zombie nearly breaks in, the Alexandrians realize there is a breach in the wall, in addition to the windmill catching fire. She attends a meeting in the kitchen where the survivors decide a group needs to go out into the storm to put out the fire and secure the wall. Dianne stays behind to help defend the house, alongside Rosita, Barbara, Lydia, Nabila, and Virgil. She helps Lydia keep the front door shut as the number of undead grows outside. She watches in horror as Rosita departs into the storm to dispatch the zombies. Fortunately Rosita survived the ordeal and returned into the house unharmed. With the storm worsening, Rosita makes the call to evacuate everyone to the second floor. After Barbara and Nabila flee upstairs with Adam and Mariam, an injured Virgil is helped up the steps by Dianne. As Rosita and Lydia fight off the growing herd of undead inside Aaron’s house, Dianne reports that Judith and Gracie are missing and not upstairs with the others. Rosita orders Dianne to step in and help fight off the undead while Lydia heads through a window to search for Aaron and the missing girls. Dianne is among the refugees from Alexandria to move back to Hilltop in an attempt to rebuild the town after the devastating Whisperer War. She is excited to receive supplies and relief aid from the Commonwealth and informs Maggie that the soldiers are helping the others reinforce the water tower. When one of the trip alarms in the woods is triggered, Dianne heads out with Maggie, Elijah, and Lydia to clear the undead. However, they are surprised and some are impressed by the Commonwealth Army's skill in taking out a group of walkers with such precise aim and skill. After Maggie decides on behalf of her community that they will not accept a partnership with Commonwealth, some of the residents are dissatisfied, including Dianne. She discusses her beliefs with Maggie, and explains that she cannot continue to fight any longer, and makes the decision to move to the Commonwealth in hopes for a better future. Dianne parts ways with Maggie, and she, Papa Bear , and another longtime Hilltopper move to the Commonwealth, no longer able to tolerate the hardships of living in Hilltop. After the death of the Warden , Dianne and the others are freed from the Commonwealth's control. The morning following, Dianne helps by gathering supplies as the group prepares to attack Pamela Milton , and boards one of the vehicles. She is able to aboard the train, and they eventually arrive at the depot and wait outside one of the tunnel entrances. Concerned, Dianne takes notice of two of the guards getting close, but are called off by Pamela before they notice anything. In a hurry, Dianne and the others make their way through the tunnels, and emerge into the Union Station that appears abandoned. Dianne moves quietly through the station, before Daryl realizes that something isn't right and notices it's a trap. He shouts for everyone to get down, and the Commonwealth begin to shoot the Coalition. Dianne takes cover underneath a flight of stairs, where she attempts to attack nearby enemies. Hiding with a few other members of her group, a man attempts to crawl to them for safety, but he shot down by one of Pamela's men. Once Judith is accidentally shot by Governor Milton, Dianne helps in escorting Daryl and the others through the city in order to reach the hospital , where they believe they are being attacked and chased by other Commonwealth soldiers. They continue to run, until they are blocked and trapped inside an alley with a hoard of walkers, as Dianne and the others notice the new walker variant climbing atop some crates and boxes. They eventually reunite with Jules and Luke before being closed in, and Dianne helps to make a way for Daryl through one of the alleys so that Judith can reach the hospital. Looking behind, Judith notices her allies being ambushed by a group of walkers, including Dianne. While Daryl reaches the hospital with Judith, Dianne is able to break through the hoard of walkers and make her way out of the barricades and into the main city. She makes it to the police station , where she helps to load supplies onto a truck, and takes off with a portion of the group as the walkers start to get closer. With the help of Mercer, they are able to get away unharmed. Dianne arrives at the hospital with the supplies, and waits for help as she and the others fend off incoming walkers. Lieutenant Rose arrives in another truck and reports to Mercer that they're all set: everyone is in the back and there's no one to check. The doctors have set up a safe house, but they have to hurry. Mercer calls for everyone to go, stating that they need to get Judith to Tomi . Everyone boards the truck with Princess, Max, and Dianne pushing Judith's stretcher. Dianne arrives at the safe house in the Estates and takes notice of the people begging to be let inside. Eventually, she and her allies confront Pamela as she refuses to let anyone inside. With the walkers approaching, Dianne readies her weapon and prepares to attack Pamela's men as they refuse to cooperate. Daryl is able to convince the Commonwealth soldiers to let the people inside, and Dianne helps getting everyone inside before quickly closing the gates in time to prevent the walkers from breaking in. She then notices Pamela watching an undead Lance Hornsby at the gates as she approaches and watches him struggle. Dianne also witnesses Mercer's actions as he takes control of the situation and arrests Pamela for treason. With the variants being too dangerous to just lead away, Mercer outlines a new plan as everyone rushes to carry out his orders. As the combined group continues to fight the walkers, the truck travels through the cleared path to the fuel depot where Vickers, Ezekiel, Jerry, Dianne, and several Commonwealth soldiers collect the fuel. Max reports in that they've got fuses running to the private sewers under the Estates and they'll finish wiring the rest once they get the fuel back while Princess goes to start the PA system to draw all of the walkers to the Estates. Using Pamela's record player, the song \"Cult of Personality\" is blasted throughout the Commonwealth from the Estates, drawing all of the walkers overrunning the Commonwealth towards it. Max calls in that they're good to go before she joins the others in retreating to the rendezvous point. The gates are opened and the herd floods into the Estates. Once the song ends, the fuses are ignited, detonating the fuel in a chain reaction that obliterates the Estates and the entire herd, saving the Commonwealth. The following day, Dianne is one of the many sitting at a table indoors enjoying a feast. She is seen briefly talking to some of her friends and allies. One year later, it is assumed Dianne has made her home at the newly-reformed Commonwealth as she watches Governor Ezekiel and Deputy Governor Mercer give a speech to the city.",
        "Killed Victims[]": "This list shows the victims Dianne has killed: Satellite Guard 1 Satellite Guard 2 Felix (Zombified, alongside Daryl and Lydia ) Penny (Zombified, alongside Daryl and Lydia) At least 2 unnamed Whisperers (Caused, alongside Coalition archers) Several elk Numerous counts of zombies",
        "Appearances[]": "",
        "Trivia[]": "It is shown that Dianne is excellent with a bow and arrow , but it is unknown if she learned it during or before the apocalypse. Dianne is one of eight characters introduced in Season 7 that are confirmed to be alive, the others being Ezekiel Sutton , Jerry , Nabila , Theresa , Douglas , Rachel Ward , and Cyndie . Dianne is the recurring character with the most appearances throughout the series, appearing in 36 episodes.",
        "Name": "Dianne"
    }
]