[
    {
        "Dog": "",
        "Overview[]": "Dog is brave and loyal to his allies who he has grown an attachment too. He never shies away from danger and always listens to his owner, Daryl Dixon . To his enemies, Dog can be quite vicious, going in to bite them if it means protecting his allies.",
        "Post-Apocalypse[]": "Dog was born in 2016 by his mother, who was part of a group of former U.S. military soldiers surviving in the post-apocalypse. Dog was born on the day when their group was overrun and escaped with a woman, Leah , and her adopted son, Matthew . Leah found a cabin in the woods, but then discovered that Matthew had been bitten. He later died, was put down by Leah, and buried on the land. Leah then named the pup Dog and was her only companion. At some point after he was born, his mother also died. A couple of months later, as a puppy, Dog ran off and found a man named Daryl Dixon camped out by a nearby river. At some point after Rick Grimes ' apparent death, Daryl went to live in the woods and found the dog, eventually adopting and raising it. He merely names him \"Dog\". Six years later, Daryl escorts Carol and Henry to his camp by a dam. As he feeds Dog, Carol asks him when was the last time he ate. \"Dog ate yesterday\" , he says and walks off. At night, as Carol gives Daryl a haircut, Dog leaves to walk around. Later, as they have dinner, Henry asks Daryl how he got his scar on the eye but he ignores him and leaves to find Dog. Henry tails Daryl and finds a walker instead. Daryl shows up and asks if he was following him. Suddenly, Daryl hears Dog barking wildly nearby and rushes over to find it stuck in a trap and surrounded by walkers. Daryl picks off the walkers to save Dog and before a walker can bite him, Henry jumps in and saves him. \"I told you to stay back\" , Daryl scolds. Back at the camp, Daryl pets Dog as he talks with Henry about moving to Hilltop . In the morning, Daryl loads up his bike for Hilltop and Carol seems overjoyed she convinced him to come. They drive to Hilltop with Dog riding with Carol and Henry on their cart. Later, they arrive at Hilltop and hug Tara . Aaron greets Daryl and tells him they could use his help locating Eugene , to which he agrees. With Dog leading the way, Daryl, Aaron, and Jesus head out to find Eugene. Dog accompanies the search party and eventually finds Eugene hiding beneath a trapdoor in a barn. As a herd of walkers close in on them, Daryl takes Dog to draw them away from the rest of the group. Using firecrackers and Dog's barking, they manage to get the attention of the herd but Daryl is shocked to see the herd turn away and continue on their original path. Dog was with Daryl, Michonne , Aaron, Magna , Yumiko , and Eugene as they escaped from the cemetery that was filled with both Walkers and Whisperers. Sensing the Walkers and Whisperers at the bridge, Dog barked to get Daryl and friends' attention. After Daryl and Michonne nabbed Lydia, Dog safely escorted them back to Hilltop with Jesus' body. According to Daryl, Dog picked the barn for him and Daryl to sleep over night at Hilltop. After Henry disappears with Lydia , Daryl calls upon Dog to track them down. Dog is able to lead Daryl to the two's escape route and Daryl sends him off again. Dog is then seen with Daryl and Connie as they exit the Hilltop to go after Henry. Dog accompanies Daryl and Connie on their search for Henry and Lydia. Dog leads the two to Henry's dropped fighting stick and shows them the way the Whisperers went. After Daryl kills a walker, Dog retrieves his arrow but breaks it in the process, leading Daryl to comment \"bad Dog.\" Dog runs from the Whisperers' camp with Daryl, Henry, Connie, and Lydia. To Daryl's annoyance, Dog follows Connie when she leads the group in a different direction than where he wants to go in. At an abandoned building, Daryl locks Dog in a closet with Lydia to protect her in case the Whisperers get past them. As Henry is almost killed by a Whisperer, Dog begins growling so a desperate Lydia breaks down the door for him to save Henry. Dog tackles the Whisperer off of Henry and begins savaging him, allowing Henry to finish the job by bashing the Whisperer's head in as Dog attacks. After the Whisperers are defeated, Daryl and his group leave for Alexandria to get Henry medical attention before they move on again. When Daryl's group arrives at Alexandria for medical help for Henry, Dog is with them. As the group leaves, Daryl calls Dog who runs on ahead. They are later picked up by Michonne and Judith on their way to the Kingdom . When Daryl arrives at the Kingdom, Dog is with him. Later, when he departs for the Hilltop, Daryl leaves Dog behind at the Kingdom and asks Connie to feed Dog for him. Connie leaves with Dog to feed him. Negan notices that Judith is upset and she explains that Daryl asked her to watch Dog for him while he moved the Kingdom to the Hilltop. However, Dog has disappeared. As a group moves to Aaron's house for shelter from a blinding blizzard, Judith hears Dog barking and rushes off after him. Negan immediately follows after Judith, finally finding her by following Dog's barking to where he has gotten tangled up. Negan takes Dog's leash and carrying Judith, leads them to an overhang for brief shelter from the storm. When Negan begins to carry Judith to better shelter, she orders him to bring Dog too. Negan takes Dog's leash and takes them to safety from the storm until it ends. Dog runs by the beach playing with Jerry , his kids, Judith, and R.J. When he sees Connie, he gets excited and plays with her and Kelly . When Connie returns him to his owner, Daryl claims that Dog likes Connie more than he does his own owner. Dog accompanies Daryl to Hilltop. When he and Connie look for Kelly in the woods, Dog discovers Magna has followed them and afterwards finds an injured Kelly lying under a tree. Later that night, Dog leaves the community with Daryl back to Alexandria. Dog accompanies Daryl as he smokes on the porch of his house. Dog cuddles with a topless Daryl in their bedroom after he returns from a mission. While taking refuge in an abandoned hospital after leaving Alexandria due to the threat of Beta 's herd , Dog is pet by Lydia . She continues petting him during a conversation between her and Negan and he walks away with her after it is over. Dog will appear in this episode. Dog will appear in this episode. Dog will appear in this episode. Dog will appear in this episode. Dog will appear in this episode. During the ambush by the Reapers , Daryl and Dog take off in pursuit of one of them. Daryl and Dog pursue one of the Reapers through the woods. As Daryl struggles with the Reaper, Dog leaps to his master's defense and bites the Reaper in the leg before getting tossed away, alarming Daryl. With two more Reapers approaching, Daryl is forced to run off chased by two of the Reapers. As he leaves, the last Reaper takes an interest in Dog, seemingly stunned to see him. The next day, as Daryl wanders through a field, the Reaper follows him, spotting Dog nearby as well, sniffing around the grass. Hearing Dog's barking, Daryl finds him with the Reaper who is holding Dog by the collar and Daryl orders the Reaper to let Dog go, drawing his knife. The Reaper releases Dog and removes her mask, revealing herself to be Leah Shaw , Dog's original owner. After dodging Leah's questions, Daryl states that he's leaving and calls Dog, but Dog ignores his commands, surprising and amusing Leah who comments that she'd always thought that Dog had liked Daryl better. After another failed attempt to get Dog to leave with him, Daryl is captured by the Reapers. Dog then accompanies the two back to Meridian , remaining at Leah's side until they take Daryl for interrogation. Daryl later asks for Leah to let him go and to give him Dog back, promising to leave and never be seen by her again. That night, Dog lays at Leah's side at the campfire as the Reapers eat and welcome Daryl into the fold. Dog will appear in this episode. Following the defeat of the Reapers , Dog returns to Alexandria with Daryl . Along the way, after discovering that Alden had died and reanimated, Maggie sits and pets Dog at her, Daryl and Gabriel 's camp. Dog later enjoys one of the apples that Daryl dropped on the ground while reuniting with Connie . Dog is seen laying on the floor inside of Daryl's new apartment in the Commonwealth. While unseen, Daryl reveals to Carol that Dog was abducted on Pamela Milton's orders, alongside the other Alexandria, Hilltop and Riverbend residents living in the Commonwealth, and is currently being held in an undisclosed location. Dog attends a celebration in Alexandria . A year later, as Daryl departs to search for Rick and Michonne , Judith promises to look after Dog for him.",
        "Killed Victims[]": "This list shows the victims Dog has killed: 1 unnamed Whisperer (Caused) Possibly numerous counts of zombies",
        "Appearances[]": "",
        "Trivia[]": "Dog is the only named animal confirmed to be alive in the TV Series . He is also one of only four named animals confirmed to be alive in the entire Television Universe, the others being Skipper , Skidmark , and Zizou . During the \"In Memoriam\" on Talking Dead for \" Stradivarius \", the walkers that ambushed Dog are billed as Dog Walkers . Norman Reedus once asked the writers and crew if Daryl could get a dog, but that request was initially denied until Season 9. Dog not letting go of Daryl's arrow in \" Guardians \" and breaking it was originally not meant to happen, but Norman Reedus improvised and kept that scene going by adding his line \"bad dog\". As of \" Lines We Cross \", Dog has surpassed Shiva as the animal with the most appearances in the TV Series. He has appeared in 25 episodes. Additionally, Dog's owner, Daryl, is the character with the most appearances overall, having appeared in 148 episodes in total. Dog appears in the mobile game State of Survival along with Daryl. Dog is the only living character whose actor has passed away.",
        "References[]": ""
    }
]