[
    {
        "Donnie": "",
        "Fate": "",
        "Contents": "",
        "Overview[]": "Donnie is an aggressive, volatile, fuming, hostile, and misogynistic man. He grows a deep hatred for Carol who shot him in the arm and wants revenge against her. Eventually, Donnie explodes and goes into a blind rage. Donnie's aggression even causes him to attack his own allies, shown when he hits Paula . He attacks Maggie and brutally beats Carol before being knocked unconscious by Paula. Donnie's cruel nature even makes him disliked by his fellow Saviors who are shown to annoyed with his behavior.",
        "Pre-Apocalypse[]": "Nothing is known about Donnie's life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "At some point in the apocalypse, Donnie somehow came into contact with a group named \"the Saviors\" which he subsequently joined, during where he developed a sexual relationship with his fellow survivor Paula . Donnie aided his group in terrorizing other survivors and communities around the area into subjugating to Negan's will, where their victims would be forced to give half their supplies in exchange for not being murdered. Having escaped the Satellite outpost with Molly , Michelle , and Paula , Donnie sneaks up behind Maggie in the woods but is shot in the arm by Carol . Before he can be further harmed, his fellow Saviors capture Carol and Maggie. The next morning, an injured Donnie has his arm temporarily treated and ventures to the safe house to await reinforcements. However, he remains in a sour mood about his injury, threatening Carol and striking Paula after she rejects to make a trade with Rick and his group. While trying to kill Carol, Donnie is knocked out by Paula and eventually dies from his infected gunshot wound. When Maggie removes his bandage to let him bleed out, she realizes that he had already died and is in the process of turning. He is tethered to a pipe to be used as a trap and shortly after reanimates. When Molly enters the room to check on him, the zombified Donnie bites her, causing her to kill him immediately.",
        "Death[]": "Killed By Carol Peletier (Caused) Donnie ambushes Carol and Maggie, who are guarding the perimeter of the Saviors' compound. Before he can kill them, Carol shoots him in the arm. Paula (Caused) Blood Loss (Alive) Paula places a tourniquet around Donnie's arm, but makes no further attempt to treat and/or amputate it, and seems to forbid any of the others from doing so as well. As a result of this, Donnie dies from blood loss. Molly (Zombified) After a zombified Donnie bites Molly as she walks into the room he is in, he is stabbed in the head by her.",
        "Killed Victims[]": "This list shows the victims Donnie has killed: Molly (Infected, Caused) Possibly numerous counts of zombies and unnamed people",
        "Relationships[]": "",
        "Appearances[]": "\" The Same Boat \"",
        "Trivia[]": "Donnie is one of four characters to be monoplegic, as he lost the ability to move his left arm after he was shot. The other characters with this distinction are Bob Lamson , who is able to still move his left foot moments after being hit by a car, Phil , who is able to move his right leg despite having a beam going through his lower spine, and Melvin , who is able to move his right leg after the explosion. Donnie is the only monoplegic victim to have lost the ability to use an arm instead of a leg. Donnie is the one of only plegic victim who's paralysis is not caused by a spinal cord injury, instead his being caused by nerve damage from a gunshot wound."
    }
]