[
    {
        "Douglas": "",
        "Pre-Apocalypse[]": "Nothing is known about Douglas' life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "At some point during the outbreak, Douglas joined a community called the Hilltop Colony . Douglas is seen walking around a yard with other residents. Douglas attends a training class. He later gathers with other residents in the center of town, and later watches Harlan Carson be taken by the Saviors. Douglas is among the militia to listen to the leaders' speeches before they launch their assault on the Sanctuary . Before the attack, he listens on to Gregory's attempt to dissuade the Hilltoppers from attacking the Saviors but ignores his demands. After successfully ambushing the Saviors' headquarters, he and the others leave in their vehicles so the incoming horde may swarm the factory. Douglas is among the Militia to sneak into the satellite outpost that has been re-occupied by the Saviors in order to take it over. When Morgan creates a gap, distracting the two Saviors, Dianne silently takes out the guards with her bow. Douglas then gets into position as the Hilltoppers prepare to assault the unsuspecting Saviors. Inside, he is with Dianne , Oscar , and group of Hilltoppers pinned in a hallway as Saviors shoot from a distance. Oscar comments that they've lost touch with one of the groups. He is unable to answer Tara when she asks about Morgan. After a lengthy gunfight, he and his allies are able to gain the upper hand as the Saviors call a retreat. Before Alden , Jared , and the other Saviors can flee, they are captured by Douglas and the rest of the militia. Douglas is among the Hilltop and Kingdom forces escorting the captured and shackled Saviors along a road at by an armed guard. As the militia gets ambushed by walkers, he helps defend their prisoners, and watches as Morgan chases after Jared and his chain gang into the woods. Douglas is among the Kingdommers and Hilltoppers to watch over the captured Saviors at the Hilltop. Douglas is among the Hilltoppers and Kingdommers stopped by Simon's crew at night. After Neil is executed and Jerry is released, Douglas and the rest of the convoy return home to Hilltop. Douglas is seen walking around the newly populated Hilltop with other residents. Douglas is seen on guard duty atop the wall. Douglas is among the Hilltop residents and refugees to help prepare the Hilltop for battle against the Saviors. He manages to survive the Saviors' attack as well as the subsequent outbreak that killed several people due to the Saviors having tainted weapons. Douglas accompanies the militia to fight the Saviors in the final battle. After most of the Saviors are wiped out due to Eugene's faulty bullets, he helps the others fight the surviving Saviors until they surrender. He then watches on as Negan is defeated and captured while Rick addresses the crowd, declaring peace among all communities. Douglas is on guard duty atop the wall when Michonne enters through the front gates. Douglas is on guard duty atop the wall as Daryl , Carol , and Henry arrive at Hilltop. Douglas is on guard duty atop the wall when Michonne's group enters Hilltop, and he later attends the communal dinner with other Hilltop residents. Douglas walks in front of the Barrington House with another man. Douglas is on guard duty atop the wall when the Whisperers show up at Hilltop. Douglas is seen on guard duty atop the wall. After the Whisperers arrive with Alden and Luke as hostages, Douglas remains atop the wall. When walkers begin to approach the Hilltop due to the cries of baby Adam, Douglas, along with Kelly, Marco, and another Hilltopper, bang on the wall in an attempt to attract the attention of the walkers. Douglas is seen on guard duty when the Kingdom refugees arrive at Hilltop. Douglas participates in a training exercise on the beach with other Coalition soldiers, and later returns to Oceanside . He later helps with putting out the fire in the forest that night as a result of a crashed satellite. Douglas is among the Coalition soldiers at Alexandria to help fight off the waves of the undead, present for the town meeting on what to do with the Whisperers. Douglas attends a combat training session led by Aaron, and witnesses Lydia causing a scene in the meeting house during lunchtime. Douglas is among the Coalition soldiers at Hilltop to face the Whisperers and Alpha's horde, and he later retreats after the horde breaks through the barbed wire fence. Douglas helps defend the Hilltop from the Whisperers and their horde as the settlement burns. Douglas evacuates to the Tower when Alexandria is overrun. Douglas is seen preparing for battle inside the hospital as the Whisperers break inside, and evacuates through the elevator shaft. He makes it to rendezvous point B with other survivors of Alexandria, Hilltop, and Oceanside. Douglas helps Aaron, Jerry, and others lift a section of the wall after it falls, and uses a sledgehammer to secure the wall panel in place. Douglas walks around in Alexandria. Douglas is at the police station with other Commonwealth soldiers. He is assigned with Ross to Sector A by Colonel Vickers . Douglas attends the Founders' Day celebrations in Union Square with many other city residents. Later, he is among the excited festival attendees watching the wrestling match until a zombie outbreak caused mass panic in the square. As chaos enveloped the square, Douglas fled to safety. One year later, Douglas is living in the Commonwealth and attends Ezekiel and Mercer's speech in a city park. Seated on a park bench, Douglas listens to the Governor as he addresses the crowd and applauds at the end of his remarks.",
        "Killed Victims[]": "This list shows the victims Douglas has killed: Possibly numerous unnamed Saviors Possibly numerous unnamed Whisperers Numerous counts of zombies",
        "Appearances[]": "",
        "Trivia[]": "While uncredited, Colonel Vickers refers to him as Douglas in \" The Rotten Core \". Douglas is one of only three named Hilltop residents to be confirmed alive, the others being Hershel Rhee and Papa Bear . Douglas appears in the archival footage shown at the beginning of \" Lockdown \" as Judith narrates past events of the show to the audience before the episode's story begins. Dalton Baxter also portrayed a second Commonwealth soldier, Trooper Katz ."
    }
]