[
    {
        "Doug": "",
        "Pre-Apocalypse[]": "Very little is known about Doug's life prior to or as the outbreak began, except that he was a mechanic at Earl's Auto Parts. At some point during the outbreak's onset, Doug was infected, died, and reanimated.",
        "Post-Apocalypse[]": "Jimmy discovers Louise Bush and Doug with their feet stuck in the mud and he, Hershel , and Rick capture the pair. Hershel announces to Rick that if he and his group are to continue living on his farm, they have to follow his rules, such as their treatment of walkers. Hershel believes that the walkers are just, \"sick people\", and can be restored, so he and Rick escort the two walkers back to the farm. When they arrive, Shane Walsh and the Atlanta survivors question Hershel and Rick's actions. Shane, enraged, lets it be known that he believes Hershel is wrong, and opens the barn, released the zombie occupants. Along with Glenn Rhee , Andrea Harrison , T-Dog , and Daryl Dixon , he begins to shoot the walkers. After killing a few walkers, Shane turns around, stares at Rick intently, before shooting Doug in the head. Doug's lifeless corpse is seen on the ground outside the barn with the other dead zombies. Later, his body is brought to the field and burned with the other corpses from the barn shootout.",
        "Death[]": "Killed By Unknown Cause (Alive) It is unknown how he died. At some point, a zombified Doug is found stuck in a muddy creek bed and is captured by Jimmy, Rick, and Hershel to be placed inside the barn. Shane Walsh (Zombified) As Shane is killing the walkers coming out of the barn, he turns to Doug and shoots him in the head.",
        "Killed Victims[]": "This list shows the victims Doug has killed: Possibly a few zombies",
        "Appearances[]": "",
        "Trivia[]": "Doug appears in the archival footage shown at the beginning of \" What's Been Lost \" as Judith narrates past events of the show to the audience before the episode's story begins. Doug appears in the final flashbacks of the last episode \" Rest in Peace \"."
    }
]