[
    {
        "Dr. Stevens": "Dr. Stevens",
        "Pre-Apocalypse[]": "Nothing is known about Dr. Stevens' life prior to or as the outbreak began. It is possible that she lived in or near Woodbury. It is also likely she was a trained doctor.",
        "Post-Apocalypse[]": "Dr. Stevens assumes as the acting physician for the town of Woodbury, providing medical care to sick and injured citizens. She is seen caring for Andrea Harrison , a newcomer to Woodbury, and later talks to Lieutenant Welles with the Governor about the helicopter crash and the location of the National Guard military convoy. When the Governor gives the word, she leaves him alone with the Lieutenant. Dr. Stevens treated the Governor at the clinic after he was attacked and stabbed in the eye by Michonne Hawthorne . She remains in the clinic and begins caring for the wounded from the arena and earlier raid. Dr. Stevens is at the infirmary caring for the wounded, including nine residents who were hurt in the previous night’s raid by Rick’s group. Andrea visits her to check on the wounded and to give Milton a report on the status of the patients. After Milton brings in Tyreese, Sasha, Allen, and Ben to Woodbury, Dr. Stevens is summoned to the infirmary to perform a medical evaluation on the newcomers. Following the failed prison assault , Dr. Stevens' fate is unclear. However, she is most likely dead as it is likely she was among the Woodbury soldiers killed during the prison raid or massacred by the Governor out on the road as she was not seen with the remaining Woodburians arriving at the prison. [1]",
        "Death[]": "Killed By Philip Blake (Caused or Direct) Dr. Stevens is among the residents shot to death by the Governor after refusing to return to the Prison to continue fighting.",
        "Killed Victims[]": "This list shows the victims Dr. Stevens has killed: Possibly numerous counts of patients (Before Reanimation or Out of Mercy) Numerous counts of zombies",
        "Appearances[]": "\" Walk With Me \" \" Made to Suffer \"",
        "Trivia[]": "Dr. Stevens was credited for \" The Suicide King \" but the scene was deleted. Her appearance in the Comic Series was that of a Caucasian male in his late 40s, while her TV counterpart is that of an African-American female in her early to mid 50s. She is the first character whose ethnicity has been changed from Caucasian to African-American for the TV Series, the second being Bob Stookey . She is also the first character whose gender has been changed from male to female for the TV Series, the second being Deanna Monroe , third being Reg Monroe , fourth being Farron , and the fifth being Kelly . As of January 2021, the actress has never watched the show, let alone her scenes. She also admitted that she thought her character would have had more than three episode appearances (two on-screen, one deleted) given her comic counterpart's status in the source material. [2]",
        "References[]": "",
        "Name": "Dr. Stevens"
    }
]