[
    {
        "Duke": "",
        "Fate": "",
        "Contents": "",
        "Pre-Apocalypse[]": "Nothing is known about Duke's life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "At some point in the apocalypse, Duke somehow came into contact with a group named \"the Saviors\" which he subsequently joined. Duke aided his group in terrorizing other survivors and communities around the area into subjugating to Negan's will, where their victims would be forced to give half their supplies in exchange for not being murdered. Duke is at the Sanctuary with the other Saviors getting ready for the final assault when he and a group of Saviors are dispatched by Negan to set up a roadblock, when in reality they are being used as a decoy. While setting up the roadblock, the group is attacked by Rick and the Militia and all are killed. Duke surrenders to the group, but Morgan instead stabs him with his staff and then slices his throat, killing him. Shortly after, Morgan sees a hallucination of Jared , who proceeds to mock him and the way he killed Duke.",
        "Death[]": "Killed By Negan Smith (Caused) Negan deliberately sends Duke along with a small group of Saviors to set up a roadblock and walkers on a road and be sacrificed as part of his plan to lead Rick and the Militia into a trap. Morgan Jones After his fellow Saviors are killed, Duke surrenders to Morgan, however, Morgan impales him with his staff and then slices his throat. He was likely put down by a member of the Militia before they moved on.",
        "Killed Victims[]": "This list shows the victims Duke has killed: Possibly numerous counts of zombies and unnamed people",
        "Relationships[]": "",
        "Appearances[]": "\" Wrath \"",
        "Trivia[]": "Duke is the last named character to die on-screen in Season 8 . He is also the last named character directly killed by Morgan Jones before leaving the show. Coincidentally, both Dukes are Saviors that were killed by Morgan by having their neck slit and stabbed through the chest."
    }
]