[
    {
        "Overview": "Duncan is a strong and hulking man who may come off as intimidating, when in reality he is caring and loyal to his friends. He acts as the muscle for the group since his strength and large stature allows him to carry and open things a normal person would be unable too, earning him the nickname \"Sasquatch\" by Negan . He is very loyal to Maggie and obeys any orders he is given even if the order can be seen as immoral, such as stopping Alden from trying to save Gage . After he is badly wounded by the Reapers , he is mercifully put down by a greatly upset Maggie, with his final wish being to get Agatha home.",
        "Pre-Apocalypse": "Nothing is known about Duncan's life prior to or as the outbreak began.",
        "Post-Apocalypse": "Upon Maggie and her group's return to Alexandria after their mission at Fort Connors , she is overjoyed to see that Duncan, along with Agatha and Frost , are alive and well. He playfully greets young Hershel and hoists him on his shoulders as the group talks. Later during a meeting, Maggie explains that Duncan, Agatha, and Frost were separated and believed to have been killed after Reapers attacked their village . Duncan and his fellow Wardens agree to accompany Maggie and a group of Alexandrians to Meridian to take out the Reapers and secure the food and water supplies to feed everyone in Alexandria. Part of a group consisting of Maggie, Daryl, Alden , Cole, Elijah, Gage , Negan , Agatha, Frost, Roy , and Gabriel , the survivors utilize Negan's familiarity with the D.C. area to travel to Meridian. Due to the heavy rain storm, the survivors are forced to head into the subway tunnels to complete the journey. While in the tunnels, they come across hundreds of body bags, many containing walkers in them. At some point while dispatching the body bag walkers, Gage and Roy go missing, along with the group's ammo and supplies. Shortly after this realization, a large group of walkers appear, forcing the other survivors to move forward in the tunnel without being able to search for Gage or Roy. He is able to make it into a subway car before the walkers are able to catch up with his group. Duncan and the rest of the Meridian mission survivors make their way through the subway tunnels and successfully fight their way through the undead to safety, despite losing Gage , who was killed after running away from the group and becoming separated. With the storm subsided, Duncan and the rest of the group traverse down a road when suddenly Roy is shot and killed and a flying knife severs Cole's hand clean. The Reapers have launched an ambush on the survivors. After the Reapers attack his group, Duncan shouts for everyone to run, then attempts to defend himself and avoid getting killed, but he gets wounded by the throwing knives. With the members fragmented into smaller groups, Duncan and Agatha manage to escape alive. Later, they arrive at a building where Maggie meets up with them. Duncan's wounds are too severe and he implores Maggie to get Agatha home safe before dying, and Maggie puts him down. In a brief flashback to the beginning of the previous episode, Duncan can be heard again, shouting for the others to run from the Reapers, just before Daryl takes off on his own.",
        "Death": "Killed By The Reapers Duncan is stabbed several times by the Reapers' throwing knives. He is able to escape the attack with Agatha. After some time, he bleeds out from his injuries, but not before saying his final goodbye to Maggie. Maggie Rhee (Before Reanimation) Afterwards, Maggie stabs him in the head so that he doesn't reanimate.",
        "Killed Victims": "This list shows the victims Duncan has killed: Gage (Caused) Numerous counts of zombies and possibly unnamed people",
        "Relationships": "",
        "Appearances": "",
        "Trivia": "Duncan appears in the final flashbacks of the last episode \" Rest in Peace \".",
        "References": "",
        "Name": "Duncan"
    }
]