[
    {
        "Dwight": "Dwight",
        "Overview[]": "Dwight is shown to be a brave, highly intelligent and caring person who is a strong, determined survivor and a loving husband towards his wife, Sherry. Dwight is initially introduced as being completely disgusted living a life as a Savior and as a result attempted to get Sherry and sister-in-law Tina as far away as possible and is even willing to cause harm to his former group members in order to escape. While he appreciates the help that Daryl gives them in the forest, Dwight, following Tina's death, quickly betrays him and steals his possessions, showing that he has cowardly tendencies and can be a liar and manipulative. Following being punished by Negan for fleeing the Sanctuary and causing Tina's death and being permanently mutilated and separated from Sherry, Dwight is shown to become fanatically loyal to the Saviors again and devolves into an antagonist . He is shown to have developed a personal vendetta against Daryl as he attempts to kill him with his own crossbow, though he kills Denise instead and shows little remorse, showing that he is capable of cold-blooded murder. He is shown to want to fulfill Negan's wishes of taking over Alexandria as he attempts to force Daryl and Rosita to take them to their base, though he is stopped by them. Following this he cruelly captures Glenn and Michonne and then Rosita and Daryl and personally delivers them to join the rest of their group in being punished by Negan. His desire to kill Daryl is very evident as he volunteers to kill him after he punches Negan in the face after killing Abraham though Negan does not allow him to. Following this Dwight is left in charge of torturing Daryl psychologically after he is taken as a prisoner and takes some pleasure in tormenting him and is visibly upset when he discovers that Daryl was released by Sherry. He even takes pleasure in taunting Rosita and Aaron when he and his fellow group members arrive at Alexandria to collect their tribute. In spite of his cruel side, Dwight is gradually revealed to be loyal to the Saviors only for the purposes of protecting Sherry from harm and it is revealed that the only reason Negan allowed him to live was after Sherry offered herself up as one of Negan's wives. Dwight is secretly shown to despise Negan for taking his wife away from him and for his overall cruelty towards others. After Sherry vanishes, Dwight is deeply saddened and in order to protect her from being hunted down and killed by Negan, he is able to frame Emmett Carson , who is then brutally killed by Negan, showing the extreme measures that Dwight is willing to resort to to protect his wife from harm. With no more reason to be loyal to the Saviors, Dwight chooses to align himself with the Militia , claiming that he indeed hates Negan and that he wants him dead. Despite knowing that he could potentially die after Negan's defeat due to his actions towards Daryl and his killing of Denise, Dwight chooses to help free the communities from Negan's tyranny as he knows first hand of the cruelty that Negan and the Saviors are capable of. During Season 8 , Dwight his shown to be dedicated to his mission to defeat Negan and is able to help the Militia achieve a majority of their victories against the Saviors by passing them valuable information and in the process gets numerous members of his former group brutally slaughtered. He is shown to be careful, cautious and cunning as no member of the Saviors, except Eugene , are able to deduce that he is the Militia's spy. Dwight's loyalty to the Militia is clearly evident in \" How It's Gotta Be \" in which he takes measures to ensure that the survivors are able to escape from the Saviors posted outside and personally guns down numerous Saviors, though in the process exposes himself to Laura who is able to escape. Following this, Dwight even rejoins the Saviors after learning Laura has not been seen in order to divert them away from Tara and the rest of the fleeing Alexandrians and in the process earns Tara's respect and forgiveness for his killing of Denise. Following Negan's brief disappearance, Dwight chooses to align himself with Simon in taking over the Saviors, possibly showing that he has some slight hope that the Saviors can still function as a group without Negan. However this is shown to be a bad move as Simon is even worse than Negan and wants to completely exterminate the survivors at the Hilltop and Dwight is forced to go along in order to protect his cover. During the assault however, he saves Tara's life again by injuring her before Simon can with an untainted weapon, further proving his care for the Militia and what he is willing to do to earn her full forgiveness. Upon Negan's return, Dwight continues his attempts to take him down as he takes information down in order to help the Militia finish Negan and the Saviors off permanently and even helps to get Simon exposed as a traitor in order to remove the Militia's second greatest threat only after Negan. However this victory is short lived as Laura is revealed to have exposed Dwight and Negan is revealed to have finally outsmarted him into delivering information via Gregory to the Militia to lead them into a trap. After the defeat of the Saviors, Dwight is visibly pleased that Negan is defeated; however, when Daryl was apparently about to execute him, Dwight seems to realize how much he still wants to live and begs Daryl for his life while sincerely apologizing for everything he has done. Because of Dwight's genuine remorse for his actions towards Daryl, his murder of Denise and other actions, he is spared, though he is still exiled but encouraged by Daryl to go and find his missing wife. One year after his exile, Dwight began to regress into some of his more extreme behaviors since Negan's defeat. His search for Sherry led him to Texas , where he encountered John Dorie and his girlfriend, June . Dwight's determination to find his wife was proven when he was willing to kill John to find Sherry's whereabouts. However, through their own experiences, John and June persuade Dwight to change his ways and not revert back to who he was when he was part of the Saviors. Dwight joins John and June, and reunites with Morgan Jones . Although initially skeptical of seeing Morgan again due to the past, Morgan assures Dwight that he understands how things ended for him and allows him to join his group and their mission to help people in the world. During this, Dwight is still determined to find Sherry, but after finding a letter from her that encourages him to stop looking for her, he accepts that Sherry is gone and finds solace with his new group. During John and June's wedding, Dwight gives John his and Sherry's wedding rings, promising that if he finds her, they will start over fresh. Dwight's experience in Virginia with Daryl and Negan still resonates with him. In his hostile encounter with Rollie , he spares him and gives him another chance like Daryl gave him, despite the fact that Rollie captured and threatened to kill him. When the group encounters Virginia and The Pioneers , a network of survivors that shares similarities to Negan and the Saviors, Dwight refuses to submit to them when Morgan and the others insist on contacting her for help. Eventually, Virginia takes in Morgan's group and separating them amongst the Pioneers' various settlements. Dwight becomes a scout and investigator for the Pioneers, alongside Althea Szewczyk-Przygocki , who he develops a sibling bond with. His desire to help people is clear when he tries to help Althea reunite with her lover , but inadvertently finds himself reunited with Sherry. After having reunited with his long lost wife, Dwight is overjoyed and the happiest he has been. However, Sherry's ruthless actions and desire for revenge against Virginia to prevent history from repeating itself blinds Dwight, who is willing to go to any lengths to never lose Sherry again. This causes him to briefly revert to his old ways as a Savior lieutenant, going as far as locking up Morgan and Althea to prevent them from interfering with their assassination attempt on Virginia. Dwight and Sherry's inability to move past what they went through at the Sanctuary causes a rift between the two of them. After Virginia's death at the hands of June, Dwight and Sherry eventually reconcile their marriage after the death of John, the man who helped Dwight find his wife again in the first place. In the aftermath of Teddy Maddox 's launch of nuclear missiles that decimates half of Texas, Dwight and Sherry become ethical outlaws called the Dark Horses and are protecting a family of survivors in a bunker safe from the fallout. Dwight develops a close bond with Briga Larson , which motivates him to want to start a family with Sherry, feeling like he is ready for fatherhood, although Sherry has her doubts that a family can last in the nuclear fallout. Following the Larson family's murder on Victor Strand 's orders, Dwight and Sherry regroup with their fellow survivors to go to war with Strand and his tower , a place that parallels the Sanctuary. Before the war comes to a head, Dwight discovers that Sherry is pregnant, which motivates them both to win the war to provide a life worth living to their child. After Strand's defeat and the Tower's destruction, Dwight and Sherry flee Texas on the rafts, where the groups are captured by PADRE . Seven years later, Dwight has become a well respected combat instructor for PADRE and goes under the code name, \"Red Kite\". He and Sherry's son, Finch is one of Dwight's combat students, although Finch has no idea Dwight and Sherry are his biological parents. Despite keeping this a secret, Dwight shares a strong bond with Finch and is a loving and devoted father to his son, something that Dwight eventually confesses to Finch. Dwight and Sherry plot to get Finch away from PADRE to live life as a family under their own rules. However, this plan goes awry when the co-leader of PADRE, Shrike , has Finch fatally bitten on the shoulder to motivate June to create a cure. Dwight is absolutely devastated by Finch being bitten, viciously threatening to kill Shrike for what she did. June is able to make a temporary cure for Finch's bite, which motivates Dwight and Sherry even more to rescue their son and flee PADRE. Dwight's desperation to save his son is proven when he is willing to hunt down Morgan under PADRE's orders to ensure Finch's freedom. However, Dwight and Sherry can't bring themselves to betray Morgan and successfully break Finch out of PADRE. While on the run from Shrike's forces, Finch's infection returns and pushes Dwight to his breaking point. Overcome with anger and vengeance over Finch's imminent doom, Dwight prepares to go after Shrike, but June persuades him to be there for his son in his dying moments, something she couldn't do with her daughter . When June captures a fatally bitten Shrike, she contacts Dwight and Sherry, granting them permission to kill Shrike in anyway they wish. However, Finch pleads with his father to not let someone feel the pain he is in and Dwight chooses to honor his dying son's wish and instructs June to give Shrike a quick and painless death. Finch eventually dies from his infection, which demoralizes Dwight and Sherry. Losing their son was the last straw and causes Dwight to split with Sherry, telling her that everywhere they go, it all stays the same. They both end their relationship amicably and embrace standing over their son's grave. Upon returning to his old house , Dwight sinks into a depression over Finch's death and splitting with Sherry, isolating himself away from everyone he cares about. He has no desire to live anymore, going as far as to scream for Daryl to come and kill him, since he returned against Daryl's threats. Sherry, June and Odessa Sanderson arrive at the house, requesting Dwight's help in the fight against Madison's nemesis, Troy Otto , who was presumed dead . Blaming himself for what happened to Finch, Dwight initially refuses. Despite his refusal to help, Dwight eventually comes around after Odessa's injury leads them back to the Sanctuary for medical attention. He comes to terms with his son's death and rejoins the group to help defeat Troy. When Troy's herd of walkers invades PADRE, Dwight takes the lead, instructing everyone what to do in order to deal with the walkers, even sacrificing Troy's second-in-command, Russell to buy them time. After Madison's second apparent death and the Fall of PADRE , Dwight declares his love for Sherry and the two reconcile their marriage. They both return to the Sanctuary with the PADRE survivors to rebuild it into a community worthy of its name. While Sherry is initially hesitant, Dwight insists that it will make Finch proud. Now at peace with his past, having repaired his relationship with Sherry and making good on his promise to Daryl to make things right, Dwight has found inner peace as co-leader of the Sanctuary, officially a redeemed man.",
        "Pre-Apocalypse[]": "Dwight experienced an average childhood where he grew up in a small town in Virginia [2] . During his youth, he was taught by his late grandfather in the art of woodcarving, which became a valued hobby of Dwight's and thus he would practice the skill in his spare time [3] . As a young adult, he later met and befriended a local female babysitter named Sherry. Originally, when the pair began dating, Dwight was noted for having problems with his memory, and thus would generally fail to remember the pleasant times they both shared as a couple, which caused great frustration on his part [4] . Due to his memory problems, he used post-it notes to remind him to do certain tasks. Eventually, the pair soon fell in love and got married where the two lived together in a single-story house located somewhere in Virginia. Through their marriage, Dwight befriended his sister-in-law Tina who had diabetes and required insulin in order to treat her condition [5] . Over time, Dwight and Sherry gradually aspired to start a family of their own and thus would attempt to conceive a child together, however, their attempts ultimately proved futile [6] .",
        "Post-Apocalypse[]": "During the onset of the outbreak, Dwight was present alongside Sherry when the initial chaos and devastation occurred. The pair were forced to flee into a nearby forest which had become infested with a large herd of walkers. In an act of desperation, the pair utilized a large truck through opening the vehicle's valve in order to spread a trail of gas throughout the forest which they ignited to create a massive wildfire that engulfed the pursuing walkers. After this event, Dwight and Sherry managed to reconnect with Tina who was located in Washington, D.C. at the time. At some point later, the trio somehow came into contact with a group of survivors known as The Saviors, whom they subsequently joined and settled into a compound known as the Sanctuary . Originally, the trio worked together to earn \"points\" in exchange for supplies. Over time, however, they grew to become fearful of the community leader, Negan Smith , due to his violent sociopathic actions and oppression. Eventually, Tina fell behind on points and became unable to purchase the insulin which she so desperately required. She was offered the opportunity to marry Negan and become part of his harem, in exchange for no longer operating in a point capacity and therefore always having access to medication. However, acting on impulse, Dwight personally stole the medication whereupon he, Sherry and Tina fled from The Sanctuary. To their misfortune, they were begrudgingly forced to travel on foot with only a limited amount of supplies as well as a lone pistol for protection. At some point later the three managed to take temporary refuge in the forest which they had previously inhabited.",
        "Killed Victims[]": "This list shows the victims Dwight has killed: Carla (Alive, Accidental) Delly (Alive, Accidental) Tina (Before Reanimation, alongside Daryl and Sherry ) Denise Cloyd (Accidental) Gordon (Alive) Emmett Carson (Caused) Mark Gary (Caused) Simon (Caused) Shelby (Zombified) Sullivan Daniels (Zombified) Mark Smith (Zombified) Acolyte (Caused, alongside Sherry) Milus (Alongside Sherry) Eli's Partner Briga Larson (Zombified) Eli (Caused) Oriole Sam Krennick (Caused, Out of Mercy) Finch (Before Reanimation, alongside Sherry) Phil (Alive) Jay (Zombified) Marty (Caused, Alive) Russell (Caused) At least 37 unnamed Saviors (5 Direct, 10 Caused, 22 Indirectly Caused) 13 unnamed funeral home residents (Zombified, alongside Althea ) 15 unnamed office workers (Zombified, alongside Althea and Nora ) All members of Milus' group (Alongside Sherry ) 1 unnamed patrolman of Alicia's group (Zombified) 8 unnamed Tower residents (1 Direct, 1 Caused, 6 Caused, alongside Sherry, Morgan and Alicia ) 5 unnamed PADRE test subjects (Zombified) Many unnamed members of Troy's Group (Alongside PADRE residents and the Gearheads ) Numerous counts of zombies",
        "Appearances[]": "",
        "Trivia[]": "The casting call for this character used the name Kirk . Dwight was described as \"Mid 20s to 30s. Just a couple of years ago, he was a young, blue-collar everyman from a small town, who worked a job, was married, and followed the golden rule. He's avoided being cynical and bottom-line minded but the world seems to keep telling him to look out for number one and eliminate anyone in his way.\" Dwight is credited as D in \" Always Accountable \". This was most likely done to not spoil his identity to Comic readers. Dwight is left-handed. However, he has also been seen shooting with his right hand, possibly meaning he is ambidextrous. Dwight has proven to be a talented woodcarver, as benefiting from being taught his late grandfather, as demonstrated by his ability to craft and sculpt a wooden soldier, additionally, he owns a personal collection of hand-crafted wooden figurines located within his personal room within the Sanctuary . Dwight bears several tattoos including a snake located on his right arm as well as a pair of shoes and a cactus visible on his left. For the entirety of Season 7 and the first half of Season 8 , Dwight has been in possession of Daryl 's wing vest until Daryl finally took it back. Dwight is the first known victim of the 'iron punishment' by Negan , with the second victim being Mark . Dwight appears to be a vegetarian. According to Sherry , Dwight appears to suffer from short-term memory loss. Dwight is one of only 3 main characters to change sides, the others being Merle Dixon who switched sides from the Governor to the Rick's Group and the second being Eugene , who defected from the Survivors to the Saviors (and back to the Survivors in Wrath ). American Idol finalist Chris Daughtry auditioned for the role of Dwight. However, the role was handed to Austin Amelio eventually. Dwight is one of the nine TV Universe characters to appear in Fear the Walking Dead , the others being Morgan Jones , Paul Rovia , Carol Peletier , Rick Grimes , Sherry , Jenny Jones , Duane Jones , and Negan Smith . Dwight was originally supposed to appear in \" Here's Negan \" instead of Laura , but due to the COVID-19 pandemic, it wasn't possible for Austin Amelio to reprise the role as he was busy filming for Fear the Walking Dead . Dwight is the second main character to later become an antagonist. The first being Shane Walsh , the third being Spencer Monroe , the fourth being Eugene Porter , the fifth being Anne , the sixth being Gregory , the seventh being Leah Shaw , the eighth being Lance Hornsby , and the ninth being Pamela Milton . Dwight appears in the final flashbacks of the last episode \" Rest in Peace \". Dwight is one of three main characters to end the TV Series with an unknown status, the others being Morgan Jones and Anne . Dwight is one of three characters to move over to Fear the Walking Dead after leaving The Walking Dead alongside Morgan Jones and Sherry . As of \" More Time Than You Know \", Dwight is one of the two named characters from Season 5 confirmed to still be alive, the other being his wife Sherry. As of \" The Raft \", Dwight has more appearances in Fear the Walking Dead than he does in the original series . A red kite is a medium-large bird with a wide spread. Red kites are highly monogamous and pair bond, mirroring Dwight's loyalty to Sherry. Dwight is one of seven antagonists to survive in Fear the Walking Dead . The others being Tracy Otto , Isabelle , Victor Strand , Hawk , Odessa Sanderson , and Alex .",
        "References[]": "",
        "Name": "Dwight"
    }
]