[
    {
        "Overview[]": "Although he only appeared in one episode, Eastman was shown to be a highly intelligent, caring and peaceful person who was a strong, determined survivor. Before the apocalypse occurred, Eastman suffered a terrible tragedy at the hands of one of his former patients, Crighton Dallas Wilton who murdered his whole family and thus inspired Eastman to take revenge. Eastman was eventually able to achieve revenge against Wilton by capturing him and starving him to death in a cell. Eastman appeared to regret this later on and claimed that Wilton's death brought him no peace, and it was from this incident that he vowed to never kill another human being again, a vow he maintained for the rest of his life and is what finally brought him peace. Despite this he seemed to be close to the edge on a few occasions after meeting Morgan when he attacked him and destroyed a personal memento made by his daughter. Despite his passive nature, Eastman was also a very capable fighter with his mastery of Aikido and was easily able to fend off the dead and also Morgan in his crazed state. Eastman also seemed to show a degree of respect to the Walkers as after putting them down he would bury them in a homemade cemetery with grave markers reading their real names which he got off of their driver's licenses. During the time they knew each other, Eastman passed his wisdom and knowledge onto Morgan and effectively returned him from insanity and became a good friend, mentor and almost father figure to him. Eastman's care for Morgan was very apparent as he saved him from being attacked by one of Morgan's zombified victims, causing his own demise in the process.",
        "Pre-Apocalypse[]": "Eastman was a forensic psychiatrist working for the prison system. He had a wife, son, and a daughter and lived in Atlanta. He and his wife also built a cabin before their daughter was born. At some point Eastman took classes for Aikido. Throughout his career Eastman interviewed over 825 convicted criminals, however he claimed that the only truly evil one he ever met was a man named Crighton Dallas Wilton . While a model prisoner in the eyes of the prison staff, Eastman saw Wilton for what he was, an evil, manipulative psychopath. When the time for Wilton's parole came up, Eastman was the one to interview him and it was here that Wilton realized that Eastman had seen through his façade and attempted to kill him. Thanks to his Aikido training, Eastman was able to repel Wilton and deemed him unsuitable for release. Following this, Wilton was able to escape from prison after manipulating the prison staff but instead of fleeing, he went to Eastman's home and savagely murdered his wife, daughter, and son. Following this he surrendered to the police and claimed the only reason he broke out was to destroy Eastman's life. Despite the murders, Wilton was somehow spared the death penalty, which enraged Eastman who then set out to enact revenge on Wilton. A year later, Eastman kidnapped Crighton from prison and put him in a makeshift cell that he had built in his family's cabin; Crighton died 47 days later of starvation, and was later buried.",
        "Post-Apocalypse[]": "After Crighton's death, Eastman decided to return to Atlanta to turn himself in as he felt remorseful for what he did to Crighton and received no peace from his death. When he made it to Atlanta, he discovered the apocalypse had already occurred and he then went back to his house to cut out a drawing that his daughter had done on one of the walls, losing his car on the way back and forcing him to return to his cabin on foot. Eastman later claimed that walking through 30 miles of the dead just for the piece of drywall was the best thing he ever did. Eastman survived at the cabin by gardening, scavenging, and defending himself with Aikido, while swearing to never kill another human being ever again. He also kept a goat named \" Tabitha \" for company and to help him make cheese, and maintained a sizable graveyard for every walker he has ever killed, using IDs that he finds on the walkers to carve their names into grave markers and marking the few that he can't identify as John and Jane Does.",
        "Death[]": "Killed By Morgan Jones (Indirectly Caused) Himself (Indirectly Caused) 20's Man (Infected, Alive) Upon seeing an undead man, Morgan has an episode of PTSD and freezes in place as Morgan had previously strangled him to death. Eastman rushes in to put down the walker before it can harm Morgan, and pushes him out of the way and is bitten in the back. Eastman then puts the walker down. Morgan Jones (Before Reanimation) With his infection worsening, Eastman tells Morgan \"I'm ready,\" and tells Morgan he has a gun outside. Eastman presumably dies from the infection and is then put down by Morgan to prevent reanimation and buried in his cemetery.",
        "Killed Victims[]": "This list shows the victims Eastman has killed: Crighton Dallas Wilton (Caused) Jolleen Mara (Zombified) Tyler Mathis (Zombified) David Basher (Zombified) Barry Mardole (Zombified) Katherine Rudin (Zombified) Gabriel Marron (Zombified) Kairen Sprang (Zombified) Emilio Grital (Zombified) 20's Man (Zombified) At least 2 Jane Doe's (Zombified) At least 1 John Doe (Zombified) Himself (Indirectly Caused) Numerous counts of zombies",
        "Appearances[]": "",
        "Trivia[]": "His weapon of choice is a wooden staff . Eastman is the first character to prefer the staff. Following in his footsteps are Morgan Jones , Benjamin , Henry and Lydia all of which Eastman is directly or indirectly responsible for through his mentoring of Morgan. The marker Morgan made for his grave read \" E. Eastman \". John Carroll Lynch speculates that his first name is Elwood , named after Elwood Blues. Eastman appears to be ambidextrous, as he is shown using a fork and a pencil with his left hand, but also using his staff with his right hand. Eastman's death is similar to Dale 's; Carl was responsible for attracting the walker that disemboweled Dale, while Morgan was responsible for attracting the walker that bit Eastman; both characters were eventually put down later, and both voluntarily, before reanimating. However, in Eastman's case he may have committed suicide or had Morgan shoot him after reanimation as it is ultimately unclear what he had planned when Eastman led Morgan to his gun. Eastman is mentioned by name in the Fear the Walking Dead episode \" Still Standing \" while Morgan is talking to Grace Mukherjee about how he was taught that \"all life is precious\" . Alongside Josiah LaRoux , he is one of only two known characters to take the time to properly bury their walker kills.",
        "Name": "Dr. E. Eastman"
    }
]