[
    {
        "Eduardo": "",
        "Overview[]": "Eduardo is a loyal and caring man, acting as one of the main guards of the Hilltop . He always acts in his people's best interests and stands up for what's right, such as chewing out Gregory for not giving Maggie an apple, who is pregnant.",
        "Pre-Apocalypse[]": "Nothing is known about Eduardo's life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "Eduardo survived the early stages of the outbreak and took residence in a FEMA camp upon where he was later evacuated to a Safe Zone named the Hilltop Colony . He settled into the farming community and was subsequently assigned as one of the community's guards alongside Kal . Eduardo is on guard at the main gate with Kal when Jesus arrives with Rick 's group and later opens the gates at Jesus' command. When Ethan stabs Gregory and in response Rick kills Ethan, he and Kal rush to confront Rick by pointing their spears at Rick, telling him to drop his weapon. Rick walks over with his gun pointed at them, refusing to do so. Jesus jumps between them and breaks up the conflict, calming everyone down. At night when walkers start flooding into the Hilltop Colony through the open gates, Eduardo is woken up by the commotion. He runs out to his balcony with Kal and witnesses the severity of the situation. Jesus yells out for them to shut the gate to prevent any more walkers from coming inside as he, Maggie and Sasha eliminate the threat. In addition to shutting the gate, he rescues the guards who were bound and strung up by the Saviors . Eduardo is on guard duty as Maggie takes a look from the watch platform. He also reprimands Gregory that Maggie is pregnant as he holds an apple, shooting him a glare. The next morning, Eduardo is on watch duty with another guard as Rick, Michonne , Carl , Rosita , and Tara visit the Hilltop. When Enid convinces the Hilltop townspeople to join the fight against the Saviors, Eduardo is among the residents to gather in front of the Barrington House and pledge allegiance to Rick and his crew, thanks to the recent efforts of Maggie and Sasha, who saved the town from the walker attack that was started by the Saviors days earlier. Eduardo, alongside Wesley , Bertie , Freddie , and other Hilltop members, train in hand to hand combat with Maggie, Sasha, and Enid . When the Saviors leave the community with Harlan later that day, Eduardo watches from the crowd. Eduardo helps Maggie with gardening the plants as she offers him farming tips and Eduardo refers to her as boss lady. Maggie leaves him to continue planting while she transplants a blueberry bush from outside the Hilltop gates. Eduardo and his fellow Hilltop militia arrive at Alexandria to join the fight. As he and the others clear the streets of hostiles, Maggie orders Eduardo and Bertie to cover the houses as they perform a final sweep, giving chase to the fleeing Saviors. They open fire as Negan and his surviving soldiers drive away in their trucks. After the Saviors and Scavengers retreat from Alexandria, Eduardo walks alongside Gabriel as everyone is looking for Sasha as a walker. He later attends Sasha's funeral and listens to the leaders' speeches. Eduardo and his fellow residents help secure sheet metal onto multiple vehicles at the Hilltop. The next day, he is among the militia to listen to the leaders' speeches before they launch their assault on the Sanctuary . Before the attack, Eduardo listens on to Gregory's attempt to dissuade the Hilltoppers from attacking the Saviors but ignore his demands. After successfully ambushing the Saviors' headquarters, he and the others leave in their vehicles so the incoming horde may swarm the factory. Eduardo is among the Hilltoppers to sneak into the satellite outpost that has been re-occupied by the Saviors in order to take it over. He gets into position as the Hilltoppers prepare to assault the unsuspecting Saviors. After a lengthy gunfight, Eduardo and his allies are able to gain the upper hand as the Saviors call a retreat. Before Alden , Jared , and the other Saviors can flee, they are captured by Eduardo and the rest of the militia. He then proceeds to take a Polaroid photograph of the surrendered Saviors. Eduardo is among the militia taking the Saviors back to the Hilltop. While riding on the back of a pickup truck, he tells Tara that Maggie will know what to do with them. When the militia gets ambushed by on coming walkers, he helps defend their prisoners, and watches as Morgan chases after Jared and his chain gang into the woods. Eduardo is among the Hilltoppers and Kingdommers to watch over the captured Saviors at the Hilltop. He helps move the Saviors inside the walls and into the makeshift prison that was built to hold the prisoners. Eduardo and Kal then put Gregory inside the prison as ordered by Maggie. At night, Eduardo is on guard duty at the makeshift prison with Kal and several other Hilltoppers when an angry Maggie storms up to the fence and requests that Dean be fetched from the prison. He is shocked at Dean's execution and saddened to hear of his friend Neil 's murder at the hands of the Saviors. He then helps load Dean's body into the wooden coffin to be shipped to Simon as a message. Eduardo works alongside other Hilltoppers and Kingdommers as they help with improving the town's defenses. Later that day, he is on guard duty with Kal when Rick and Michonne arrive at the gate. Eduardo is among the Hilltop residents and refugees who are prepared to defend the Hilltop from the Saviors. He is atop the wall with Kal, Wesley, Jerry, and Tobin, among others, when the Saviors attack. He and the others open fire and are able to survive long enough until the Saviors are driven away. Eduardo also survives the outbreak sparked by the tainted weapons that leaves several people dead. He is part of a group consisting of Maggie, Jesus, Dianne, Oscar, and Kal doing a sweep of the Hilltop grounds when they find Alden and Siddiq. Alden alerts the group that several Saviors defected and are trying to close the gates to protect the community from incoming walkers. Eduardo and the others then go to assist the Saviors in barricading the gates. Eduardo relieves Kal of his shift patrolling on the Hilltop's walls. When Gregory arrives back at Hilltop with the map Dwight gave him, Eduardo places Gregory back in the now empty makeshift prison. Eduardo remains behind at the Hilltop with Bertie, Kal, and other members of the militia to protect the town and the civilians inside. When the Saviors arrive, Eduardo helps evacuate everyone out of the settlement and into the woods for safety. He later accompanies Tara and Rosita to the Sanctuary to deliver glass and supplies to Frankie and Tanya . Six years later, Eduardo remains living at the Hilltop Colony. [1] However after many months, Eduardo has not been seen or mentioned, making his status unknown.",
        "Killed Victims[]": "This list shows the victims Eduardo has killed: Possibly numerous unnamed Saviors Possibly a few unnamed Whisperers Numerous counts of zombies",
        "Appearances[]": "",
        "Trivia[]": "The casting call for this character used the name Dylan , and later Sonny . [2]",
        "References[]": ""
    }
]