[
    {
        "Edward": "",
        "Overview[]": "Edward is shown to be a brutal, cunning, cruel, and ruthless man. He is a remorseless killer, who goes along with robbing and murdering other survivors, such as helping hold a man for Owen to slit his throat. However, despite his brutal nature, Edward is shown to not be the most combat-proficient, losing every fight he was in. He attempts to sneak attack Morgan while Owen distracts him, but misses, and the two eventually get subdued. Later, Edward surrounds Morgan again, this time with four other Wolves and they still aren't able to kill him. Finally, he attempts to kill Rick in an RV but misses all of his shots which costs him his life. Strangely, during the attack on Alexandria, after Morgan tells them to flee since the Alexandrians have guns and they don't, Edward takes his advice and retreats with the others. This is quite strange behavior, as the Wolves are usually shown to be relentless and bloodthirsty when killing others. Before leaving, Edward tells Morgan that the Wolves didn't choose their way of life, suggesting they possibly resorted to killing others out of desperation.",
        "Pre-Apocalypse[]": "Nothing is known about Edward's life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "Edward first appears when the leader of his gang gives him a signal to kill Morgan Jones from behind using his blade. He misses Morgan and gets knocked out after the two brawl. He is later put inside of a car. It is not shown how Edward and Owen get out from the car, but they eventually stumble upon the Red Poncho Man whom Daryl Dixon and Aaron , two recruiters for the Alexandria Safe Zone , were following earlier before they lost him. They bring the man to their headquarters and slit his throat. They soon discover Aaron's bag, along with the photos of Alexandria inside it, which leads Edward and his people to their next target - Alexandria itself. Edward and his group attack Alexandria. During the attack, he recognizes Morgan and he and four of his companions surround him and attempt to kill him. Morgan manages to fend them off with his quarterstaff and tells them that there are guns in the safe zone and that they will all be killed if they stay. Morgan also tells them if they choose to continue living this life, they will die. He then tell the Wolves to leave and never come back. Edward tells Morgan that him and his group didn't choose this life and he and his companions flee the Safe Zone. Before leaving, Edward steals a gun from a slain survivor. Alongside another Wolf, Edward attacks Rick Grimes while he is in the RV for luring the horde. After a struggle, Rick kills both Wolves with his revolver. Aaron has a dream of Edward, alongside a Savior and some Whisperers killing him.",
        "Death[]": "Killed By Rick Grimes While trying to attack Rick, Edward is knocked to the ground and is shot in the head by Rick soon after his companion is killed.",
        "Killed Victims[]": "This list shows the victims Edward has killed: Noah's Brother 2 (Caused and/or Direct, Alive) Noah's Mother (Caused and/or Direct) Noah's Brother 1 (Caused and/or Direct) Red Poncho Man (Caused, Alive) Dinesh (Caused and/or Direct) Stacy (Caused and/or Direct) Michael (Caused and/or Direct) Natalie Miller (Caused and/or Direct) Bobby (Caused and/or Direct) Samantha (Caused and/or Direct) Charlyne (Caused and/or Direct) Jeffery (Caused and/or Direct, Alive) Richards (Caused and/or Direct, Alive) Possibly numerous unnamed Shirewilt Estates residents (Caused and/or Direct) A few camp residents (Caused and/or Direct, Alive) Numerous counts of zombies and unnamed people",
        "Appearances[]": "",
        "Trivia[]": "This character is credited as Other Man in \" Conquer \" and as Blond Wolf in Season 6 . While not having an official name, his actor confirmed that he named his character Edward . Edward appears in Aaron 's nightmare in \" Out of the Ashes \", despite him and Aaron never encountering each other."
    }
]