[
    {
        "Ellen Ford": "",
        "Overview[]": "Ellen is a protective mother, putting her children's safety above all else. After witnessing her husband, Abraham brutally kill multiple people, she takes their kids and leave him after seeing how truly vicious Abraham can be. However, this decision sadly ends up getting herself and her children killed. Her death along with their kids almost lead to Abraham committing suicide if not for Eugene appearing and giving him a new purpose in life.",
        "Pre-Apocalypse[]": "Nothing is known about Ellen's life prior to or as the outbreak began, except that she was married to Abraham and they had two children, Becca and A.J.",
        "Post-Apocalypse[]": "Ellen is seen in a grocery store with her kids after Abraham kills multiple people, presumably because they attacked Ellen as she is seen with a black eye. They are terrified of what Abraham has become and are seen hiding under a counter as Abraham kills the survivors. Ellen and the kids leave the next day, and upon finding a car, they are attacked and devoured by walkers, later being found dead by Abraham.",
        "Death[]": "Killed By Abraham Ford (Indirectly Caused) Herself (Caused) After Abraham brutally killed a group of men, Ellen was so terrified of him that she took the children and ran from him. Zombies Ellen and her children run away from Abraham, being afraid of his brutality. However, they are attacked and devoured by walkers. The next day, their torn apart bodies are discovered by Abraham outside the grocery store.",
        "Killed Victims[]": "This list shows the victims Ellen has killed: Herself (Indirectly Caused) A.J. Ford (Indirectly Caused) Becca Ford (Indirectly Caused) Possibly numerous counts of zombies",
        "Appearances[]": "\" Self Help \" (Flashback) \" Variant \" (Archive Footage, Corpse)",
        "Trivia[]": "Ellen appears in the archival footage shown at the beginning of \" Variant \" as Judith narrates past events of the show to the audience before the episode's story begins."
    }
]