[
    {
        "Overview[]": "Enid is initially cold and untrusting to the group. When Carl follows her out of Alexandria , she seems to show interest in him. She is shown to very cynical about the world, saying it belongs to the walkers and they just live in it. She briefly leaves Alexandria after it is attacked, stating she is afraid of losing people. However, Glenn convinces her to come back. When Alexandria is swarmed by walkers, she loses hope, but Glenn doesn't want to give up and tries to convince her to help. She appears to be this way due to witnessing the death of her parents. After some convincing, Enid finally caves in and helps Glenn, making a plan to save Maggie , refusing to stay behind. After this event, Enid is still very distant, but sneaks out of Alexandria less, eventually stating she doesn't want to go out anymore. Overtime, Enid tries to contribute to the community more and more. Eventually she becomes closer with Carl and become romantically involved. She becomes devastated by his death. After the All Out War, Enid is taken under the wing of Siddiq , becoming a doctor. At one point, she is forced to help Aaron , whose arm got crushed under a log. She manages to save him by amputating the arm. Before her death, Enid showed her bravery and strength and fought to the end against the Whisperers , a far cry from the cold and cynical girl she started as.",
        "Pre-Apocalypse[]": "Not much is known about Enid's life prior to or as the outbreak began, except that she was living with her parents. She also used to cut her father 's hair.",
        "Post-Apocalypse[]": "Enid and her parents had been surviving on their own for an extended amount of time. While trying to jump-start their car, Enid's parents were killed by a swarm of walkers, leaving Enid by herself. Following their tragic deaths, she wandered in the wilderness for several months, and in order to survive, she followed her own mantra and had to recur to basic survival methods, such as eating what she could gather and sometimes wild animals like turtles. Eventually, Enid wandered up to the gates of the Alexandria Safe Zone , albeit reluctantly, and was welcomed in by the community. She lived with Olivia during her stay, and it took her three weeks to say a single word to anyone because of the shock that she had experienced outside. As time passed by, Enid entered into a relationship with Ron Anderson and, because she was convinced that Alexandria would fall sooner or later, she started to sneak out of the community and spend time wandering around the woods to remind herself what the actual world was like. Eight months after her arrival at the safe-zone, Enid lingers outside the walls when Rick Grimes ' group approaches the safe-zone gates. Carl looks around and sees her watching from one of the burnt houses. When Ron introduces Carl to Mikey and Enid, she acts cold towards Carl, after noticing he is overwhelmed by his new environment, and simply keeps reading her comic book on the bed. Later that day, Enid climbs over the fences and sneaks out of Alexandria into the woods. Carl tries to follow her, but she gives him the slip and goes to an unknown place. When Enid returns to the community, she witnesses the confrontation between newcomer Glenn Rhee and Aiden Monroe . Carl then asks her if she doesn't like him, but Enid ignores him. When Enid leaves the community again, Carl tries to follow her again but appears to lose sight of her. She suddenly calls him out from an unseen location, saying that he is too loud. He tries to persuade her to go back, but she tells him that he scares her. Enid then invites him to run along with her into the woods. While they are resting, Carl tries to ask about her past, but Enid just remarks that they belong outside the walls. A group of walkers approach and they hide inside a hollow tree trunk. She says that the world belongs to walkers now, and the survivors are just living in their world. He briefly touches her hand and leans in to kiss her, but stops, and Enid teases him that he is afraid of her too. When they return to Alexandria, Enid witnesses the brawl between Rick and Pete Anderson . The night of Pete's execution by Rick, Enid is sitting by the pond when Carl comes in and sits next to her. She holds his hand while Ron watches from afar. Enid tries to get into Carl's house after the Wolves infiltrates Alexandria and brutally slaughters its citizens. Carl believes he is under attack, but opens the door to find Enid, who is shocked to see him pointing a weapon at her. She tells Carl that she is leaving Alexandria and came to say goodbye. Carl refuses to let her go outside and makes her help him protect his sister Judith from the Wolves. Whilst on guard, Enid tells Carl that Alexandria is too big to protect everyone. Carl tells her not to tell him goodbye, to which Enid replies that she won't. When Ron is being chased by a Wolf in the streets, Enid and Carl leave the house to help him. Carl shoots the Wolf and tells Ron to come inside for protection, but Ron refuses due to his strained relationship with Carl and leaves. Sometime after the attack, Enid keeps her promise to Carl and quietly leaves the safe-zone, only leaving behind a note for him to find that says \"Just Survive Somehow\". After Enid spends the night in an abandoned town, she spots the next day as Glenn emerges from under a dumpster following the semi-failed herd movement plan, and throws him a water bottle down. She informs him that Alexandria was attacked and then runs away before he can question her further. Glenn chases Enid into the street but loses her. Enid manages to remain hidden for several hours around the abandoned buildings of the town. When she hides from walkers inside a restaurant, Glenn finds her and orders her to return to Alexandria. She points a gun at him but begrudgingly complies when he wrests it away from her. As they are making their way back to the safe-zone, Enid confesses the reason she left was that she is afraid of losing the people she cares about. Later that day, they come across green balloons left over from the walker-herding mission, and Enid suggests they use them to distract walkers. Glenn directs her to a bush concealing more balloons and a helium tank. As Enid inflates more balloons, Glenn lectures her about acting rashly out of fear. They then arrive at Alexandria to find it surrounded by walkers. Enid's mood sinks but Glenn insists they forge ahead. Enid and Glenn watch as walkers swarm into Alexandria from afar. She looks on with tears, beginning to walk away when Glenn stops her. He informs her that you lose people when you walk away from them and their troubles more so than when people die horrifically. Later that day, they climb a tree to get a closer look at the horrors going on in Alexandria when they spot Maggie trapped on an unsteady guard tower. Enid's hope shrinks even more after seeing this. Enid and Glenn carefully sneak into a church outside of Alexandria to search for weapons that may be hidden that they could use to save Maggie. Whilst searching, Enid finds a Bible quote on the church walls: \"Faith without works is dead.\" This reminds her of the loss of her parents. She asks Glenn what he meant when he said if you run, you lose people, even after they're gone. He tells her that she has to hold on to who she is to honor those who have made her the person she is and that her parents are not dead because Enid is alive. When Glenn asks her to stay at the church whilst he saves Maggie, Enid utterly refuses, saying that she can handle herself and insists she will help him save her because he was right that they must not give up on Alexandria. Enid formulates a plan to get Maggie down and informs him that she will follow him even without his consent. She eventually finds a gun and hands it to him. When asked once more to stay at the church, Enid refuses again. Later that night, they enter Alexandria. Glenn distracts the walkers by shooting them, drawing them away from the platform Maggie is trapped on whilst Enid runs over to Maggie and climbs up and joins her, where they see that Glenn is becoming overrun by walkers, but they are relieved when Abraham Ford and Sasha Williams open fire on the walkers, saving Glenn's life at the last minute. Enid and Maggie are helped down shortly after. Enid and the others then get into the truck that Daryl , Sasha, and Abraham used to return to Alexandria and leave a fuel trail, then light it on fire, luring the walkers in and killing a large number of them whilst Rick and the Alexandrians kill the rest of the walkers. She helps others by slaughtering walkers. The morning after all the walkers have been killed, Enid rests outside the infirmary with the other Alexandrians. In the following weeks after the invasion, Enid would sneak from the community less often but would still keep to herself and avoid interacting. One morning, Maggie finds her alone reading a book and thanks her for helping Glenn save her during the invasion, before encouraging Enid to pitch in and help get Alexandria back on track. She then reminds her that she's around if she wants to talk and leaves as Enid considers the proposal. Later that day, Enid and Carl are walking in the woods when she wonders why they keep coming out there. \"Because we're kids, that's what they do,\" says Carl. \"We're not kids,\" Enid mutters in response. When they hear a noise, Enid hides and Carl draws his gun, but they relax once Carl realizes it's just Spencer and Michonne . Enid announces that she doesn't want to come out anymore. As they head back, they encounter a zombified Deanna . Over Enid's protests, Carl tries to draw it toward him and stops her from killing it. He then tells to go home and she leaves. Enid is in the pantry when Maggie stops by to eat lunch before starting another shift. However, she insists that she would cover Maggie's shift so she can rest. Later that day, Enid arrives at Maggie's where she asks for Enid's help. She cuts her hair, and Maggie smiles at her new look. Enid then watches in shock as Maggie doubles over in pain and collapses to the floor, screaming as she clutches her stomach. Whilst the group is planning to take Maggie to the Hilltop Colony for medical treatment, Enid pleads with Carl to join the trip but he refuses and locks her in the armory after tricking her to get a gun. Enid screams at Carl, asking what will happen if he and the others don’t return. \"Just survive somehow,\" Carl says, echoing her personal mantra. Enid is hallucinated by Rick in an idyllic dream with the rest of the group at Alexandria having dinner outside. Enid is present in the church with the other Alexandria residents when Rick calls a meeting in an attempt to locate the missing guns. Later on in the street, David and a group of Saviors taunt Enid over some green balloons, the same ones that she and Glenn used to get Maggie's attention during the herd invasion. David makes Enid say please a few times before touching her cheek and warning her to be careful next time. Following the recent events, Enid decides to head to Hilltop to check on Maggie. While climbing the wall to leave Alexandria, Carl approaches her and reminds her Hilltop is far away and she shouldn't go alone. She ignores him and leaves. Later that day, Enid rides a bike down an empty road, where she encounters a walker. Out of nowhere, Carl ramps into the walker and comes out of the crashed car. He says he has decided to join her. As they walk down a road, Carl tells her he is glad he watched as Negan killed Glenn and Abraham because he needed that memory. He knew it would motivate him to kill Negan. Later that day, Carl finds roller skates in a backpack on the side of the road. He and Enid hold hands and smile as they skate down the road. Upon arriving at Hilltop, they see as several Saviors are loading up their trucks. Enid realizes that Carl left Alexandria not to accompany her, but to track down Negan and kill him. She asks Carl not to go, but he sticks to his mission. Carl kisses her forehead, leading them to share a romantic kiss with each other. When the Saviors leave, Enid enters the community and ties up the green balloons to what she believes is Glenn's grave. Maggie finds her and they hug. That night, Enid cooks dinner for Maggie in Jesus' trailer. Sasha joins them and asks why balloons are tied to Abraham's grave. Maggie tells Enid she didn't have the heart to tell her it was the wrong grave while Enid says there was nothing marking the plots. Maggie then gives Glenn's pocket watch to Enid, saying they don't need objects to remember their dead. They sit around the table, take each other's hands and pray. Enid cooks for Maggie in the trailer, as Sasha talks with her about Jesus. As Maggie leaves, Enid asks Sasha why she lied about Jesus ' absence. Sasha tells her she doesn't want Maggie to know she's going to try to kill Negan. Unfortunately, Enid tells her she's not the only one who wants to kill Negan. Sasha then begs Enid to keep it a secret between them and she reluctantly agrees. The next day, Enid watches when Rick and his group members arrive at the Hilltop. When the group reunites, she smiles at Carl. The whole group then walks towards the Barrington house. After Rick and the others fail to get Gregory to join in the fight against the Saviors, Enid tells them to come outside and informs them she convinced the Hilltop residents to join the fight after telling each one of them the plan. The group looks at her proudly for her initiative. Enid smiles at Carl and then watches as the group parts ways to the Kingdom. In the following days, Enid helps Maggie regards the bustling Hilltop community. She gives residents knife-throwing lessons, in preparation for the war against the Saviors, and also accompanies Maggie as Harlan gives her an ultrasound scanning. When Enid and Jesus beg Sasha to delay her mission to kill Negan until more people can join her, she refuses. Sasha then hands Enid a bracelet for Maggie's baby and tells her to work on it while she's gone. Enid is unconvinced and warns Sasha she'll give her a ten-minute head start before telling Maggie what's going on As Kal warns that the Saviors are coming towards the community, Enid guides Maggie and Daryl to a root cellar to hide until they leave. She then tries to distract Roy as he walks toward the cellar doors, but is unsuccessful and he enters the cellar after taking away her knife. However, Maggie and Daryl are not found and the visit continues without further problems. When the Saviors leave the community with Harlan, Enid watches from the crowd. Enid accompanies Rick and the others to Oceanside on the mission to take the community's weapons. As they keep guard, she asks Carl if he ever thinks about the people he's killed, to which he says he does, leaving her baffled. Upon arriving at Oceanside, the group holds the Oceansiders hostage as Rick explains he doesn't want to hurt anyone. When Natania appears holding Tara at gunpoint, Enid stands unnoticed behind her and aims her gun ready to shoot. After several walkers approach the community, Cyndie knocks Natania out and Enid stares in shock, having been relieved of the necessity to kill Natania herself. She then helps the group and the Oceansiders take out the herd. Once the threat is over and the group starts gathering the guns, Carl tells Enid he also thinks about the people he didn't kill. After Rick leaves Judith at Hilltop for her safety and informs the group about his plan to fight against the Saviors early than planned, Enid tries to convince Maggie and Jesus to go to Alexandria for the fight. She then gives Maggie Glenn's pocket watch, picks up Judith, and takes her into the next room. Later that day, Enid arrives at Alexandria alongside Maggie, Jesus, and the other Hilltoppers, to help the Alexandria residents fight against the Saviors. After achieving the first victory for the Militia, Enid walks alongside Carl and Dianne as everyone is looking for Sasha as a walker. She later attends Sasha's funeral and listens to the leaders' speeches. Enid is among the militia to listen to the leaders' speeches before they launch their assault on the Sanctuary. As the others prepare for the upcoming assault, Jerry tries to persuade Enid to wear some armor for additional protection, despite her politely declining his requests before giving in. Enid then joins the militia as they launch their assault on the Sanctuary. She listens on to Gregory's attempt to dissuade the Hilltoppers from attacking the Saviors but ignore his demands. After successfully ambushing the Saviors' headquarters, she and the others leave in their vehicles so the incoming horde may swarm the factory. Having successfully trapped the Saviors on their headquarters surrounded by walkers, Enid and some of the other Hilltoppers returned to the community to wait while the rest of the militia attacked the Saviors outposts. While on guard duty, Enid spots Gregory arriving in the car he took from Gabriel at the Sanctuary. When Maggie accepts to let him back inside after listening to his pathetic cries, she explains to a shocked Enid that he isn't worth killing. When Maggie scolds Gregory as she confronts Jesus about giving away the Hilltop's food to the captured Saviors, Enid escorts him back inside. The next day, Enid tells Jesus that Maggie has ordered the Saviors inside the Hilltop where they will remain in a newly build holding pen. She then looks on as Gregory is put in the same prison. In the office, Aaron talks with Enid about the loss of Eric and the weight he is carrying as a result. Maggie says the feeling doesn't go away but it helps to do something about it. When Aaron is planning to go on a mission to make sure they win, Enid rushes outside and says she wants to go with him. Aaron tells her to grab her stuff and some food and says they might be gone for a while. She goes back inside to pack while Aaron waits for her. While they are driving towards Oceanside to convince the women to join the militia in the fight against the Saviors, Enid tells Aaron she plans to leave them a truck of supplies in the outskirts as a symbol of good faith. That night, they get ambushed by the Oceansiders and Enid is forced to shoot Natania before she can kill Aaron. They are then taken hostage by Beatrice and Kathy . Enid and Aaron are handcuffed in Natania's house by Cyndie , Rachel , Kathy, and Beatrice. The Oceansiders decide to leave the decision on what to do with the two Alexandrians to Cyndie, seeing as Natania was her family. While alone, Enid tells Aaron that Natania made her kill her and she would do it again. The Oceanside crew comes back in and unchains them, only to stand them up and handcuff them again. \"You better have a good reason for killing us other than to make yourself feel better because it won't,\" Enid says. She warns Cyndie that her group will come for them if they are killed and eventually take them out completely. Cyndie changes her mind and sets them free. Taking them to the forest, Cyndie refuses to join the fight, feeling that what they've already contributed was enough. She gives a warning for them to never return to the community. Enid briefly confronts Cyndie about their communities killing of newcomers, but is only met with the same warning. When Aaron insists on staying at Oceanside, despite their warning and reluctance to fight, to try and convince the community to join their forces, Enid is adamant but accepts his decision. He orders Enid to return to the Hilltop and inform Maggie of his plans, imploring her not to return for him. She then leaves for the Hilltop. When the Alexandria residents make it to Hilltop, Enid is devastated to learn the tragic news about Carl's death and breaks down in tears as Maggie tries to comfort her. When Rosita gives Maggie an attached note from a mysterious crate left outside the community which offers them a \"key to your future\" in exchange for food and records, Enid refuses to accept a meeting due to the possibility of it being a trap. However, Michonne suggests they investigate. The group drives to the designated meeting spot and find two women waiting by a van. A third woman wearing a suit steps out and introduces herself as Georgie . Her bodyguards are Hilda and Midge . She wants to exercise trust. Enid says they're lying. Georgie explains that she can give Maggie valuable knowledge in exchange for food and records. Maggie takes them prisoner instead. At Hilltop, Enid tells Maggie they should take their stuff or someone else will. She thinks people will die here and they should care more about themselves than anyone else. Michonne, however, points out that Carl rescued Siddiq and now they have a doctor and friend. Enid fires back that being brave is what got Carl killed. Michonne tells her to leave, which she does angrily. After Maggie lets Georgie's group leave, Enid talks with Michonne, telling her she killed Natania and she's alive, but Carl died saving someone, and questions on why they should stop fighting. Michonne believes that Carl was telling them that there's more to building a future than simply fighting. When the Saviors show up at the gates of Hilltop to attack, Enid and the militia members prepare themselves to defend the community. The next night when all the wounded in battle mysteriously turned into walkers and chaos unfolds inside the mansion, Enid keeps shelter inside one of the rooms with Rosita and Tara. She is then informed that the Saviors had covered their weapons with guts. The next morning when everyone realizes Henry is missing, Enid comes in to tell everyone that Henry broke into the pen before escaping. Enid remains behind at the Hilltop during the final battle with baby Gracie and the other townspeople. When a group of the Saviors arrives, Enid evacuates into the woods with Gracie and the other survivors. During the year and a half that passed since the end of the war, Enid had become interested in medicine and has been learning under Siddiq . When the group goes to the Smithsonian in Washington, D.C. , to search for a covered wagon and farming equipment for the Sanctuary, Enid takes part in the scavenging mission. While looking around the basement with members of the group, Siddiq gets attacked by a walker whose head is full of spiders. He barely manages to kill it and admits to Rick he is more scared of the spiders, to which Enid laughs at. Shortly after, the whole group reunites and gingerly uses ropes to drag an old covered wagon down the stairs and over the glass floor. The group then leaves D.C. and prepare to head back to their own communities. On the road, Enid and the others are informed by Daryl and Rosita that the main bridge is out due to a storm. Being forced to continue their journey through an alternate route, Enid witnesses as Kenneth is bitten in the arm by a walker and then kicked in the ribs by the horse. She then assists Siddiq while he tries to save Ken but is unsuccessful as he dies from his injuries and then is put down by a sobbing Maggie. That night in Hilltop, a saddened Enid attends Ken's funeral. When Maggie is attacked by a drunken Earl later that night, Enid intervenes but gets pushed to the ground hard and is knocked out. The next day, a wheelchair bounded Enid watches from the crowd as Maggie gives a speech to the residents about the punishment in the community and then orders for Gregory to be executed by hanging to the shock of everyone. Having healed from her injuries in the following weeks, Enid moved from the Hilltop to the work camp to help in the infirmary under Siddiq's guidance. One morning, she is stitching Cyndie's hand when Rick orders Siddiq to return home with the next escort crew. Feeling confident in his assistant, Enid is left in charge of the patients. Later that day, Enid is shocked and horrified when Daryl rushes an injured Aaron to the infirmary after a log fell on his arm while dealing with walkers at the construction site. She examines his injury and quickly decides they need to amputate. Aaron reluctantly agrees as Daryl ties the tourniquet. Enid gains confidence and amputates his arm. That night, Rick visits Aaron to check on him, and thanks Enid for her help. In the years following Rick's presumed death, Enid became the Hilltop doctor and eventually entered a relationship with Alden. Six years later, Enid checks on her patients in the community infirmary and gives a message to Tara for Jesus where she asks for more space on the fields for natural remedies. When an injured Rosita is found in the woods and is brought to the community, Enid helps her and then looks after her while she rests. When Michonne and Siddiq arrive at Hilltop with a group of newcomers, Enid informs Siddiq of Rosita's condition and assures him she would recover soon. Later that day, she goes to the blacksmith tent to check on Henry and, after noticing he is learning fast from Alden, jokes that they should swap places from their communities. Enid then takes Alden aside to talk with him for a moment and leaves after kissing him goodbye. Enid talks with Tara, Alden, D.J. , and Marco to organize a search party for the group that went out to look for a missing Eugene since they haven't returned. Before Alden leaves with Luke, she kisses him and wishes him good luck. When the original search group arrives back later that day, a devastated Enid looks at Jesus' body in sadness and is comforted by Aaron. She then assists the funeral and is among the residents to hammer nails in his coffin. When the ceremony ends, Enid awaits for Alden at the guard post and is assured by Magna that he's in good company. Enid treats Earl for a hand injury and suggests he retire to avoid future injuries, but he refuses. Tammy thanks Enid for helping and assures her Alden will turn up. When Alpha arrives outside the gates with a group of Whisperers to offer trading Alden and Luke for her captive daughter, Enid helps to look around the community for the missing Lydia. Upon being informed that Henry has taken Lydia to a nearby cabin for safety, Enid goes along with Addy into the woods and tries to convince him to give up Lydia so they can save Alden and Luke. She explains she had to watch her parents die and how Carl told her she has to live for more than survival. Henry's torn so Lydia offers to give herself up to save their friends. Enid then watches as Lydia kisses Henry goodbye and the group heads back to Hilltop. Later that day, Enid watches from the gates as Daryl hands Lydia over to Alpha in exchange for Alden and Luke. She then embraces Alden and says she will never let him go. At night, the couple makes love inside their room. Enid is among the Hilltop residents that assist the fair in the Kingdom. She watches from the crowd as Ezekiel declares they've finally accomplished Rick, Carl, and Jesus' dreams of reuniting the communities. \"Let the fair of a new beginning begin!\" Ezekiel says as everyone celebrates and applauds. When Luke tries convincing Alden to perform with him despite losing a bet, Enid accidentally calls Alden her boyfriend, who reacts surprised and accepts to sing for her. At some point later that day, Enid is somehow among the residents kidnapped by Alpha and taken away to a barn in the woods where they are about to be attacked by the Whisperers but are found by Ozzy , Alek , and D.J., giving the group a chance to fight back. During the fight, Enid manages to take down a Whisperer. In the middle of the chaos, Alpha arrives and the group is subdued. She then decapitates everyone as Siddiq is forced to watch, only leaving him alive as a witness. Enid's decapitated head is later put by Alpha on one of the several pikes used for the Whisperers' border. The next day, Daryl, Michonne, Carol, Siddiq, and Yumiko find the border and watch in horror at the victims, a reanimated Enid being among them. They then put down their zombified heads to properly rest. When the group returns to the Kingdom, Siddiq delivers the tragic news and narrates how Enid and the others fought together as a family in their last moments. He finishes the story by encouraging everyone to remember the fallen as brave heroes and to honor them. Enid is remembered in a post-traumatic flashback Siddiq has to the prisoners' last stand. As Siddiq suffers another PTSD attack, he remembers Enid fighting during the prisoners' last stand. During one of his PTSD attacks, Siddiq has a flashback where he witnesses Enid's brutal death at the hands of Alpha.",
        "Death[]": "Killed By Alpha (Alive) In order to mark a border between the land belonging to the Whisperers and the communities, Alpha disguises herself and infiltrates the fair to kidnap several residents. Afterward, she decapitates them and then places their heads on wooden pikes to mark the border, with Enid being among them. Daryl Dixon , Carol Peletier , Michonne Grimes , or Yumiko Okumura (Zombified, Off-Screen) After finding the border, her zombified head is put down by either Daryl, Carol, Michonne, or Yumiko.",
        "Killed Victims[]": "This list shows the victims Enid has killed: Young Boy (Zombified, alongside her fellow Alexandrians) Natania At least 2 unnamed Whisperers (1 Direct, 1 Caused) At least 1 turtle Numerous counts of zombies",
        "Appearances[]": "",
        "Trivia[]": "The casting call for this character used the name Jane . [1] Enid uses the mantra \"Just Survive Somehow\", or \"JSS\", to keep going and not give up in the apocalypse. It's how she made it to the Alexandria Safe Zone . She's first seen using it after her parents get killed. It's possible she used it prior to that, as her parents likely taught her the mantra. Enid is the eighth main character to become a walker, the first being Shane Walsh , the second being Merle Dixon , the third being Hershel Greene , the fourth being Deanna Monroe , the fifth being Spencer Monroe , the sixth being Sasha Williams , the seventh being Simon , the ninth being Tara Chambler , the tenth being Siddiq , the eleventh being Alpha , the twelfth being Alden , and the thirteenth being Lance Hornsby . Enid is the fifth main character to die, reanimate and die again in the same episode. The first was Shane , the second was Merle , the third was Spencer , the fourth was Sasha , and the sixth was Tara . Enid is the eleventh main character to be killed by another main character, the first being Dale Horvath , the second being Shane Walsh , the third being Merle Dixon , the fourth being Hershel Greene , the fifth being Gareth , the sixth being Abraham Ford , the seventh being Glenn Rhee , the eighth being Spencer Monroe , the ninth being Simon , the tenth being Gregory , the twelfth being Tara Chambler , the thirteenth being Alpha , the fourteenth being Leah Shaw , and the fifteenth being Lance Hornsby . Enid is one of four main characters to be go from being billed as a co-star to being part of the opening credits, the others being Carol , Jerry , and Kelly . Enid appears in the archival footage shown at the beginning of \" A New Deal \" as Judith narrates past events of the show to the audience before the episode's story begins. Enid appears in the final flashbacks of the last episode \" Rest in Peace \".",
        "References[]": "",
        "Name": "Enid"
    }
]