[
    {
        "Eric Raleigh": "",
        "Fate": "",
        "Contents": "",
        "Overview[]": "Eric is a kind, caring, and brave survivor. He and his husband, Aaron , had often been outcasted their whole lives due to their sexuality and seemed to be the only people who understood each other. They are shown to care immensely for each other's safety. He and Aaron had the dangerous job as the recruiters for the community, something Eric was brave enough to do before being replaced by Daryl due to an injury he suffered. Eric is generally much less of a fighter than Aaron, often staying in the community and helping. However, he is shown to be willing to put his life on the line to save those he cares about, such as joining everyone in taking out the herd in Alexandria . He is initially hesitant in joining the fight against the Saviors , but eventually becomes a soldier of the militia. When Eric is shot during a fight with the Saviors, he tells Aaron to leave him and help finish the fight. By the time Aaron returns however, Eric has reanimated. Eric's death has a long lasting effect on Aaron, who is clearly devastated by his loss. At one point, he lashes out at Negan , blaming him for Eric's death.",
        "Pre-Apocalypse[]": "Little is known about Eric's life prior to the Trials. Eric was openly gay and grew up on a farm in the Appalachian Mountains in Tennessee with his parents who worked on the land. Growing up, Eric became comfortable with working in nature. Later in life, Eric moved to Washington, D.C. and joined an NGO, with its goal to deliver food and medicine to people in the Niger River Delta. Because of his growing up in nature, Eric was comfortable traversing Nigeria's terrain. Through working in the NGO, he met Aaron in Washington, D.C. Sensing an instant connection, Eric asked Aaron out that night. Aaron declined, but the two became friends and worked together in Nigeria. Eric continued to ask Aaron out for the next six months until eventually Aaron said yes. On their fifth date, Aaron admitted his love for Eric, to which Eric responded: \"I always had a hunch.\" Despite gay marriage not being legal, Aaron and Eric eventually married.",
        "Post-Apocalypse[]": "When the outbreak began, Eric and Aaron survived the initial outbreak. Due to Aaron's previous career as a politician, both were evacuated early from the city and taken to the Alexandria Safe Zone , a neighborhood community guarded by the military, becoming one of the original members of the safe-zone. However, like most safe-zones, it was abandoned by the military due to Operation Cobalt . One of the community members was Ohio congresswoman, Deanna Monroe , and saw potential for the safe-zone to be the restart of civilization. She believed that who people were before mattered in rebuilding the world. Because Eric and Aaron worked for an NGO, survived dangerous terrain, and had to negotiate with hostile people, she saw the two as perfect recruiters for the safe-zone. Over 18 months, Eric and Aaron provided the safe-zone with dozens of good and hard-working people for the safe-zone. Eric is first seen behind a tractor in a distant field as he observes Glenn Rhee , Michonne Hawthorne , Abraham Ford , Maggie Greene , and Rosita Espinosa ; members of the group he and Aaron have been observing, scout out the vehicles on Route 16 that Aaron spoke about at the barn. During his scouting, he finds a license plate for Aaron to add to his collection. Later that night, Eric crawls under a car to hide from a herd, but the walkers end up pushing the car's rear passenger tire onto his left ankle, breaking it. After crawling out, he shoots off his emergency flare for Aaron but is rescued instead by members of Rick Grimes's group. He is reunited with Aaron in a garage building along Route 16. Eric explains that he was fine and that he likes Maggie and the others. They embrace each other, and Eric gives Aaron the license plate he found, but both laugh when Aaron tells him that he lost the car and the license plates in it. Rick intrudes on their reunion, with Eric introducing himself to Rick. Aaron then argued with Rick about being with Eric, with the other members of the group siding with Aaron. Eric spent the rest of the night with Aaron. The next morning, he rests from his injury in the RV as the group completes the journey to the Alexandria-Safe Zone. Eric is seen being helped into the walls by Aaron, limping due to his ankle injury. He then walks away, down the road to the infirmary and put in the care of Pete to heal his ankle. Eric is in the process of being healed and his near-death experience convinced Aaron to retire Eric so that he's not in danger anymore. They considered that Daryl be his replacement since Daryl knew how to defend himself and knows how to read people. Eric's broken ankle is tended by Aaron as they both stayed home and didn't attend Deanna Monroe 's welcoming party for Rick's group. Aaron invites Daryl into their house for dinner after he declines to attend the party. Eric and Aaron are amused by how sloppily Daryl eats, and Eric, believing that Aaron already gave him the news, asks Daryl to find a pasta-maker out on his travels so that they can shut up Shelly Neudermeyer about wanting one. Eric sees Aaron's face and realizes that he hasn't told Daryl about the news, so Aaron reveals that he wants to give Daryl a motorcycle and be Eric's replacement. Daryl then became close friends with Eric and Aaron. Eric is among the townspeople present at the community forum to discuss Rick's fate after his violent scuffle with Pete Anderson in the streets of the town the day before. When he arrives for the meeting, he has another chair set out and reserved next to him for Aaron, should he come back in time for the meeting. He listens to the testimonies and opinions given by both the people of Alexandria and Rick's group. Eric smiles at Carol when she gives her defense about how there are bad people out there and that Rick saved her from them. When Rick brings in a walker that infiltrated the safe-zone, he remains in his seat and isn't shocked during Rick's speech, unlike the rest of the meeting members. He witnesses the murder of Reg Monroe by Pete and execution of Pete immediately after by Rick, on Deanna's orders. Eric is seen attending the meeting in Deanna's house with Aaron about the quarry nearby holding a herd of walkers. After Rick delivers his plan of diverting the herd from the safe-zone, Eric is seen digging and preparing the wall to direct the herd down from the intersection. Shortly after returning to the safe-zone, Alexandria is attacked by the Wolves. As one of the scavengers stabs resident Holly, Eric helps keep guard while Aaron and Rosita take her to the infirmary. Aaron tells Eric that he needs to try to stop this and has Eric stay in the infirmary with the others to help Holly. He assists Dr. Denise Cloyd , along with Tara Chambler and Eugene Porter , as they encourage her to operate on Holly and keep her alive. He assisted by keeping guard as well as giving a blood transfusion to Holly during surgery. As Denise attempted to save Holly from her wound, she started to flatline. Eric became upset and worried for Denise, as Denise then pulled the plug. Denise then demanded that they see if it's clear and leave. Eric then leaves with Tara and Eugene after Holly passes. As he leaves, he grabs Holly's foot as an act of comfort and saying goodbye. Eric is one of the many townspeople by the front gate, listening to the growing horde gathering outside the walls. He appears to be very concerned of the situation and listens to Rick and Aaron as they address the crowd. When the herd invaded, Eric retreated back inside his house with Olivia while Aaron retreated to the infirmary with Heath and Spencer . After Carl got shot and Rick, Michonne, Aaron, Heath, and Spencer lead a defensive strike against the herd, Eric and Olivia join their effort. Eric, Aaron, and the entire able-bodied community defeated the herd in Alexandria, securing their home. Later that morning, Eric was with Aaron, covered in blood, along with the rest of the community outside the infirmary with the bodies of the walkers flooding the streets. At some point during the events of the night, he injured his left leg as he was seen sporting a medical boot. When Aaron is in the line-up to be randomly selected for execution by Negan , Aaron relives his happiest moments leading up to the moment before his possible death, one of them being of Eric and their reunion following Eric's injuring while escorting Rick's group to Alexandria. As the Saviors begin to ransack the houses in Alexandria, Aaron and Eric can be seen standing outside on their porch as the Saviors take their bed along with other pieces of furniture and supplies. Later, Eric is among the townspeople present at the church when Rick informs them that he is no longer in charge and that all guns need to be turned over to the Saviors or Olivia will be killed. Despite being told it was not the time to speak by Aaron, Eric stands up and questions Rick about how they will be able to overcome Negan's rule with or without the guns, to which Rick doesn't know the answer. Eric is among the townspeople to witness Spencer and Negan play pool and the former's death at the hands of Negan. After Rosita attempts to shoot Negan but hits Lucille instead, Eric is horrified as Arat guns down Olivia on his command to kill a resident. When Rick brings an injured Aaron to the scene, Eric rushes over to his side and comforts him. When Negan demands who built the bullet used by Rosita and threatens to kill another person, Arat aims her gun at Aaron and Eric, holding each other and protecting each other, begging for the other not to be killed. Eric is with Aaron when Rick and the others return to Alexandria and is surprised to see Simon and his group of Saviors arrive at the gates. He appears to be nervous and uneasy as Simon and the Saviors ransack through their homes in search of Daryl. He follows Aaron and the others to the pantry and listens on as Aaron comes up with a story as to why the pantry is empty. Back at the gate, he watches the Saviors leave empty-handed. Later at home, Eric comes into the living room, where Aaron is packing a bag to go with others to find Gabriel. They lightly tease each other with dry humor before the conversation takes a serious turn. Eric expresses his concern for Rick not telling the Alexandrians what he plans to do. He asks Aaron to stay and they briefly argue over the matter and Aaron still leaves with Rick. Tara revealed to Rick and the group that she encountered a group with guns while on her supply-run with Heath called Oceanside who had once fought the Saviors but lost, and are now in hiding. Realizing she needs to break her promise in order to acquire the guns and people to win the war against the Saviors, Tara leads the group to Oceanside. Following Tara, Rick brings Eric along with Aaron, Carl, Michonne, Daryl, Gabriel, Enid, Tobin, Francine, Scott, and Jesus. They plan on Tara infiltrating the camp and negotiating with the leader, Natania , for a certain amount of time before falling back on Plan B, which is using explosives and gunfire to draw out the group. While Jesus and Daryl set up the explosives, Eric and Aaron keep guard. In a bittersweet exchange, Eric tells Aaron he reluctantly came along because he's starting to understand what's happening and why Aaron the rest of the group need to resolve it, but adds that he's happy as long as he's with Aaron. When Tara infiltrates the camp and fails to persuade Natania, the group sets off the explosives and directs the residents of Oceanside out of the camp. Eric, Aaron, Daryl, and Jesus cut off a group of women headed towards the gun shed - tying them up and bringing them to the rest of the group outside Oceanside. With the entire Oceanside community outside, Rick attempts to persuade them to give up their guns and help fight the Saviors, while Eric stands guard. When Natania holds Tara hostage, her granddaughter, Cyndie knocks her out. However, because of the explosives and gunfire, it lures in a small herd of walkers. Eric, Aaron, and the others of Rick's group shoots the herd while being assisted by members of the Oceanside. After the battle, Eric helps the group takes the guns from Oceanside, promising to bring them back when the war against the Saviors is done. Eric returns to Alexandria as the group prepares for war. Following their arrival back to Alexandria from Oceanside, the group discovers Dwight's change of allegiance from the Saviors to Rick and the community to ruin Negan - warning them about an attack by Negan because of a mole alerting him of resistance from Rick and the community. With the Scavengers help, Eric and the community prepare for the battle with Negan and the Saviors using Oceanside's guns. On a truck, Eric guards the wall of Alexandria with Aaron. When Negan and the Saviors arrive, the explosives that Aaron, Daryl, and Rosita prepared failed to go off. At that moment, the Scavengers betray Alexandria. One of the Scavengers aim their gun at Eric and Aaron. However, when a reanimated Sasha attacks Negan, Carl leads the attack against the Scavengers and the Saviors during the distraction. Eric and Aaron follow Carl's lead and help against the attack. Eric and Aaron fight the Scavengers and Saviors, followed by the assistance with the Kingdom and Hilltop residents. After driving out the Scavengers and Saviors, the community prepares for war. Eric can be seen next to Aaron after the battle, listening to the speech by Rick, Maggie, and Ezekiel. Eric, along with Aaron, helped prepare for battle against the Saviors. At Hilltop, Eric helped arm the cars with sheets of metal. Shortly before the battle, Eric began to pray despite previous non-beliefs. Aaron catches him praying and Eric tells him that he was always meaning to and that it's never too late. He then attended the speech held by Rick about fighting for a better future. Eric and Aaron then traveled with the militia to the Sanctuary and opened fire against the Saviors and then left the Sanctuary with the others as the herd crew summoned the herd of walkers to the gates of Sanctuary. Eric takes part in the attack on a Savior outpost alongside Aaron and several other members of the Militia. Eric kills several Saviors, becoming distraught when members of the Militia, particularly Francine , are killed. Eric has to be reminded that they just need to hold the Saviors off for awhile and that the rest will take care of itself as the plan is to have the dead Saviors reanimate and turn on their comrades as walkers. Eric becomes pinned down by several Saviors, but is saved by Aaron. Aaron discovers to his horror that Eric has been shot in the abdomen and helps Eric limp away in seek of medical attention. Aaron and Eric make their way to a tree where Aaron finds that the bullet went all the way through Eric. Eric insists on Aaron leaving him to help continue the fight. Aaron reluctantly leaves Eric bleeding against the tree with a rifle to protect himself. After the battle, Aaron returns to the tree to find a massive amount of blood on the trunk and Eric's rifle discarded on the ground. To Aaron's immense sorrow, he spots Eric, now a walker, making his way towards a nearby herd. Aaron is devastated by Eric's death and has to be led away by Scott . It's possible he may have been put down, as about a decade has passed since his reanimation.",
        "Death[]": "Killed By The Saviors (Alive) While attacking a Savior outpost, Eric is shot through the abdomen. He convinces Aaron to leave him by a tree and to go back to keep fighting. Eventually, Eric dies from blood loss against the tree, reanimates and then joins a nearby herd.",
        "Killed Victims[]": "This list shows the victims Eric has killed: Young Boy (Zombified, alongside his fellow Alexandrians) Dino (Alongside his fellow Militia members) Mara (Caused, alongside his fellow Militia members) At least 3 unnamed Saviors Numerous counts of zombies and possibly unnamed people",
        "Relationships[]": "For a more in-depth look at Eric's relationships, read here: Eric Raleigh (TV Series)/Relationships",
        "Appearances[]": "",
        "Gallery[]": "For more images of Eric Raleigh, please visit Eric Raleigh (TV Series)/Gallery .",
        "Trivia[]": "While Eric has been credited as a co-star for Seasons 5 - 7 , he was promoted to a guest star for Season 8 . It was confirmed by the actor of Aaron , Ross Marquand , that Eric and Aaron met through working in the same NGO based in Washington, D.C. and fell in love before the apocalypse. They were living together in D.C. and were among the original survivors of the Alexandria Safe Zone . It was later confirmed by actor of Eric, Jordan Woods-Robinson , that Eric had grown up in the Appalachian Mountains with his parents who were good with their hands and knew the land, that Eric became comfortable with the woods and nature. This allowed him to work well in the NGO's efforts in the Niger River Delta. Among other concepts, Jordan also has said that Eric's last name is Raleigh . His last name was also confirmed by AMC on their press release website. Eric is one of the fourteen TV Series characters whose comic counterparts lack a known last name. The others being Amy Harrison , Andrea Harrison , Dale Horvath , Carol Peletier , Sophia Peletier , Tyreese Williams , Negan Smith , Lucille Smith , Ezekiel Sutton , Yumiko Okumura , Luke Abrams , Maxxine Mercer , and Kayla Brand . Eric is the only person from Alexandria to have an undead status. He is also one of nine survivors classified as being undead, the other eight being Jim , Callaway , Pete Dolgen , Winslow , Matias , Lucille , Clara , and her husband Eddie . While Duane Jones was also classified as undead at the end of the TV Series, he was finally put down in the episode \" King County \" of Fear the Walking Dead . In \" How It's Gotta Be \", Eric is mentioned by Aaron as he talks to Enid about how he used to take road trips in search of survivors to bring to Alexandria. It was also mentioned that several days prior to his death, Eric and Aaron drove to Hilltop to help modify cars with sheet metal as armor for the Hilltop to use in the assault against the Sanctuary . Eric is mentioned several times by Aaron in \" Ghosts \", as he emotionally berates Negan for his role in Eric's death. In regards to the nightmare sequence in \" Out of the Ashes \" where Gracie disappears and Aaron is killed by every antagonist group he has fought against, Ross Marquand revealed that he and Jordan Woods-Robinson shot a nightmare sequence in \" First Time Again \" that was cut. Ross described it as Aaron and Eric in their living room, having a strong discussion about whether or not they should fight the Wolves . All of a sudden, a Wolf comes up behind Eric and slits his throat. His blood shoots onto Aaron's face. In \" Variant \", it is revealed that Aaron considered Eric to be his husband, even though they weren't legally married. This makes them the first LGBT married couple in The Walking Dead franchise, followed by Felix Carlucci and Will Campbell in World Beyond , Tim and his husband in the Clementine series, Magna and Yumiko Okumura in the TV series, and Rèmy and Julien in Daryl Dixon . Eric appears in the archival footage shown at the beginning of \" Variant \" as Judith narrates past events of the show. Eric appears in the final flashbacks of the last episode \" Rest in Peace \"."
    }
]