[
    {
        "Ethan": "Ethan",
        "Overview[]": "After the Saviors kill some of his group and capture his brother Craig , Ethan is told that they will give him back if he kills Gregory. He is shown to be willing to do so in order to get his brother back and stabs Gregory in the stomach. However, this causes a fight between him and Rick 's group, which ends up with Ethan stabbed in the neck. Although an antagonist, Ethan's actions are justifiable, as he was desperate to get his brother back, seeing killing Gregory as a necessity. He clearly cares for his brother, at one point yelling, \"Anyone who tries to stop me is killing my brother!\" Ultimately however, Ethan's rash actions and inability to talk it over with the group is what gets him killed.",
        "Pre-Apocalypse[]": "Nothing is known about Ethan's life prior to or as the outbreak began, except that he had a brother named Craig .",
        "Post-Apocalypse[]": "Ethan and Craig survived the early stages of the outbreak and took residence in a FEMA camp where they were later evacuated to a safe-zone named the Hilltop Colony , upon where Ethan settled into the farming community where he became integrated with the fellow residents, most notably Gregory and Paul Rovia , and thus became a prominent member. Ethan was present at the time of the arrival of the Saviors , a notorious group of survivors who demanded half of the Hilltop's supplies in exchange for leaving the farming community unscathed. Though initially reluctant to comply the Saviors demonstrated their motives through publicly executing a 16-year-old resident Rory . Following this barbaric event, the colony entered into a period of dread and submission and thus were forced to comply under Negan Smith 's rule, were due to their limited resources and manpower they were unable to rebel against their savage oppressors. Throughout the following months, the community begrudgingly began to gather supplies to present towards the Saviors in their desperate attempt to keep them at bay. Ethan was assigned as a member of a supply group tasked with routinely delivering a portion of supplies directed towards one of the Saviors compounds. Approximately 20 months into the apocalypse, Ethan was part of a supply exchange conducted between the Hilltop and the Saviors alongside Craig, Crystal , Andy , Tim , and Marsha . Upon delivering the supplies, Negan personally felt unsatisfied with the amount received and thus had both Tim and Marsha executed and Craig imprisoned located in one of the Saviors compounds. Negan ordered the remaining survivors to return to the Hilltop and, in exchange for Craig's release, was to kill Gregory and return back with his head as evidence of his death. Upon returning from the failed delivery, Ethan reports to Gregory that Negan killed Tim and Marsha because their drop was too light, and that he's holding Craig hostage until they deliver a message. When Gregory asks for the message, Ethan holds his shoulder and apologizes before stabbing him in the gut, creating a commotion. Rick and Michonne attempt to subdue Ethan, and Rick knocks him to the ground. He then begins punching Ethan repeatedly in the face, but is distracted when Andy knocks him away. Ethan manages to get the upper hand and throws Rick to the ground. He then holds Rick at knifepoint, yelling that anyone who tries to stop him is killing his brother. Michonne's attempted intervention provides a momentary distraction, allowing Rick to stab Ethan's throat, killing him in a few seconds due to massive blood loss. His body is later burned in a funeral pyre in the community field where all the residents assist and pay their respects.",
        "Death[]": "Killed By Negan Smith (Indirectly Caused) Himself (Caused) After returning from a Saviors delivery run where his brother Craig was captured by Negan, Ethan tries to kill Gregory by stabbing him in the stomach on Negan's demands, in a desperate order to keep Craig alive. Michonne Hawthorne (Indirectly Caused) Rick Grimes (Alive) After fighting Rick, Michonne gets his attention and Rick stabs him in the throat. Unnamed Hilltop resident (Before Reanimation) After his death, Ethan is put down off-screen before he can reanimate by a resident of the Hilltop.",
        "Killed Victims[]": "This list shows the victims Ethan has killed: Himself (Caused) Possibly numerous counts of zombies",
        "Appearances[]": "",
        "Trivia[]": "Ethan is the first member of the Hilltop Colony to die on-screen. Ethan is one of five Hilltop residents to be an antagonist, the others being Andy , Gregory , Earl Sutton , and Gage . Of these, Ethan and Gregory are the only two to not renounce their antagonistic ways.",
        "Name": "Ethan"
    }
]