[
    {
        "Evan": "",
        "Overview[]": "Evan is as a member of the Saviors and is among those captured from the Satellite Outpost . After Simon shows that he doesn't care about the 38 captured Saviors, Evan becomes disillusioned with the Saviors. When he and some others escape Hilltop , they begin to question where to go. After Rick gives his offer to have them come back to Hilltop, he and many others begin to consider the option. However, this is revealed to be a trick to lower their guard. After they are freed, Rick and Morgan proceed to kill the Saviors. Enraged by this, Evan tackles Rick and attempts to avenge his fellow Saviors, but ends up being subdued and thrown into the walkers .",
        "Pre-Apocalypse[]": "Nothing is known about Evan's life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "At some point in the apocalypse, Evan somehow came into contact with a group named \"the Saviors\" which he subsequently joined. Evan aided his group in terrorizing other survivors and communities around the area into subjugating to Negan's will, where their victims would be forced to give half their supplies in exchange for not being murdered. Having escaped from the Hilltop , Evan and the other escaped Savior prisoners capture Rick and Morgan near the abandoned dive bar they are resting at. With injured comrades, the Saviors argue over what to do, particularly as Rick reveals that a herd is on the way. Jared insists on killing them and to head to the Sanctuary when Rick offers the Saviors a chance to return to the Hilltop and join the community, in which Evan and a few others seem to seriously consider Rick's offer. As the herd attacks the bar, Evan watches in horror as Rick and Morgan kill all of his fellow men in an act of betrayal. Evan angrily attacks Rick and tries to take his hatchet, but is subsequently pushed away by Rick into the path of oncoming walkers, who devour him alive.",
        "Death[]": "Killed By Rick Grimes (Caused) Zombies After witnessing Rick and Morgan unexpectedly kill his companions, an enraged Evan attacks Rick and tries to take his hatchet, but Rick pushes him into the path of walkers, who devour him alive.",
        "Killed Victims[]": "This list shows the victims Evan has killed: Numerous counts of zombies and possibly unnamed people",
        "Quotes[]": "The following is a list of some of Evan's most memorable quotes.",
        "Appearances[]": "\" Still Gotta Mean Something \"",
        "Trivia[]": "Evan's first and only appearance was in \"Still Gotta Mean Something\". He, along with the other credited Saviors in this episode, was not credited nor did he appear in any other Season 8 episode featuring Alden and the other Savior prisoners."
    }
]