[
    {
        "Farron": "",
        "Fate": "",
        "Contents": "",
        "Overview[]": "Farron is shown to be one of the most brutal, savage, and violent Scavengers . After her and her group betray Rick 's group she gets into a fight with Michonne . Despite Michonne being shown to be a very skilled fighter, Farron manages to hold her own and even overpowers Michonne, with her bashing Michonne's head in. Though Farron has the upper hand for the majority of the fight, Michonne manages to subdue Farron by throwing her off a balcony.",
        "Pre-Apocalypse[]": "Nothing is known about Farron's life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "At some point in the apocalypse, Farron somehow came into contact with a group called the \"Scavengers\" which she subsequently joined. They survived by making homemade weapons from junk and scavenging the nearby areas for supplies. Farron was present when Jadis made a deal with an unknown group in possession of a helicopter in exchange for supplies. Throughout the following months, she and her fellow Scavengers would kidnap people, marking them as an \"A\" or \"B\", and then deliver them to the helicopter to be taken to an unknown location and to an unknown fate. Michonne and Farron take sniper positions atop a townhouse as they prepare to battle the Saviors . When Michonne realizes the Scavengers betrayed Alexandria , she turns around to find Farron pointing her weapon at her. As a gunfight breaks out in the streets below, Farron and Michonne engage in a scuffle. As Farron bashes Michonne's head into the ground, Michonne grabs a piece of a broken flowerpot and stabs Farron. However, Farron still manages to overcome Michonne, attempting to throw her over the balcony. With all of her might, Michonne is able to overpower Farron and send her over the balcony to her death. Her mangled corpse is then observed in the streets as Rick and Carl search for Michonne.",
        "Death[]": "Killed By Michonne Hawthorne As Michonne and Farron struggle atop the townhouse, it appears Farron has the upper hand. However, Michonne is able to throw Farron over the railing, sending her to her death.",
        "Killed Victims[]": "This list shows the victims Farron has killed: Possibly numerous counts of zombies and unnamed people",
        "Relationships[]": "",
        "Appearances[]": "\" The First Day of the Rest of Your Life \"",
        "Trivia[]": "Farron is the last named character to die in Season 7 . Farron is the last named member of the Scavengers introduced. Coincidentally, she is also the first named member of the Scavengers to die on-screen. In contradiction, Winslow , who was the first overall named member of the Scavengers to die, died off-screen and before his first appearance as a walker. In a brief interview, Anja Akstin confirmed that Farron is a \"direct gender-bent parallel\" of Connor from the Comic Series, even though Connor was a Savior lieutenant. Anja also revealed that she was a \"lead soldier\" from Jadis' team and she \"personally developed [her] backstory a little more to believe that, as a character, [she] had been ordered to take Michonne in alive, as it was the only reasonable explanation for why [she] didn't just shoot Michonne in the first place and be done with the whole mess. [1] After it was revealed in Season 9 that Jadis and the Scavengers were trading survivors in exchange for supplies from the helicopter group, it is likely Farron was ordered to capture Michonne with the intent of trading her.",
        "References[]": ""
    }
]