[
    {
        "Fisher": "",
        "Fate": "",
        "Contents": "",
        "Overview[]": "Fisher is a vicious, brutal, and aggressive individual. He is shown to be skilled in combat due to his military training and goes along with killing other survivors. However, he does seem to be less skilled compared to his fellow Reapers . When in a fight, Fisher's comrades are shown to be a challenge for the group, such as Austin taking on Daryl and Carver fighting Maggie , Negan , and Elijah at once. Though Fisher is shown to be combat-proficient, such as helping take out a herd of walkers with Austin and Boone , he does seem to struggle more when fighting other survivors compared to the other Reapers. He gets into a fight with Maggie and she is able to hold her own against him. When the Hwacha is fired down at the courtyard, Fisher fails to retreat in time and has to take cover. However, Maggie is also hiding in the same place and the two fight once again. Initially, Fisher does get the upper hand and almost kills Maggie by holding her out into the Hwacha's line of fire. However, despite his superior strength, Maggie manages to overpower Fisher and gain the upperhand. She pushes him into the line of fire and where he is shot and exploded.",
        "Pre-Apocalypse[]": "Prior to the outbreak, Fisher was fighting in Afghanistan along with the rest of his squad which included a lot of members that would eventually become the Reapers . Upon returning from war, he struggled to find jobs or deal with trauma, but the relationship between him and his comrades remained strong. He then decided to become a mercenary.",
        "Post-Apocalypse[]": "During the beginning of the outbreak, as Operation Cobalt was put into action in an attempt to try and contain the undead threat, Pope and a group of his people managed to escape the bombings by running until they reached an abandoned church, where inside Pope was amazed to see none of them had been killed or injured, leading him to view him and his comrades as \"the chosen ones\". It is unknown if Fisher was present during this revelation. Regardless, he eventually joined the Reapers, and either found or crafted his own mask with a ghoulish, skull-like expression on it, and would use this mask as a scare tactic against those who were \"marked\" by Pope. At some point, Fisher and his group eventually attacked a group of survivors led by Maggie Rhee despite having no previous hostilities with her group and succeeded in destroying their camp and killing numerous members of her group, causing them to flee to Virginia. He and his group eventually followed them to finish them all off due to his leader, Pope marking Maggie's group. Fisher and at least a dozen Reapers appear on a dark road adorned on both sides with bodies hanging from posts. Suddenly, the Reapers open fire on Maggie and her group, killing Roy and severely injuring Cole. As the Alexandrians flee into the woods, the Reapers chase after them. Chaos breaks out in the woods as Fisher and the Reapers hunt down members of Maggie's group, killing Cole and injuring several others, including Duncan, Negan, Daryl, and Gabriel. While Daryl is being taken in for interrogation by Carver and Powell , Fisher can be seen amongst his comrades within Meridian . He is later seen waiting with the Reapers as Daryl and Leah emerge from a burning trailer. Fisher is seated around the campfire eating dinner with his fellow Reapers including the newly recruited Daryl Dixon . He is shocked and disturbed when Pope horrifically kills Bossie by throwing him in the fire. Fisher is among the several Reapers who are sent out to check the house their prisoner had said Maggie and the others were hiding in. Paired up in a squad lead by Leah working alongside Daryl, Carver, Powell, Fisher is sent with the last two to breach the back entrance of the home, after which he and his squad-mates check every room in the house before declaring it \"clear\". Leah sends Washington, Powell, and Fisher to check the rest of the town, while she, Daryl, and Carver stay behind to give the building a once over. Fisher is seen witnessing Ancheta and Washington getting admonished by Pope after they failed to find Maggie's group, but Leah comes to their defense. Fisher is among the Reapers on the wall speculating why the herd of undead in the distance are meandering around like that. He later witnesses the walkers return and be blown up by the mines. When Maggie lets a horde of walkers inside the walls, Fisher helps clear the herd with Boone and Austin . Later Gabriel begins to shoot at him with a sniper, but he manages to take cover. He later begins to fight Maggie and gets a walker thrown at him by Negan. He is then told by Leah to fall back. He orders the other Reapers to do the same. As the hwacha fires down at the courtyard, Fisher takes cover. However, Maggie is also hiding where he is. Fisher attacks Maggie as she escapes the hwacha. He gains the upperhand, slamming Maggie into the wall and holding her out in the hwacha's line of fire. Maggie manages to overpower him and push him into the hwacha’s line of fire, where he gets hit by the arrow and explodes as it kills him.",
        "Death[]": "Killed By Maggie Rhee (Caused) Leah Shaw (Accidental) After finding her, Fisher gets into a fight with Maggie. Despite getting the jump on her, Maggie ends up pushing him into the hwacha's line of fire. One of the explosives hits him and blows him up.",
        "Killed Victims[]": "This list shows the victims Fisher has killed: Ms. Adams (Possibly) Leo (Possibly) Teresa (Possibly) Duncan (Possibly) Numerous counts of enemy combatants (Pre-Apocalypse) Possibly unnamed Meridian residents Numerous counts of zombies and unnamed people",
        "Relationships[]": "",
        "Appearances[]": "",
        "Gallery[]": "For more images of Fisher, please visit Fisher (TV Series)/Gallery .",
        "Trivia[]": "In the Memoriam on Talking Dead for \" No Other Way \", he is credited as Baby, You're a Firework! Reaper ."
    }
]