[
    {
        "Overview[]": "Franklin is a kind, caring, and generous man. He is civil with Negan despite him trying to rob them moments earlier, and is quite understanding of his situation. In an act of kindness, Franklin gives Negan the drugs he needs for his wife. Due to being a doctor, he has lots of medicine that are extremely valuable in the apocalypse. However, this also prompts others to steal from him. After Negan sells him and Laura out, he is captured and tortured by Craven until he reveals where he keeps the medicine. Though generally Franklin tries to handle things in a calm manner, he is willing to put up a fight when necessary, hitting Craven with a chair, giving Negan an opening.",
        "Pre-Apocalypse[]": "Nothing is known about Franklin's life prior to or as the outbreak began, except that he was a medical doctor and had an adoptive daughter, Laura.",
        "Post-Apocalypse[]": "At the start of the outbreak. Franklin formed a team of doctors along with his daughter, Laura , where they would offer medical aid to those in need following the same route every time. When Negan makes his way to a small campsite with RVs and two armed guards, and demands that the men drop their guns, Franklin tries to calm him down. Disorientated, Negan notices that the two guards are both dummies just before Laura knocks him out with a baseball bat. Attached to an IV bag, Negan awakens in the clinic, handcuffed to the chair. Negan and Franklin introduce themselves and after checking that they won't have any problems, Franklin releases Negan. Handing him a bowl of food, Franklin comments that Negan has exposure, exhaustion, dehydration and malnutrition and asks why Negan is in that state and trying to rob a bunch of doctors with an empty gun. Negan explains that his wife has cancer and was in the middle of her treatments when the world ended and Negan has been trying to keep it going since then. Franklin asks if Negan's a doctor, but Negan clarifies that he's a high school gym teacher and that, having been given a calendar of what had to be done and when, he had to find the drugs and figure out how to do infusions. Franklin is shocked that Negan was able to teach himself how to give someone chemotherapy, but Negan states that the pumps aren't that complicated unless something goes wrong which has happened. Negan explains that that was about six weeks ago and Negan had figured that he would scavenge along the way, but it was worse out there than he'd thought and he ran into some problems with the dead and here he is. Franklin reveals that he found Negan's note and he sent Laura out to the warehouse to see if they have what he needs. Laura enters, having found the drugs that Negan needs. Franklin tells Negan that they have a lot and just want to help. Walking with Franklin and Laura outside, Negan expresses surprise at the kindness that they have shown him without expecting anything in return. Franklin returns Negan's gun while Laura warns him that a gang owns the roads at night and asks if the empty gun is his only weapon. When Negan is tortured by Craven , he orders Negan to give up Franklin and Laura's location, which he reluctantly does. Craven locks Negan in a closet until he returns, satisfied that Negan was telling the truth and allowing him to leave with the medicine. Negan leaves, sadly realizing Franklin and Laura are being mugged thanks to him. Negan returns to the bar where Craven and his men are torturing Franklin for the location of his drug stash. Negan kills one of the bikers with Lucille and, after staring at the bat in shock for a moment, searches the body and finds a gun. As another biker comes around the corner and finds him, Negan shoots and kills the man. Negan engages in a gunfight with the bikers, killing them all single-handedly before smashing in the glass door of the bar. As Craven shoots at Negan, Franklin breaks free and smashes his chair over the man's back and Negan enters and subdues Craven with a blow to the face from Lucille. As Franklin binds Craven, Negan tells him that he thinks he got all of the bikers. Giving Franklin his gun, Negan tells him to go find Laura and make sure that she's ok. His current location and fate remains unknown.",
        "Killed Victims[]": "This list shows the victims Franklin has killed: Possibly numerous counts of zombies",
        "Appearances[]": "\" Here's Negan \" (Flashback)",
        "Name": "Franklin"
    }
]