[
    {
        "Francine": "",
        "Overview[]": "Francine starts as an inexperienced but feisty survivor. In her first scene, she gets injured after falling off her perch and becomes surrounded by walkers. She's saved by Abraham and the two work together to help clear out the walkers. She is shown to be surprisingly strong, punching Tobin , a man much larger than her, hard enough to stagger him. Francine is also shown to be quite cynical and pessimistic, as during Rick 's speech, she states that Alexandria is already a graveyard due to the numerous casualties they have suffered. However, she later gains the bravery and courage to join her fellow Alexandrians in taking out the massive herd in the community. After this, she becomes a soldier for the militia, fight valiantly against the Saviors until her demise.",
        "Pre-Apocalypse[]": "Nothing is known about Francine's life prior to or as the outbreak began, except that she served in the military and/or a police squadron.",
        "Post-Apocalypse[]": "At some point in the apocalypse after experiencing a lot on her own, Francine joined a community called the Alexandria Safe Zone where, upon being interviewed by Deanna , she was appointed as a member of the construction crew. Over time, Francine aided her crew in gathering materials from a nearby mall construction site to be used for the upcoming expansion of the community's walls, which lasted for around eight weeks. Francine is on lookout duty at the Woodlands Mall construction site as her companions gather materials when the site is attacked by a herd. She falls out of the crate, injuring her leg, but is saved by Abraham . Afterwards, she punches Tobin for having left her to die. Moments later, Francine remains working after Abraham starts leading the team. Francine is among the townspeople present at the community forum to discuss Rick's fate. She is seated next to Erin and listens to her fellow residents as they speak. Francine and the other residents are shocked when Rick suddenly arrives with the corpse of a walker as Tobin was speaking. She also witnesses the murder of Reg Monroe , which she is horrified at, and the subsequent execution of Pete Anderson . Francine attends the meeting at Deanna's house regarding how to handle the mega herd at the quarry. A few days later, she is at the armory with Olivia , Spencer , and Tobin, listening to Carter 's plan to kill Rick and take over Alexandria. Francine is hesitant and does not agree with Carter's ideas. When Rick discovers the complot, everyone accuses Carter of being the only one responsible. In the following days, Francine is among the volunteers to help build the wall on one of the roads to deter the mega herd in the operation to lure it away from Alexandria. When the walkers break free from the quarry and the plan is set into motion, Francine and the others take immediate action. Francine returns to Alexandria and listens to Rick and Aaron as they address the crowd. When Rick insists on making the community as silent as a graveyard, she claims that the town is already a graveyard. Francine takes shelter inside one of the houses when the herd invades the community. That night, she witnesses Rick and other residents slaughtering walkers in the streets and is inspired to join the group where they battle the entire herd for hours until dawn when all the walkers are finally killed. Francine is walking down the street when Carol appears and gives her a container of cookies. Later that morning, she is present at the meeting in the church, listening to Rick's speech about the danger of the Saviors . When Rick asks if anyone objects to the idea of attacking the Saviors for supplies from the Hilltop Colony , she remains silent. When Rick and the others leave in the RV to get Maggie medical care at the Hilltop, Francine and Scott close the gates and remain stationed on guard duty as they watch the group drive away. Francine stands outside with Tobin and Kent watching the Saviors enter Alexandria to raid the community. Later that day, she is among the residents present at the church when Rick informs them that he is no longer in charge and that all guns need to be turned over to the Saviors. When Tara reveals to Rick that she found a community named Oceanside , Francine and her fellow Alexandrians travel to the community to gather guns from the armory. Upon arriving, they set up explosives outside the walls and assume positions among the trees. After the Oceansiders are herded, Francine and the others dispatch a herd of walkers drawn to the site. Afterwards, she helps collect the weapons from the armory and prepares to return to Alexandria. Francine is stationed at the front of Alexandria, crouching on the platform with Aaron, Eric , and Tobin. When the bombs fail to detonate, the Scavengers take everyone in Alexandria hostage. After Carl opens fire on several Scavengers, she joins the battle against the Scavengers and the Saviors alongside her fellow Alexandrians until reinforcements from Hilltop and the Kingdom arrive to the rescue. After the Saviors and Scavengers retreat from Alexandria, Francine attends Sasha 's funeral and listens on at the leaders' speech. Francine is among the militia to listen to the leaders' speeches before they launch their assault on the Sanctuary . After successfully ambushing the Saviors' headquarters, she and the others leave in their vehicles so the incoming horde may swarm the factory. Francine is among the group of Alexandrians to ambush the Shepard office plaza outpost from their vehicles. As they continuously fire at the Saviors, they manage to kill off several Saviors in an effort to have them reanimate and overrun their comrades. However, Francine is gunned down by the Saviors and dies as Eric watches on in horror. When the fight is over, Francine's corpse is covered with a sheet and placed with the other casualties of the outpost attack, where they are later taken back to Alexandria and buried.",
        "Death[]": "Killed By The Saviors (Alive) While shooting against some Saviors, Francine is shot in the chest. The Militia (Before Reanimation or Zombified) After the battle, a member of the Militia eventually put her down either before or after reanimation.",
        "Killed Victims[]": "This list shows the victims Francine has killed: Young Boy (Zombified, alongside her fellow Alexandrians) Dino (Alongside her fellow Militia members) Mara (Caused, alongside her fellow Militia members) At least 1 unnamed Savior Possibly numerous unnamed criminals or enemy combatants (Pre-Apocalypse) Numerous counts of zombies",
        "Appearances[]": "",
        "Trivia[]": "Francine and the other character of the same name from the Telltale Series share a similar cause of death, as they both were killed by gunfire during a battle."
    }
]