[
    {
        "Overview[]": "Frankie is shown to be friendly, energetic, and fun-loving woman. She is quite enthusiastic when Eugene shows them a homemade bomb. However, though she initially seems to be quite happy, this is actually a façade. In reality Frankie is quite scarred and traumatized from being Negan 's wife. As one of Negan's wives, Frankie was often used by him for his own enjoyment. She is shown to be horrified at his heinous acts, such as burning Emmett Carson in the furnace. At one point, she and Tanya ask Eugene to make pills for Amber so she can commit suicide. However, in actuality, the pills are actually intended to kill Negan, showing how much she despises him. After the Savior war is over, Frankie moves to Alexandria and appears to have bettered her life. She has adopted a daughter who she is shown to care greatly about. However, Frankie ends up being one of many people to be kidnapped by Alpha and taken into a barn. When Ozzy , Alek , and D.J. come and try to save everyone, Frankie shows her bravery and fights back against the Whisperers in a last stand.",
        "Pre-Apocalypse[]": "Nothing is known about Frankie's life prior to or as the outbreak began, except that she was a licensed massage therapist, and lived within the San Francisco-metro area.",
        "Post-Apocalypse[]": "At some point in the apocalypse, Frankie somehow came into contact with a group named \"the Saviors\" which she subsequently joined upon where she volunteered to become one of Negan 's \"wives\" in order to avoid working for points. She would also give massages to Negan on occasions. While Negan gives Carl a tour around the Sanctuary , Frankie spends her time in a well-furnished room with Sherry , Amber , Tanya , and a couple of Negan 's other wives. As soon as Negan leaves the room, Frankie and the other women comfort an upset Amber. Later that day, Frankie stands with the other wives and witness Mark 's face being ironed. When newcomer Eugene gives a solution to preserving the walkers used at the gates, Negan allows him to spend that night with his wives but with the only condition of not having sex with them. At night, Frankie, Tanya, and Amber watch Eugene as he plays video games when Tanya jokingly asks if he knows how to make a bomb after becoming interested in his knowledge. Shortly after, the wives accompany Eugene outside and watch as he makes a homemade bomb. The next day, Frankie and Tanya convince a reluctantly Eugene to make some pills so a depressed Amber can commit suicide. She is later present on the factory floor when Dr. Carson is accused of freeing Daryl and is thrown into the furnace and burnt to death as a result of his actions. After watching the grizzly scene, Frankie and Tanya visit Eugene in his apartment where he refuses to hand them the pills after correctly guessing they are for Negan instead. Though unseen, Frankie gives Negan a massage after he escapes the undead swarming the Sanctuary. Frankie is assigned to the new outpost as Eugene's servant, responsible to help with whatever he may need. She expresses interest in Eugene's work and asks him to teach her how to make bullets, but he ignores her request and instead tells her to relay his breakfast order to Tanya. When Negan arrives, Frankie takes a knee along with everyone else and witnesses a captured Gabriel being delivered to Eugene as his newest worker. Frankie and Tanya criticize Eugene's request for a sardine and mac n' cheese dish, with Tanya stating that she can't believe garlic was wasted for that dish. Later that day, she listens to Eugene's speeches about making enough bullets to aid Simon and Negan in the battle against the survivors. Frankie walks around with Amber and Tanya at the Sanctuary as the Saviors prepare for the final assault. After the war ends and Negan is defeated, Frankie starts to dress in normal clothing. She and Tanya greet Tara and Rosita at the Sanctuary when they arrive to fix the glass that was shattered previously by the Militia . At least two years since the conclusion of the war against the Saviors, Frankie moved to Alexandria and adopted one of the Savior orphans, a young girl named Alice . Having passed one year since Rick's assumed death, Frankie enjoys a bonfire with the other Alexandrians and the children in Jocelyn 's group . The next morning, she, along with Scott , Michonne , and Jonah 's par ents , head over to the house where Jocelyn's group was staying to pick up their kids from a sleepover. After finding the house empty and the kids missing, Frankie and the other parents frantically search Alexandria. She checks the infirmary and finds it ransacked and informs Michonne of what she found just as they find Russ murdered by the pantry. The next morning, Frankie watches as Michonne and Daryl return to Alexandria with the kids. She immediately runs over to hug her daughter . Frankie is among the Alexandria residents that assist the fair at the Kingdom. She watches from the crowd as Ezekiel declares they've finally accomplished Rick , Carl , and Jesus ' dreams of reuniting the communities. \"Let the fair of a new beginning begin!\" Ezekiel says as everyone celebrates and applauds. At the fair, Frankie and Alice ask a flustered Henry if he is looking for someone. \"I hope you find them!\" Frankie tells him as he continues his way around the fair. At some point later that day, Frankie is among the residents kidnapped by Alpha and taken away to a barn in the woods where they are about to be attacked by the Whisperers but are found by Ozzy , Alek , and D.J. , giving the group a chance to fight back. During the fight, Frankie and Addy take down a Whisperer. In the middle of the chaos, Alpha arrives and the group is subdued. She then decapitates everyone as Siddiq is forced to watch, only leaving him alive as a witness. Frankie's decapitated head is later put by Alpha on one of the several pikes used for the Whisperers' border. The next day, Daryl, Michonne, Carol , Siddiq, and Yumiko find the border and watch in horror at the victims, a reanimated Frankie being among them. They then put down their zombified heads to properly rest. When the group returns to the Kingdom, Siddiq delivers the tragic news and narrates how Frankie and the others fought together as a family in their last moments. He finishes the story by encouraging everyone to remember the fallen as brave heroes and to honor them.",
        "Death[]": "Killed By Alpha (Alive) In order to mark a border between the land belonging to the Whisperers and the communities, Alpha disguises herself and infiltrates the fair to kidnap several residents. Afterward, she decapitates them and then places their heads on wooden pikes to mark the border, with Frankie being among them. Daryl Dixon , Carol Peletier , Michonne Grimes , or Yumiko Okumura (Zombified) After finding the border, her zombified head is put down by either Daryl, Carol, Michonne, or Yumiko.",
        "Killed Victims[]": "This list shows the victims Frankie has killed: Simon (Possibly, Zombified) At least 1 unnamed Whisperer (Caused, alongside Adeline ) Possibly numerous counts of zombies",
        "Appearances[]": "",
        "Trivia[]": "In a deleted scene from \" Wrath \", Frankie is present with Amber, Tanya, and hundreds of other Saviors in the Sanctuary as they listen to Negan's speech about wiping out the survivors with Eugene's bullets. It is shown in \" Scars \" that she moved to the Alexandria Safe Zone before the Sanctuary fell. It also revealed that she adopted a daughter . Frankie appears in the archival footage shown at the beginning of \" A New Deal \" as Judith narrates past events of the show to the audience before the episode's story begins.",
        "Name": "Frankie"
    }
]