[
    {
        "Gabe": "",
        "Overview[]": "Gabe is a taunting and intimidating individual. He clearly takes enjoyment out of messing with Andy , making fun of him and mocking him. He likes to joke around, such as playing with \" Gregory \"'s head.",
        "Pre-Apocalypse[]": "Nothing is known about Gabe's life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "At some point in the apocalypse, Gabe somehow came into contact with a group named \"the Saviors\" which he subsequently joined upon where he was appointed as one of the Satellite outpost guards. Gabe aided his group in terrorizing other survivors and communities around the area into subjugating to Negan 's will, where their victims would be forced to give half their supplies in exchange for not being murdered. Gabe is on guard duty at the front entrance to the outpost he is stationed at. He orders Andy to halt and inspects Gregory 's head with his fellow Savior, trying to determine if it is real. After an intense few moments, he begins to play with the severed head and wipes his bloody hand on Andy's shirt. Gabe goes inside to retrieve Craig and returns outside where he is suddenly stabbed through the chest by Michonne.",
        "Death[]": "Killed By Michonne Hawthorne (Alive) When Gabe comes back outside with Craig, he is quickly stabbed through the chest by Michonne with her sword. Rick Grimes (Before Reanimation) After he falls to the ground, Rick stabs him in the head to prevent reanimation.",
        "Killed Victims[]": "This list shows the victims Gabe has killed: Possibly numerous counts of zombies and unnamed people",
        "Quotes[]": "The following is a list of some of Gabe's most memorable quotes.",
        "Appearances[]": "\" Not Tomorrow Yet \"",
        "Trivia[]": "Gabe is credited as Savior Guard #2 in \" Not Tomorrow Yet \". The character's name was revealed by Ian Casselberry in an interview, and his name was originally mentioned on the show but the line was cut from the final version. [1] Ian Casselberry also auditioned for the role of Tomas but it was instead given to Nick Gomez .",
        "References[]": ""
    }
]