[
    {
        "Gage": "",
        "Overview": "Gage initially appears to be a friendly teenager, inviting Henry to hang out with him, Addy , and Rodney . However, he is also quite troublesome and immature, shown when he and Rodney begin playing with a walker outside of the walls. After the death of his friends, Gage becomes vengeful against the Whisperers . He begins bullying Lydia , a former Whisperer, to the point of ambushing her at night with Margo and Alfred . When confronted by the council about this, he is shown to be a liar, saying that Lydia was the one who attacked them. He is also quite cowardly, shown when he abandons the group in the subway tunnel . Despite his faults, Gage was just a teenager whose life was cut short due to the apocalypse. Gage did genuinely care for his friends. His main motivation for bullying Lydia being him blaming her for their deaths. He notably hesitates before beating her up, but joins in after being reminded of his friends. His lack of maturity could be due to not having anyone there for him to help lead him in the right direction. He most likely became friends with Margo and Alfred since they all could relate to having lost someone to the Whisperers. However, Margo and Alfred might've also acted as a bad influence on Gage, seeing as they are adults while Gage is just a teenager. The two went along with Gage's bullying and pushed him into beating up Lydia. After Margo and Alfred's deaths, Gage attempts to do some good by going with the group on the dangerous mission to Meridian . However, most of the group members don't seem to care much for Gage. This is most prominently shown when Gage is trapped in a subway train and only Alden and Negan attempt to save him. However Maggie tells the group to not save him since they don't have enough ammo to clear the walkers. Gage begins to beg to be let in, promising he'll be better, but Maggie still refuses. Not wanting to feel the pain of being devoured, Gage kills himself.",
        "Pre-Apocalypse": "Nothing is known about Gage's life prior to or as the outbreak began.",
        "Post-Apocalypse": "At some point in the apocalypse, Gage joined a community called the Hilltop Colony where he lived for half his life. Outside the Hilltop's walls, Gage practices defense moves with Addy as part of his training to become a member of the Hilltop's guard under Kal 's instruction and supervision. Upon noticing a solitary Henry eating away from the other residents, Gage and his friends call him to talk with them. He recognizes him from the war and shortly after, they invite him to hang with them in the woods. That night, Henry drinks with his new friends in a shed outside of Hilltop. Gage suggests they have some more fun and takes them to a covered hole in the ground with a walker inside. Addy leaves as they throw rope rings at it and Rodney pees on it. Henry jumps in and mercy kills the walker. Gage is pissed at Henry for being a buzzkill and leaves him there. Gage is part of Tara 's group in charge of clearing a tree from their path to the Kingdom to ensure the roads are cleared for Alden 's convoy carrying the food and trade goods for the fair. Upon finding a downed tree, Gage remains alert and checks the surrounding area. He keeps on watch as the others help chop the tree into pieces to clear the road. Later that day, a small herd of walkers approaches the group. They get in position and remind themselves to watch for the Whisperers . When Gage is attacked by a walker, Addy rushes in and saves him. Suddenly, the Highwaymen ride up on horses and introduce themselves to Tara after helping to take down the herd. They then escort them to the Kingdom, having accepted Carol 's deal. Upon arriving at the Kingdom, Gage excitedly looks around with Addy and Rodney. Gage watches from the crowd as Ezekiel declares they've finally accomplished Rick , Carl , and Jesus ' dreams of reuniting the communities. \"Let the fair of a new beginning begin!\" Ezekiel says as everyone celebrates and applauds. When Addy talks with Henry nearby, Gage and Rodney introduce themselves to Lydia and tell her that Addy has a thing for Henry, making her uncomfortable. However, she throws goat feces at them as payback. Later that day, Gage asks around for Rodney's and Addy's whereabouts. The next day, Gage listens from the crowd as Siddiq delivers the tragic news about the fate of the missing fair attendees, tells them how brave the victims were in their final moments and how he was intentionally kept alive to tell this very story. He encourages everyone to remember the fallen as brave heroes and to honor them. Some months after the blizzard, Gage is among the coalition members drafted into the militia that was formed in response to the Whisperer threat. He and the other militia conduct a training exercise on the Oceanside beach. As Ezekiel and Jerry methodically release walkers from a shipwrecked boat, Gage and the other militia work together as a unit to take out the walker threat. They are successful and return to Oceanside to rest, eat, and socialize with the Oceansiders. That night, Gage helps put out the fire that was ignited in the woods in Whisperer territory after a satellite from outer space crashes. Gage, alongside the coalition soldiers and Alexandria residents, faces against waves of walkers pouring onto the community gates over the next 49 hours. At first, Gage and Laura are dispatched to take care of a small group of walkers. After the exhausting battle, Gage celebrates by fooling around with his weapon as he and Laura share a laugh. However, they soon notice more incoming walkers and Laura radios back to the community that a new herd of walkers is approaching from multiple directions. In the morning, Gage helps to clean up the community from the corpses while Eugene warns that it will be an hour until the next wave hits. Later that day at an emergency council meeting in Alexandria, Gage demands to Michonne that they should put the Whisperers' heads on pikes. Michonne tells the residents that attacking the Whisperers without a proper plan is not smart due to the large herd in Alpha 's possession. Gage then listens as Michonne tells everyone instead of retaliating, she and a small group will meet with Alpha at the border to work things out. He then continues to work alongside the Alexandrians and coalition soldiers to take out the waves of walkers for the remainder of the day. Gage attends a training session in Alexandria led by Aaron but begins to taunt Lydia with a mask made out of a burlap sack when she approaches the group of soldiers. He laughs alongside Margo and Alfred when she storms away. Later that day, he is eating lunch with Margo and Alfred inside the dining hall when Lydia sits at their table and guts a squirrel, in which blood shoots onto his face. He reacts in disgust and storms away from the table. That night, Gage and his friends ambush Lydia by the clotheslines and proceed to beat her as Margo reminds him that she is responsible for the deaths of Addy and Rodney. When Negan arrives and rescues Lydia, Gage is horrified to see that Margo was killed when she was thrown off Lydia, hitting her head against a building. Shortly thereafter, Gage and Alfred are questioned by the Alexandria council on the events that just occurred. They feed the council lies and are in disbelief when the council begins questioning their story. Eventually, both are let go. Having survived the Whisperer War, Gage is part of a group consisting of Daryl, Elijah, Maggie, Carol, Alden, Rosita, Lydia, Gabriel, Jerry, Roy, Kelly, and Magna who raid the abandoned Fort Connors military base for food supplies. He remains on watch on the roof as the women make their way into a hangar by rope to collect supplies. When walkers threaten the women, Gage acts as an archer, shooting down several walkers to protect them alongside Roy, Elijah, Daryl, Alden and Jerry. After the mission, Gage returns to Alexandria with his fellow survivors. Gage joins the mission to salvage food and water from Meridian to feed the large population in Alexandria. Part of a group consisting of Maggie, Daryl, Alden, Cole, Elijah, Roy, Negan, Frost , Duncan , Agatha , and Gabriel, the survivors utilize Negan's familiarity with the D.C. area to travel to Meridian. Due to the heavy rainstorm , the survivors are forced to head into the subway tunnels to complete the journey. While in the tunnels, they come across hundreds of body bags, many containing walkers in them. While putting down the bodies, Gage is snuck up on by a huge walker, but is saved by Negan. At some point while dispatching the body bag walkers, Gage and Roy go missing, along with the group's ammo and supplies. Shortly after this realization, a large group of walkers appear, forcing the other survivors to move forward in the tunnel without being able to search for Gage or Roy. Having gotten separated from Roy, Gage enters the other side of a train car where Maggie , Gabriel , Duncan , Frost , Agatha , Alden , and Negan are trapped. Gage yells for help from behind the stuck door, explaining that he and Roy had gotten lost in the walker-filled tunnels and he was able to get a door open on the far end of the train. Gabriel asks if Gage closed the door behind him just as walkers begin to fill Gage's side of the train from the door that he'd forgotten to close. As Negan tries to open the door for Gage, Maggie warns everybody that if they open it, all of the walkers will get in and they don't have the ammo to clear them out. Alden tries anyways, but Duncan pulls him back and refuses to let Alden try. As the herd approaches him, Gage desperately apologizes and begs Maggie for another chance, but she refuses, insistent that they don't have the ammo to clear the walkers behind Gage. When Alden rushes the door, Cole, Frost and Duncan hold him back and Gabriel orders Alden to let it go. Maggie apologizes to Gage for being unable to help him, but he angrily calls her a liar. Drawing two knives as the herd is about to overtake him and glaring straight at Maggie, Gage stabs himself twice in the heart, putting himself into shock, much to the horror of his friends. As Gage goes limp, the walkers grab him from behind and begin devouring his corpse, Gage's eyes still open and staring straight at his companions as he's eaten. Shortly thereafter, Gage's mutilated corpse reanimates and Negan and Gabriel have trouble looking at him. Gabriel calls walker Gage \"the shell of a man who died a coward.\" Alden insists that Gage was only scared and didn't deserve to die \"in the worst way imaginable.\" This prompts Maggie to tell a story from her time alone with Hershel of a worse way to die than Gage did. Eventually, the press of Gage and the other walkers causes the door separating the two train cars to start to come down. Finally, the door breaks down and the zombified Gage leads the herd through. As Gage comes through the door, Gabriel shoots him in the head with a shotgun, putting down Gage and the two walkers behind him.",
        "Death": "Killed By Maggie Rhee (Caused) Gabriel Stokes (Caused) Duncan (Caused) Frost (Caused) Agatha (Caused) Cole (Caused) Himself (Suicide, Alive) Gage emerges on the opposite side of a train door, trying to reconnect with the rest of the group but leaves the door to his train car open behind him, letting in a herd . Despite Alden and Negan trying to open the door, Maggie says that they can't risk it without putting everyone else in danger. Alden continues to try to open the door but Duncan, Frost, Cole, and Gabriel stop him from saving Gage. Gage curses Maggie in his final moments before stabbing himself twice in the heart and being devoured by walkers shortly thereafter. Gabriel Stokes (Zombified) After the walkers force the train door open, Gabriel shoots the zombified Gage in the head with a shotgun, putting Gage and the two walkers behind him down.",
        "Killed Victims": "This list shows the victims Gage has killed: Himself (Suicide, Alive) Several unnamed U.S. Military soldiers (Zombified) Numerous counts of zombies",
        "Relationships": "For a more in-depth look at Gage's relationships, read here; Gage (TV Series)/Relationships",
        "Quotes": "The following is a list of some of Gage's most memorable quotes.",
        "Appearances": "",
        "Gallery": "For more images of Gage, please visit Gage (TV Series)/Gallery .",
        "Trivia": "While Gage was not introduced until Season 9 , his character was present for all of All Out War . Furthermore, he has been at Hilltop from seemingly its inception as he states that he's lived there for almost half his life. While not confirmed, there is a young boy who appears during the Savior war who strongly resembles a younger version of Gage. In Season 11, Jackson Pace was promoted from Co-Star to Also Starring. Gage is the first character to die in Season 11 . In the Memoriam on Talking Dead for \" Acheron: Part II \", Gage was credited twice, first as Gage and then as Walker Gage and His NEW Group . His death is similar to Nicholas ' as both commit suicide when faced with an approaching herd, only to have their corpses devoured immediately after. Unlike Nicholas, Gage reanimates. Gage is one of ten kids/teens in The Walking Dead franchise to become an antagonist , the others being Ben , Lizzie Samuels , Gill , Ron Anderson , Christopher Manawa , Marlon , Minerva , Dakota , and Mason Beale . Gage is one of only two of these characters to renounce their antagonistic ways, the other being Marlon. Gage's death was spoiled within promotional material, as his zombified self can be seen being put down in the Season 11 Official Trailer. Gage is one of five Hilltop residents to be an antagonist, the others being Ethan , Andy , Gregory , and Earl Sutton . Gage appears in the archival footage shown at the beginning of \" Faith \" and \" Family \" as Judith narrates past events of the show to the audience before the episode's story begins. Gage appears in the final flashbacks of the last episode \" Rest in Peace \"."
    }
]