[
    {
        "Gary": "",
        "Overview[]": "Gary is a brutal, vicious, and aggressive individual. He is shown to be quite violent, such as when he beats up Aaron for seemingly leaving a rude note for the Saviors and also beating Dwight under Negan 's orders. He is shown to follow any order he is given no matter what. He goes along with killing the Scavengers without question and later even mocks Jadis ' corpse (believing her to be dead) and even spits on her. Initially, Gary is shown to be a trusted ally of Negan, seeing as Gary was part of the council. Gary also seemed to be loyal to him. However, it appears Gary is more loyal to Negan's right-hand man, Simon . Due to probably disliking Negan's leadership, Gary joins Simon's coup against Negan. This would lead to him, along with Simon's other loyalists, to be killed by Negan's men.",
        "Pre-Apocalypse[]": "Nothing is known about Gary's life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "At some point in the apocalypse, Gary somehow came into contact with a group named \"the Saviors\" which he subsequently joined upon where he was appointed as one of Negan's personal lieutenants. Gary aided his group in terrorizing other survivors and communities around the area into subjugating to Negan's will, where their victims would be forced to give half their supplies in exchange for not being murdered. Gary is among the Saviors to raid Alexandria for supplies, weapons, and furniture. As Negan and Rick walk around, Gary approaches Negan with the video camera that Deanna used to interview Rick and the other new arrivals. When Spencer , Rosita , and Eugene return from their supply runs, they find Gary at the gate, having arrived at Alexandria ready for the pick-up. Gary is stationed at the front gate with David , Laura , and other Saviors as they wait to inspect the offering from the Alexandrians. He commends Spencer for doing a good job with all of the supplies he found. When Aaron and Rick arrive with a truck full of supplies, David goes through the goods until he finds a note that he thought was meant to disrespect him and the Saviors. As a result, Gary, along with David, proceed to brutally beat Aaron until calling off the attack. Gary is among the Saviors to beat up Dwight after Negan learns that Sherry and Daryl have escaped the Sanctuary. When the newcomer Eugene is brought before Negan, Gary laughs at him and responds with his fellow Saviors in unison that his name is Negan. He is later present on the factory floor when Dr. Carson is accused of freeing Daryl and is thrown into the furnace and burnt to death as a result of his actions. Gary is among the Saviors traveling with Negan to Alexandria. When they come across the fallen trees in the road, he uses a chainsaw to help remove the branches. Upon arriving at Alexandria, Gary opens the back to a truck, revealing the bombs that were supposed to detonate on the Saviors at Rick's command, which ultimately failed. When the Militia and the Saviors engage in a gunfight, Gary manages to escape with his fellow Saviors. Having becoming trapped inside the Sanctuary, Gary is present in the room as the Savior lieutenants discuss how to rescue Negan, how to handle the workers, and the possibility of a spy among their ranks. After Laura bursts into the room, warning everyone the workers are coming up the stairs to express their demands, he and the others try to calm the angry workers and even draws his gun on them when Regina shoots one of the workers attempting to shoot Simon. They then hear whistling and everyone kneels as Negan arrives to the relief of mostly everyone. Gary, Arat, and Laura later inform Negan and the lieutenants that a Savior took weapons from the armory and armed the workers. When Eugene's plans successfully divert the herd away from the Sanctuary, Gary is among the Saviors that accompany Simon surround the Hilltop convoy at night. He gets out of the truck and pulls a gun on Jerry , who has been taken hostage, and is prepared to kill him on Simon's command but is told to stand down as Simon kills Neil instead. Gary leads Norris and D.J. as they carry the coffin containing an undead Dean . They arrive in Negan's conference room and are ordered to drop off the coffin and leave. Later that day, Gary accompanies Simon to the junkyard where he participates in the massacre that leaves all of the Scavengers dead. He rides with Simon as they return to the Sanctuary and unveils the gathered weapons from the Scavengers in the truck to Negan. Gary is part of the Savior army dispatched to the Hilltop to use their improvised weapons when Rick attacks the convoy on the road. While Gary and the others are eager to find Negan, they are told to stay put by Simon who assures them that he and Dwight will find Negan instead. When Dwight and Simon return to the crowd of Saviors empty-handed, Gary questions Negan's whereabouts but is reminded to stay in line. Having been convinced by Simon to accomplish Negan's mission on his honor, Gary joins in with the other Saviors cheering and ready to wipe out the Hilltop. Gary and the other Saviors arrive at the Hilltop prepared to attack the settlement. After several vehicles lose their tires, he is instructed to remove the tire spikes from the road so they can further advance into the Hilltop. During the battle, Gary and the others are met with gunfire but he manages to survive long enough to escape with the remaining Saviors. In a flashback, Gary chases after a Scavenger fleeing through the Junkyard and executes him. He passes by what he thinks is Jadis ' dead body and spits on her before returning to the massacre. Gary plans the final assault on the Hilltop along with Negan, Simon, Dwight, Arat, and D.J. He later participates in Simon 's attempted coup against Negan . However, Dwight tips Negan off and all of Simon's loyalists are shot to death upon Negan's command, including Gary. Negan then uses Lucille to bash Gary's head in to prevent reanimation.",
        "Death[]": "Killed By Simon (Indirectly Caused) Dwight (Caused) Gary joins Simon's attempted coup against Negan, but they are betrayed by Dwight, who tips Negan off. Negan Smith (Caused; Before Reanimation) Arat , D.J. , and Norris Upon Negan's command, Gary is shot to death by the rest of the Saviors for his betrayal. Then, Negan bashes his head in with Lucille to prevent reanimation.",
        "Killed Victims[]": "This list shows the victims Gary has killed: Numerous unnamed Scavengers (Alongside his fellow Saviors) Numerous counts of zombies and unnamed people",
        "Appearances[]": "",
        "Trivia[]": "Gary is not directly mentioned in the \"In Memoriam\" segment on Talking Dead , instead being credited as \"traitor Saviors\" with his fellow Saviors who were also killed by Arat and D.J."
    }
]