[
    {
        "Gavin": "Gavin",
        "Overview[]": "Although an antagonist, Gavin is extremely collected and level-headed for a Savior. He can be ruthless when necessary, but is more inclined to be diplomatic than his peers. He specifically chose the Kingdom's tribute route because it causes him little stress, and prefers to avoid any inconveniences if he can help it. He shows respect and courtesy to Ezekiel and acknowledges that he takes their meetings seriously and is always punctual, and treats their group with decency. Despite his civil relationship with the Kingdom, he has no time with Ezekiel's royalty act, dismissing it as \"shit\", (which is ironic, considering most Saviors see Negan as a God-like figure.) He seems to be reluctant when ordering ultimatums, preferring to give chances. Unlike most other Saviors, he is also upfront with his retribution, preferring to make it clear who will be punished, rather than selecting someone at random. Due to his demeanor and tendency to avoid unnecessary stress, it is likely that Gavin became a Savior for an easier life, lacking the thuggish and sadistic traits of his peers. This is reinforced when the Saviors under his command capture the Kingdom. He is shown to have cowardly tendencies, begging Morgan for mercy, and stating Negan cannot be beaten, so it would be better to just go along. While Gavin mostly allows Jared to get away with abusing Ezekiel's guards, he has a low opinion of him and his obnoxious behavior. Although a ruthless Savior by trade, Gavin has shown he has not completely abandoned his humanity. He reacts angrily when he realizes that Benjamin , a teenager, had been shot by Jared as a lesson to the Kingdom instead of Richard . The next day, instead of taunting them as many Saviors would do, Gavin shows legitimate concern by inquiring about Benjamin's health. Upon realizing that Benjamin has died, Gavin appears genuinely upset and he furiously orders Jared to walk back to base, threatening to kill him where he stood if he gave him any cheek. He later had Jared transferred to the Satellite Outpost for his disobedience. It is possible he only kept Jared around as long as he did because he needed someone to do the dirty work and knew Jared enjoyed it. He is quite intelligent because he realized that it was not a coincidence that the Militia attacked the same day the heads of the Saviors were gathered for a meeting and that there must be a traitor that let the information pass. He was also able to deduce that the Militia is going after the outposts, because a scheduled delivery from his outpost had not yet made it to the Sanctuary and he knew that his deliveries are never late. While invading the Kingdom , Gavin expresses remorse and conflicted over taking complete control saying \"God knows I didn't want to be the one to bring it\" referring to the chaos he told the people they brought upon themselves. While threatening to turn the situation \"into something traumatic\" if Ezekiel doesn't turn himself over, Gavin admits that he doesn't want that to happen and is clearly telling the truth. He even implored them to when confronting Ezekiel, he again expresses regret and horror of Benjamin's death. He also tells Ezekiel that he swallows things like Benjamin's death as it keeps others from dying and Ezekiel should have done the same.",
        "Pre-Apocalypse[]": "Nothing is known about Gavin's life prior to or as the outbreak began, except that he worked as a construction foreman.",
        "Post-Apocalypse[]": "At some point in the apocalypse, Gavin somehow came into contact with a group named \"the Saviors\" which he subsequently joined upon where he was appointed as one of Negan's personal lieutenants. Gavin aided his group in terrorizing other survivors and communities around the area into subjugating to Negan's will, where their victims would be forced to give half their supplies in exchange for not being murdered. Over time, Gavin was appointed as the leader of his own outpost due to his loyalty and leadership capability. He became in charge of overseeing the collection of weekly tributes from a community known as \" The Kingdom \".",
        "Death[]": "Killed By Morgan Jones (Indirectly Caused) Henry While Ezekiel tries to convince Morgan, who is currently driven by rage seeing Gavin's little to no care for Benjamin's death, not to kill him, Henry comes up from behind and stabs Gavin through the nape. Carol Peletier (Before Reanimation) Later, Carol stabs him in the head to prevent reanimation.",
        "Killed Victims[]": "This list shows the victims Gavin has killed: Benjamin (Indirectly Caused) Richard (Caused) 1 unnamed Sanctuary worker (Caused) Numerous counts of zombies and possibly unnamed people",
        "Appearances[]": "",
        "Trivia[]": "Gavin is the first high ranked Savior to be killed during the war, as well as the first outpost leader to die and the first member of Negan's council to die. Gavin's death holds similarities to Jody 's in \" Welcome to the Tombs \". Both deaths were of a surrendering enemy character, both were killed by a child character and the death signified a darker turn for their killer. The only difference is that while Jody had done nothing to Carl, Gavin was partially responsible for the death of Benjamin , Henry's brother. In a BMNY interview, Gavin's actor, Jayson Warner Smith , confirmed that Gavin's job before the apocalypse was being a construction foreman.",
        "Name": "Gavin"
    }
]