[
    {
        "George": "",
        "Fate": "",
        "Contents": "",
        "Overview[]": "Though only seen briefly, George seemed to be an outspoken, confident, and smart individual. He seemed to be a loyal Savior and was on good terms with his fellow allies. While waiting for a herd to pass, George comments on how Fat Joey was good for setting up rigged explosives for dealing with a herd. He even defends Fat Joey when Chris makes a demeaning joke about him, despite Joey usually being getting little respect amongst the Saviors. He also seems to show some knowledge about military tactics. However, George ends up being quickly shot to death after shortly after spotting Carl Grimes .",
        "Pre-Apocalypse[]": "Nothing is known about George's life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "At some point in the apocalypse, George somehow came into contact with a group named the \"Saviors\" which he subsequently joined. George aided his group in terrorizing other survivors and communities around the area into subjugating to Negan's will, where their victims would be forced to give half their supplies in exchange for not being murdered. George and Chris sit in the back of a truck bound for the Sanctuary as they wait for the herd to pass along. They discuss about the rigged explosives set up down the road and how Fat Joey was useful in finding the explosives while scavenging. Upon arriving at the Sanctuary, George is suddenly shot and killed after discovering Carl hiding in the truck.",
        "Death[]": "Killed By Carl Grimes While unloading the truck, George spots Carl hiding and is suddenly shot to death.",
        "Killed Victims[]": "This list shows the victims George has killed: Numerous counts of zombies and possibly unnamed people",
        "Relationships[]": "",
        "Appearances[]": "\" Sing Me a Song \"",
        "Trivia[]": "In \" Scars \", Negan reminisces to Michonne the time Carl snuck into the Sanctuary and gunned down George and Chris."
    }
]