[
    {
        "Gina": "",
        "Fate": "",
        "Contents": "",
        "Pre-Apocalypse[]": "Nothing is known about Gina's life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "Gina is among the kids hiding in an abandoned building when Michonne and her group search for them to bring back to Alexandria to regroup with Jocelyn, Mitchell, and Winnie. That night, she enjoys a bonfire with her group and the other Alexandrians. One day, Jocelyn and her group suddenly leave Alexandria with a few of the kids, including Michonne, Scott, and Frankie's children. Gina and the rest of Jocelyn's kids are found in an old school where they ambush Michonne and Daryl. She watches as they are both knocked unconscious. A short time later, Michonne and Daryl escape from their binds and Gina and Linus are put on alert by Jocelyn. As Michonne pursues Jocelyn, she leaves Linus and Gina to guard a corridor and hold Michonne off. Michonne pleads with them to stand down, in vain. As Gina attacks Michonne with her own sword, Michonne disarms her with a pipe she manages to find on the ground. As Michonne goes to retrieve her sword, Linus slashes at Michonne's midsection, lacerating her. After Michonne retrieves her sword, Linus and Gina choose to flee rather than risk fighting her. Michonne finds an exit and is immediately beaten over and over with a wooden plank by Jocelyn. Michonne summons the strength to stab her in her leg and the chest, killing her. Michonne gets up and tells the kids they can all return to Alexandria, but Mitchell instructs the kids to kill the Alexandrians as he deals with her. Gina tries to attack her again but is killed by Michonne.",
        "Death[]": "Killed By Michonne Grimes Gina tries to attack Michonne, but is stabbed by her in the process. Michonne Grimes or Daryl Dixon (Before Reanimation, Assumed) She is presumably put down before reanimation by either Michonne or Daryl once the fight is over and the Alexandria kids are safe.",
        "Killed Victims[]": "This list shows the victims Gina has killed: Russ (Alongside the rest of her group) Possibly numerous counts of zombies and unnamed people",
        "Relationships[]": "",
        "Appearances[]": "",
        "Trivia[]": ""
    }
]