[
    {
        "Gracie": "",
        "Overview[]": "Gracie is first found by Rick Grimes after he kills her father in hopes of getting to a weapons room. After he realizes he just killed her father, Rick is immediately filled with guilt. He takes Gracie out of the outpost where she is adopted by Aaron . Six years after Rick's disappearance, Gracie is shown to be a kind, friendly, and innocent girl. She is shown to get along with the rest of the kids, especially Judith who is her best friend. After Judith and Carl 's keepsake is broken, she is the first to offer to help fix it. Compared to Judith, Gracie is a less experienced survivor, though she wants to be more useful. At one point she states she wishes she was as brave as Judith. She shows her naivety when she tries to find a weapon in the basement despite it flooding, which ends up trapping both her and Judith. Gracie has been shown to be extremely intelligent as she can name all the state capitals and their main cities at only eight years old, she reads at levels way past most children her age group, she loves riding bicycles with her dad and her friends. Aaron is shown to greatly care for his daughter, even having a nightmare where he loses her. When she and Judith get trapped in a basement, he is shown to be willing to risk his life for her and jumps into the water infested basement with no hesitation.",
        "Post-Apocalypse[]": "Gracie was born in early 2012, 18 months into the apocalypse, and lived with her father at the Shephard Office Plaza - which was an outpost for the Saviors , a group of extortionists that her father was a part of. It's unknown what became of her mother, but her father was able to take care of her for those 5 months. The Saviors doted upon Gracie and furnished her own bedroom, and their leader Negan Smith came to meet Gracie.",
        "Appearances[]": "",
        "Trivia[]": "Gracie is the fourth known child in the TV Series to be born into the apocalypse, the first being Judith Grimes , the second and third being two unnamed infants living at the Kingdom , the fifth being Hershel Rhee , the sixth being R.J. Grimes , the seventh being Ezra , the eighth being Aliyah , and the ninth being Mariam . Gracie is the first child to be adopted by one of the communities from an antagonistic group, with the second being Adam Sutton . With Regina 's death in \" Who Are You Now? \", Gracie is the last surviving inhabitant of the Shephard Office Plaza . Gracie is one of only three named former Saviors confirmed to be alive, the others being Negan and Eugene Porter . Of these, Negan and Gracie are the only original Saviors confirmed to be alive. She is also the only character introduced in Season 8 that is confirmed to be alive. She is also the only member of the Saviors who has never been antagonistic to be alive. She is also the youngest member of the Saviors. It was revealed in \" The World Before \" that Gracie not only has an excellent memory, but also knows all the capitals of each state in the United States of America . Ross Marquand revealed that, at some point, Aaron did discuss with Gracie that she is adopted and was rescued from the Saviors, but left out the fact that her father was directly killed by Rick in the battle. Gracie is mentioned several times by Aaron in \" One More \" as he and Gabriel talk about ending their supply run and returning home to their kids, and during Mays ' taunting of Aaron. During the episode, Aaron brings home toys from the warehouse for Gracie and Socorro Espinosa . On Talking Dead , it is revealed that, according to the script, the toy brand is called \"Abnorminals\", and each one is a hybrid. Gracie's stuffed animal is a mix between a seal, a rabbit and a squirrel. Gracie can be seen briefly cuddling the toy in \" Out of the Ashes \". [1] Gracie wears clothing items that either replicate or belong to Aaron. She owns a handmade glove that is designed to look similar to Aaron's prosthetic arm, and can be seen wearing it in \" The World Before \" and \" A Certain Doom \". Gracie can also be seen wearing the shirt that Aaron wore in \" A New Beginning \" and \" Silence the Whisperers \" when she sleeps in it during the episode \" Out of the Ashes \". [2] In an interview, Cailey Fleming confirms that Gracie is Judith Grimes ' best friend. [3] Since \"Out of the Ashes\", it is confirmed that Aaron and Gracie have an evacuation plan. She has to lock herself in her basement and use her whistle to signal if she is in danger. The original ending of the show had a time-skip of at least 10 years, and an adult Gracie was shown riding in the back of a van with Judith, R.J. Socorro and Ezra searching for other survivors to bring back to their community. [4] In this deleted scene, Gracie has the same job that Aaron had when he was introduced. In this scene Gracie is portrayed by Tess Cline, and is supposed to be roughly in her mid 20's. Ross Marquand revealed there was a deleted scene from the ending of \"Rest in Peace\" where Lydia gives Aaron a letter from a male admirer in the Commonwealth. Aaron declines, explaining that he is too busy - similar to how Aaron initially rejected Eric's advances for the same reasons. Gracie then encourages him to pursue the relationship, arguing that he is always selfless and for once should do something for himself. [5]"
    }
]