[
    {
        "Overview[]": "Green initially comes off as a friendly and eager individual. He seems quite inexperienced in combat, at one point shown to struggle with a walker. However, he and Rosita manage to work together as a team to get through the Kill House. Though he most likely had good intentions in joining the army , Green later takes on a more antagonistic role. He is among the Commonwealth soldiers to go to Riverbend and find their missing weapons. He doesn't seem to have a problem killing innocent civilians under Toby 's orders. At one point, he shoots at Aaron and later corners him and Gabriel with Toby and another soldier. He most certainly would have killed them if not for Elijah saving them by killing Green.",
        "Pre-Apocalypse[]": "Nothing is known about Green's life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "At some point during the outbreak, Green joined a community in Ohio. Green is present at the \"Kill House\" along with his fellow trainees, including Daryl Dixon and Rosita Espinosa . General Mercer, overseeing their training for the day, informs them that they will be split up into teams of two and will have to share a small knife between one another as they make their way through the dilapidated home-turned-obstacle course. Mercer explains that the exercise is to promote teamwork and speed, and whoever kills a walker marked in red paint at the end of their run passes. Green is paired with Rosita, who is eager for the exercise and introduces himself to Rosita. Despite Daryl insisting that he and Rosita make a good team, Mercer refuses to switch the groups he assigned, and pairs Daryl and Jake in competition against Green and his partner, Rosita. As Green and Rosita make their way through their half of the Kill House, they are monitored by Commonwealth soldiers outside and attacked by walkers inside. The pair are successful in working together to clear the Kill House and celebrate their victory over Daryl and Jake. Trooper Green is among the Commonwealth soldiers dispatched to accompany Aaron, Gabriel, Toby, and Jesse to offer an invite to the Commonwealth to a community that was discovered on the western edge of Virginia. However, the mission was a cover operation planned by Lance Hornsby to capture and interrogate the survivors after a Commonwealth caravan was massacred and looted. After Aaron kills a soldier who was about to murder Jesse, Toby attempts to kill Aaron but ran out of bullets. Before Aaron could retaliate, Green and another soldier arrive, sending Aaron fleeing. Before Green could go after Aaron, Jake Daniels calls the men inside where they find the body of another trooper and the captured Gabriel gone. He then accompanies Toby on the roof with the surviving soldiers and witnesses several Riverbend residents be executed. Trooper Green helps set up an antenna on the Riverbend rooftop so Carlson may call Lance Hornsby for a status report. After Carlson finishes speaking with Lance, Green informs him that two more bodies have been found by the east exit, including Trooper Hodges . Trooper Green accompanies Carlson as they make their way up the building, executing innocent civilians hiding in their homes. While Sergeant Crowe and another soldier split up, Green accompanies Carlson and another soldier to an apartment as they search for survivors when they hear Gabriel and Aaron reveal over the radio that they are heading to the roof. Green and the others give chase to the roof where they are ambushed by Elijah, resulting in Green's death.",
        "Death[]": "Killed By Elijah Green accompanies Toby to the roof, where he and another soldier are then ambushed and stabbed to death by Elijah.",
        "Killed Victims[]": "This list shows the victims Green has killed: Hart (Possibly) At least 10 unnamed Riverbend residents (6 Caused, Alive, 4 Possibly, alongside Commonwealth Army ) Numerous counts of zombies",
        "Appearances[]": "\" New Haunts \" \" Warlords \" \" The Rotten Core \"",
        "Name": "Green"
    }
]