[
    {
        "Pre-Apocalypse[]": "Nothing is known about Greg's life prior to or as the outbreak began, except that he was a very helpful man who was always building on his house or helping his neighbors.",
        "Post-Apocalypse[]": "While Greg was never seen in Season 3, he was living in Woodbury and was among the residents to be brought to the prison . [1] Greg is seen eating breakfast with a woman and two children at the outdoor dining area and greets Daryl Dixon when he walks by. During the night, as an undead Patrick began to roam the cell block, Greg was heard snoring just before the undead Patrick was about to enter Karen 's cell. The zombified Patrick then made his way towards the source of the sound and found Greg in his bed, where he dug his teeth into Greg's throat, preventing him from screaming as Patrick began devouring him. As Patrick ate Greg's insides, a noise drew him away. Moments later, Greg reanimated and joined Patrick in attacking the other prison survivors. The reanimated Greg killed and fed on at least one fellow survivor. As he turns his attention to Luke , Daryl grabs the boy and carries him to safety, shooting Greg in the head with a crossbow as he runs. His body was then buried in the prison yard with the other deceased residents.",
        "Death[]": "Killed By Patrick (Infected, Alive) Greg is killed and partially devoured by a zombified Patrick, before he begins infecting the other sleeping residents of Cell Block D. Daryl Dixon (Zombified) Later, a zombified Greg is shot in the head with a crossbow bolt by Daryl.",
        "Killed Victims[]": "This list shows the victims Greg has killed: 1 unnamed prison newcomer (Infected) Possibly numerous counts of zombies",
        "Appearances[]": "\" 30 Days Without An Accident \" \" Infected \" (No Lines)",
        "Trivia[]": "Actor Greg Crews revealed that his character is named Greg, while he was never credited and his name was not mentioned in any dialogue. [2] Additionally, Greg Nicotero uses the nickname The Snoring Guy for this character, in which a Facebook Fan page has been created for this character. [3] The deleted scenes of \"30 Days Without An Accident\" show Greg carrying lumber to the dining pavilion in the prison yard, taking inventory of the ammo, and performing maintenance on the Woodbury bus. [4] When he reanimates after being devoured by Patrick, Greg's entrails spill out on the floor next to his cot. This is almost certainly a visual reference to the 1985 George A. Romero film Day of the Dead , which Greg Nicotero worked on early in his career.",
        "References[]": "",
        "Name": "Greg"
    }
]