[
    {
        "Overview[]": "Guillermo initially appears as a tough, no-nonsense thug. When Rick 's group first meets him, he is initially hostile and aggressive. At one point he threatens to feed Glenn to their dogs. However, this is revealed to be a façade to scare people away due to previous encounters with hostile groups. It is shown that he only acts on best intentions for his people, which includes a handful of elderly and helpless folks. He reveals that the hospital staff had left them to die, leaving only him and Felipe. Guillermo took charge of the Vatos and now all the people look to him for reasons he doesn't understand. After Guillermo and Rick bury the hatchet, Guillermo is shown to be civil and reasonable. The two groups leave on good terms.",
        "Pre-Apocalypse[]": "Nothing is known about Guillermo's life prior to or as the outbreak began, except that he lived in Atlanta working as a custodian at a nursing home.",
        "Post-Apocalypse[]": "After the onset of the outbreak, all the nursing home staff abandoned the seniors and left them to die. Guillermo and Felipe decided to stay behind and take care of them with the help of the Vatos gang . Over time, he became the leader of the group. Guillermo is mentioned by Miguel as the boss of the gang and takes Rick Grimes to him. Guillermo is well protected with a gang of tough-looking men. Guillermo has Glenn Rhee hostage, demanding for \"his\" bag of guns back, along with Miguel, otherwise Glenn would be killed, revealing Glenn to be tied up on the roof. He warns that Rick better come back, with his demands met, or \"locked and loaded.\" Rick, T-Dog , and Daryl Dixon return, armed and ready for a fight. During this second encounter with the Vatos gang, an old woman trudges into the garage, calling Felipe for help. On seeing the armed newcomers, she warns them against harming Guillermo, who is a \"good boy\" and bids them to follow her when Rick tells her that they are just there for Glenn. Soon, Rick realizes that the building is filled with elderly patients. He pulls Guillermo aside and berates him for his behavior, saying that they weren't bluffing and were ready to kill. Guillermo echoes their commitment, saying that someone had to take care of these people after the nursing home staff abandoned them, leaving him, the head custodian, and Felipe, a nurse, behind. The rest of the gang members and some of the family members who came looking for their relatives stayed voluntarily to look after them as well. It seems Guillermo took charge and decided to watch out for his people and protect the food and medicine, and he saw that the guns would have been a good asset to the large group. Rick donates half of his guns and ammo before bidding farewell to Guillermo and his people.",
        "Death[]": "Killed By Unknown Cause At some point, everyone at the nursing home was killed. [1] Although it is not known how Guillermo died, in a deleted scene for \" What Lies Ahead \", Rick's group returns to the nursing home to find all of the Vatos dead due to another unknown group of people having executed them and walkers invading the nursing home afterwards. It's possible that this event still happened (sans Rick's group returning after the CDC explosion).",
        "Killed Victims[]": "This list shows the victims Guillermo has killed: Possibly numerous counts of zombies and unnamed people",
        "Appearances[]": "\" Vatos \"",
        "Trivia[]": "Originally, Neil Brown Jr. was just an extra, but the producers eventually decided the nursing home survivors needed a leader. [2] Guillermo was supposed to appear as a walker at the overrun nursing home. However, this scene was cut out of Season 2 . He is one of thirteen characters known to speak Spanish in the TV Series . The others are Rosita Espinosa , Juanita Sanchez , Dante , Morales , Miguel , Felipe , Abuela , Gabriel Stokes , Judith Grimes , Vazquez , and the Mexi can Family .",
        "References[]": "",
        "Name": "Guillermo"
    }
]