[
    {
        "Haley": "Haley",
        "Overview[]": "Haley is a very blunt and sarcastic girl. When talking with Andrea , she generally is quite friendly with her, with the two opening up about the people they've lost. However, she can also be quite arrogant and overconfident. She boasts her skills with a bow, to the point of stating that her father wanted her to join the Olympics. However, when a walker approaches, her skills are quite unimpressive, missing all of her shots, forcing Andrea to go down and take it out with a knife. Haley is angered by this, stating she could've killed it despite just showing she can't even hit a slow-moving walker. However, overall she didn't seem to be malicious. When Rick 's group invades Woodbury , Haley ends up being shot by Maggie , which saddens Andrea.",
        "Pre-Apocalypse[]": "Little is known about Haley's life prior to or as the outbreak began. It is known that she owned a very expensive compound bow and her father wanted her to go to the Olympics. She also mentions having a brother.",
        "Post-Apocalypse[]": "Haley's father and brother became infected at an unknown time and she had to kill them. She eventually accepts the leadership of The Governor and accepts the job of defending the town. Haley met Andrea while working on the wall. She told Andrea about her compound bow and how she had to kill her father and brother after they reanimated. She then attempts to kill a walker with her bow, but fails, and watches, stunned, as Andrea kills it by jumping over the wall and stabbing it with a knife. She scolds her for doing so, dismayed at her unusual behavior. Haley found the injured guard inside a house after he was beaten by Rick 's group and she called for help. She was present at the meeting in Milton 's laboratory before the firefight between the Woodbury guards and Rick's group. Outside, she was ordered by The Governor to look for the attackers. After the attack, she goes to the clinic with Merle Dixon to see the wounded Governor. She is later seen at the Arena next to Milton and Andrea listening to The Governor's speech about the attack. It is unclear how she reacted towards the residents' calls for the death of the Dixon brothers. Shortly after Daryl and Merle start fighting, gunshots go off into the crowd courtesy of Maggie . Haley is unable to react before Maggie shoots her in the chest, killing her instantly. When the townspeople flee in fear, Andrea kneels over her body, saddened that she was killed. Later, Philip names off the people that Rick's group had killed to Andrea, Haley being among them.",
        "Death[]": "Killed By Maggie Greene Haley is shot in the chest by Maggie as she and Rick return to Woodbury to save Daryl. It's assumed that she was put down by Andrea or a Woodbury resident before reanimation.",
        "Killed Victims[]": "This list shows the victims Haley has killed: Her father (Zombified) Her brother (Zombified) Numerous counts of zombies",
        "Appearances[]": "",
        "Trivia[]": "",
        "Name": "Haley"
    }
]