[
    {
        "Hannah": "",
        "Fate": "",
        "Contents": "",
        "Overview[]": "Hannah is an extremely protective and loving mother who will do whatever it takes to protect her children. Though initially, due to it being in the early stages of the outbreak, she is intially confused and distraught by the walkers. However, when her children are endangered by a zombified Judy , she takes an axe and puts her down with little hesitation. However in the end, Hannah fails to spot a walker in the backseat of a car and gets bitten. Knowing she will die, Hannah stays back and sacrifices herself to the walkers, allowing her children to escape.",
        "Pre-Apocalypse[]": "Hannah was previously married to Andrew and had two children with him but later, the two did not get along very well and she filed for divorce. Her children, Billy and Jamie , lived with her, however, Andrew was entitled to weekend visits. She knew about Andrew's new spouse Judy whom she did not think too kindly of due to Judy spending time with her children as well. At the time of the apocalypse, Hannah was driving her car with her children who may have been heading over to Andrew's home for his weekend visit (since they were only a few blocks away from his home at the time of the accident). However, someone jumped in front her car forcing her to swerve and crash, rendering her unconscious.",
        "Post-Apocalypse[]": "",
        "Death[]": "Killed By Zombies (Alive) Callaway (Infected, Alive) Herself (Caused) As Hannah tries to escape the town with her children, she enters a car on the street and is bitten on her arm by a walker. Knowing that she is infected, Hannah allows herself to be devoured by a group of walkers while her children escape. Sometime later, a partially devoured Hannah reanimates. Rick Grimes (Zombified) Two months later, a zombified Hannah is encountered by Rick, who tearfully expresses his sympathy for her and shoots her in the head to put her down.",
        "Killed Victims[]": "This list shows the victims Hannah has killed: Judy (Zombified) Herself (Caused, Alive) 1 zombie",
        "Relationships[]": "For a more in-depth look at Hannah's relationships, read here; Hannah (Webisodes)/Relationships Andrew † - Ex-Husband Billy - Son Jamie - Daughter",
        "Appearances[]": "",
        "Trivia[]": "Hannah crawling as a walker has been interpreted by many as a symbolic moment; it is believed she was searching for her children, evidenced by the fact she was crawling to and was eventually found in what appeared to be a park, potentially the same park the evacuation to Atlanta took place in. Also in the way she responds to seeing Rick, especially on the second occasion, she appears to reach out at Rick in a way that may suggest she wanted help and didn't actually snap at him, however, this could be attributed to the fact that she was extremely decayed and starving, making her not seem aggressive compared to other walkers. Hannah being bitten by a concealed walker is similar to how Lee Everett from The Walking Dead: The Telltale Series was bitten. Coincidentally, both Hannah and Lee's introduction episodes were titled \" A New Day \". Hannah is one of only two characters from the webisodes to be seen on The Walking Dead . The other one is Callaway . Interestingly enough, he is among the walkers that kill her. They both appeared in the show as walkers.",
        "See Also[]": "Hannah's Magic: The Gathering card"
    }
]