[
    {
        "Harley": "",
        "Fate": "",
        "Contents": "",
        "Overview[]": "Harley is a vicious, cruel, and sadistic individual. He is shown to be one of the most brutal Claimers . In his first scene, he is heard bashing the head of a Claimer who had broken one of the rules and decides to leave him bleed out rather than finish him off. He later helps the group beat Len to death on Joe 's orders. After the Claimers find Rick's group, he is shown to be vengeful towards Rick since he killed Lou and is angered when Daryl tries to stop it. Harley and Billy begin to mercilessly beat up Daryl. However, after Rick kills Joe, the Claimers become disoriented, allowing Rick's group to kill the Claimers, including Harley who is shot by Michonne .",
        "Pre-Apocalypse[]": "Nothing is known about Harley's life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "Harley is one of the men who invade the house Rick , Carl , and Michonne were staying in. Inside, the Claimers berate one of their own for breaking Joe's rules and being a coward. The man begs for his life before Harley bashes his head with a melee weapon. One of the Claimers ask if he'll finish the job, and Harley replies that the man deserves to bleed after what he has done. Soon after, Joe tells Harley to clean his mess up, referring to the dead man. Harley is first seen with his group gathering around Daryl , while Daryl is sitting down in the middle of a road. After Daryl punches Joe and points his ready-to-fire crossbow at Joe, Harley and the other group members point their weapons at Daryl. After Joe talks Daryl into lowering his crossbow, Harley and the other group members lower their weapons too. Harley is first seen sleeping on the ground in the forest. As a walker approaches Harley and the group, it is blocked by some barbed wire that is encircling their encampment. The walker gets its cheek stuck along the barbed wire. Harley wakes up and says \"I got it\". He stands up with his Mosin Nagant rifle and extends its integral bayonet outward. He then stabs the walker under the chin in an upward motion to kill it. After Harley kills the walker with the thrust of his bayonet, he unbuckles his pants and urinates on the walker's body. Later, Harley is seen walking along the railroad tracks with the rest of his group. As a walker roams up to them, Harley holds Billy 's gun and watches as Tony , Dan , and Billy kill the walker. After they kill the walker, Harley hands Billy's gun back to him. As Harley and the group continue along the railroad tracks, Joe tells them all to take shelter for the night inside an adjacent building, where several cars are stored. Harley aims his rifle and helps the group to check the building for walkers inside. As the group are checking the place out, Harley claims one of the cars as a spot for him to sleep in. Harley later watches as Len accuses Daryl of the theft of half of a rabbit carcass that they both hunted. After Len is deemed a liar by Joe, Harley, along with Tony, Billy and Dan, are ordered by Joe to beat Len as punishment. Harley and the others start kicking and punching Len as he is on the floor of the building. They later also shoot an arrow into Len's head, killing him. It is shown that Harley apparently claimed Len's bow, so it is possible he was the one who finished him off. After leaving the building with the stored cars the next day, Harley continues along the railroad tracks with the group. Harley and the others then see the Terminus sign. Joe and his group ambush Rick, Michonne, and Carl. When Daryl appears and says that Rick and crew are good people, Joe says that Daryl is lying. Joe calls for Harley and Billy to 'teach him a lesson'. Harley and Billy are seen beating up Daryl. After Rick kills Joe, Harley's guard is distracted by the brutality of Rick. As Harley attempts to grab his gun, Michonne shoots Harley in the head with Tony's .44 Smith & Wesson Model 29 revolver, killing him.",
        "Death[]": "Killed By Michonne Hawthorne As Harley is beating up Daryl along with Billy, the rest of his group start to get killed, confusing him. Harley tries to grab his rifle but is shot in the head by Michonne.",
        "Killed Victims[]": "This list shows the victims Harley has killed: Lou (Zombified, Possibly, Alongside fellow Claimers ) Len (Alongside his fellow Claimers; Assumed Before Reanimation) 1 unnamed Claimer Numerous counts of zombies and unnamed people",
        "Relationships[]": "",
        "Appearances[]": "",
        "Trivia[]": ""
    }
]