[
    {
        "Helen": "",
        "Overview[]": "Helen is a rebelling individual and a disloyal follower of the Whisperers . She along with Sean disapprove of Alpha 's leadership and even have the courage to challenge her position as leader. However, this ultimately fails and Alpha ends up making an example of Helen by brutally decapitating her in front of everyone.",
        "Pre-Apocalypse[]": "Nothing is known about Helen's life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "At some point following the outbreak, Helen joined a large group of survivors known as the Whisperers . The group of Whisperers escorting Lydia back to their camp rest in the woods by a creek. Helen stands next to Sean and secretly plots a coup against Alpha , unaware that she is just behind them. Helen and Sean stop talking as Alpha nonchalantly strolls past then. They resume their conversation as Alpha walks away, unaware that she now knows their plan to overthrow her. After finding Henry, Alpha orders everyone to remain alert as they continue their journey back to the camp. Later, at the Whisperers' camp, Helen and Sean approach Alpha and question why they gave up two people for her daughter . \"I don't like that math,\" Sean whispers. Alpha reminds them she did it to get information. Sean issues a challenge for her leadership role. Alpha laughs in his face and Beta grabs the man from behind and holds a long knife to his throat. \"You're changing the rules again,\" he says calmly. Alpha confirms he has the right to challenge her position, but she has the right to defend it. She then turns her attention to Helen and suggests it's actually her who wants to be the new leader. Helen tells Alpha she failed everyone by putting them in danger. Alpha tells her that her people voluntarily follow her because she keeps them safe. Alpha then wraps a wire around Helen's neck and decapitates her as a horrified Henry looks on. Alpha then presents her head to the rest of the camp and places it into Sean's hands. Helen and Sean's corpses are later dragged into a field by a pair of Whisperers and are quickly devoured by a herd.",
        "Death[]": "Killed By Herself (Caused) Helen tries to convince Sean to challenge Alpha to be the new leader. However, Alpha notices her plan and confronts her. Alpha Alpha places a wire around Helen's neck and brutally decapitates her.",
        "Killed Victims[]": "This list shows the victims Helen has killed: Herself (Caused) Sean (Indirectly Caused) 2 horses (Possibly, Caused or Direct) Possibly numerous counts of zombies and unnamed people",
        "Appearances[]": "\" Guardians \"",
        "Trivia[]": "Helen is the first named Whisperer to die in the TV Series."
    }
]