[
    {
        "Henderson": "",
        "Contents": "",
        "Overview[]": "Henderson is a stern but well-intentioned individual. As protestors take to the streets Sebastian to be punished for his crimes, Henderson attempts to calm them down. He is very strict in enforcing the rules, even threatening to have those on the streets arrested after curfew. However, all his actions are done for the citizen's safety, since a herd is heading towards the Commonwealth , making it unsafe for anyone to be outside. Though he is willing to go to extreme lengths to get this done, such as ordering the soldiers to tear gas the crowd.",
        "Pre-Apocalypse[]": "Nothing is known about Henderson's life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "At some point during the outbreak, Henderson joined a community in Ohio and was assigned the role of government clerk at the Commonwealth. After the city is placed on lockdown, Henderson emerges from Union Station with a bullhorn and addresses the crowd of protestors that there is a herd on its way towards the Commonwealth but that the army will direct the herd away. He orders the crowd of people to return to their homes and reminds them that they will be arrested if found on the streets after curfew, for their own safety. He repeats this message on the bullhorn as city soldiers begin ushering the civilians away from the station and erecting barricades. Later that night during a memorial service for April in Union Square, he and a team of soldiers address the crowd of protestors to return to their homes as the herd has been swarming checkpoints and getting closer to the city. When the civilians refuse to move, Henderson steps aside as the soldiers begin tear gassing the crowd. With the city breached and many civilians killed as reported by Colonel Vickers and the screams heard throughout the invasion, Henderson's fate is left unknown. It is possible he was let into the Estates with the crowd of terrified citizens or was rescued later on elsewhere in the city, or was killed by the undead.",
        "Killed Victims[]": "This list shows the victims Henderson has killed: Possibly numerous counts of zombies",
        "Relationships[]": "",
        "Appearances[]": "\" Lockdown \"",
        "Trivia[]": "This character is credited as Government Clerk in \" Lockdown \"."
    }
]