[
    {
        "Overview": "Henry has a staunch, personal sense of justice and fairness, even if his methods of upholding such a moral code can be impulsive, naive, or dangerous. He resents those who harm others for personal gain or for fun, and often rushes into helping or avenging people he cares about without hesitation. While stubborn and often overly optimistic in his philosophies on right and wrong, his choices are never made to hurt those close to him, and his vengeful impulses are normally more a means of defending other people than anything else. During the war with the Saviors , Henry is insistent upon taking part so as to gain revenge for his brother's murder , always wearing a set of armor and willing to threaten to kill captive Saviors to try to find his brother's killer. However, after the Saviors' attack on the Hilltop, his own near-death experience chasing after the escaped prisoners and upon seeing the state of Morgan upon his return, Henry loses his anger and is more sorry that Morgan got hurt than happy about the news of Morgan getting revenge for them both. After Jared 's death, Henry seems to be content with going back to a regular kid, shedding his armor before the final battle and making no attempt to participate in it. As an older teenager, Henry continues to practice Morgan's teachings and has even fashioned a more ornate staff for himself rather than continuing to use a simple wooden pole. Now the adopted son of Ezekiel and Carol, Henry works to keep his deteriorating home going and learns blacksmithing to help out. However, being away from home also allows Henry to indulge in some more typical teenager things such as underage drinking and getting into trouble with other kids his own age. During his interactions with Daryl and Lydia , Henry shows himself to be a very intuitive and compassionate person which helps cause Lydia to remember the truth about her mother and gets Daryl to be more compassionate towards the girl as well. This leads to Henry and Lydia falling in love to the point that Henry remains with Lydia even after his death. After Henry is gone, Lydia adopts his staff and fighting style, presumably in his memory and honor. While willing to kill if need be in self-defense, Henry is much less willing to do so than when he was younger and he admits that he hates killing to Lydia, only resorting to it against a Whisperer when left with no other choice.",
        "Pre-Apocalypse": "Nothing is known about Henry's life prior to or as the outbreak began, except that he lived with his mother, father, and older brother, Benjamin .",
        "Post-Apocalypse": "At the onset of the apocalypse, Henry and Benjamin lost their mother, but their father survived. The three were eventually found by Ezekiel and taken to the Kingdom where they settled. However, the brothers eventually lost their father too. As Morgan shows Carol around the Kingdom, Henry rides a horse in an enclosure as his brother Benjamin guides the horse around. Later that day, Henry eats dinner with Benjamin and Morgan and excuses himself early to catch the movie being shown later for the community's residents. Benjamin reminds his younger brother to eat everything on his plate, including the broccoli he set aside, and to be in bed by 10 after doing some reading. Henry is put to bed by Ezekiel as Benjamin watches and later speaks with Ezekiel about helping Rick 's group fight against the Saviors . The next day, Henry attends an archery class with several other Kingdom children. He watches on as the instructors demonstrate to the teenagers how to use a bow and arrow. Henry trains with Morgan to learn how to fight with a stick, claiming he hopes to surpass his brother one day. Before his brother leaves for another supply drop, Henry hugs Benjamin goodbye. Later that day, he is comforted by Ezekiel after learning of his brothers' demise at the hands of a Savior. The next day, Henry helps Ezekiel repair the recently burned royal garden that had been infested with weevils as Carol joins them. Henry talks with Ezekiel about the upcoming fight against the Saviors and how many people will lose their loved ones. He is reassured that the Kingdom will win and then listens to Ezekiel's speech to the residents. When Ezekiel, Jerry , and Carol return to the Kingdom later that day, Henry looks in sadness as he sees Ezekiel injured and upset. Henry watches as Carol enters the theater to attempt to get a depressed Ezekiel to help her muster fighters so they can rendezvous with Rick. When she heads outside, Henry follows her and offers to help fight the Saviors, but she angrily turns him away and tells him not to follow her. He ignores her orders and proceeds to follow her into the woods. Later that day, Henry kills two walkers with his stick in the woods when Carol arrives and admonishes him for putting his life in danger. Henry, however, claims to be seeking revenge for Benjamin’s death and insists on fighting the Saviors. After some consideration, Carol relents and gives him a gun. Though unseen, Henry is among the Kingdommers rounded up by the Saviors when they invade the settlement at night. After Ezekiel sets off a distraction, Henry flees the Kingdom to the safe house with the other residents. When Carol prepares to return to the Kingdom to rescue Ezekiel, Henry, still wanting to avenge Benjamin's death, attempts to convince Carol to allow him to join her. Despite Carol refusing and ordering him to stay behind with the other Kingdommers, Henry follows her to the Kingdom. Later that night, as Carol and Ezekiel try to convince Morgan not to kill Gavin, Henry suddenly comes up from behind Gavin and stabs him through the nape, killing the Savior lieutenant. Afterwards, Henry insists that he had to kill Gavin as Ezekiel comforts him and Carol is angry at Henry for not staying behind, but Ezekiel cuts her off. Having arrived at the Hilltop with the other refugees, Henry guards the Saviors being held prisoner along Morgan as Jared makes a ruckus and Carol tries to get them to take a break. Due to Jared 's antics, Henry demands of the Saviors which one killed his brother, not realizing it to be Jared himself, but receives no answer. Carol ultimately succeeds in getting Henry to leave. Later that day, Morgan lies to Henry that Gavin killed Benjamin and thus Henry had already gotten his revenge upon Benjamin's killer, but Henry remains unconvinced. While the militia prepares for the upcoming battle, Henry claims he wants to join the fight, but Carol refuses and Ezekiel orders him to defend the Hilltop from the inside and keep others alive. The next night, he gets his hands on a machine gun and heads to the Saviors' pen to demand to know who killed his brother. As Gregory and Alden try to reason with him, Henry remains unreasonable and threatens to kill people until he finds out. Henry then enters the pen and demands the killer to reveal himself before he starts shooting. When a reanimated Savior starts attacking the prisoners, Henry kills two Saviors before Jared tackles him and leads everyone out. Feeling guilty because of his actions, Henry runs into the woods to chase after the escaped Savior prisoners. After fleeing from the community, Henry is chased by walkers and after losing his staff, he manages to seek shelter by hiding in a nearby stream. That night, Henry is surrounded by three walkers when Carol arrives after hearing his screams for help and kills the walkers. She then embraces him, pleased that she was wrong about his fate. Upon arriving back at the Hilltop, Morgan tells Henry that he killed the Savior who murdered Henry's brother. As his face falls, Henry apologizes to Morgan who then embraces him and tells him to never be sorry. While the militia prepares for the final battle, Morgan suffers from a delusional episode and prepares to attack Alden and the other Saviors, Henry steps in, but is knocked to the ground by Morgan's staff. Fortunately for him, Morgan snaps out of his episode and realizes he just attacked Henry. As Morgan takes off, Henry is checked up on by Carol. When the Saviors arrive at Hilltop later that day, Henry is among the civilians to evacuate out of the settlement and into the woods for safety. After the war ends and Negan is defeated, Henry returns to the Kingdom with Ezekiel, Carol, and Jerry. During the year and a half that passed since the end of the war, Henry was adopted by Carol and Ezekiel and they formed a new family. Having moved from the Kingdom to the work camp along with several other residents, Henry helps out by giving water to the workers as they build the bridge. One morning, Ezekiel explains to him how vital the bridge will be in connecting the communities. Carol then hands Henry his staff and kisses him goodbye. Later that day, Henry gives water to the workers on the bridge when Justin shoves him down for not giving him extra water and starts drinking from the jug. Henry gets angry and knocks him down with his staff. Before a furious Justin can retaliate, Daryl stops him, saying that the kid's just doing his job. They then start fighting until Rick arrives and stops them. When walkers arrive at the construction site, Henry watches as Daryl beats Justin for not warning the camp. In the years following Rick's presumed death, Henry spent much of his adolescence under the protection of his adoptive parents within the Kingdom with the hope of becoming a blacksmith one day, so he could improve community facilities that were beginning to crumble. Six years later, Henry sasses Ezekiel about their deteriorating community after fixing the pipes, but Ezekiel warns him to watch his tone. Shortly after, Henry is granted permission by Ezekiel to travel to the Hilltop with Carol to become Earl 's apprentice as long as they'll see each other before the fair. On the road, Carol tells Henry they have to take a detour before going to Hilltop when suddenly they hear a woman screaming and Henry runs over to help, only to find Regina with a group of former Saviors. Carol runs over with a bow and arrow as Jed walks up with more bandits and surround them. After taking all their supplies out of desperation, Jed demands Carol's wedding ring. An angry Henry kicks up his stick and knocks Jed down, but is overpowered and thrown to the ground. Carol jumps in and gives Jed her ring so the bandits can leave. That night, Henry scolds Carol for not defending herself as she had taught him but she says that she couldn't risk him getting hurt. The next day, he apologizes to his mother for his behavior but gets confused when he notices she's wearing her ring again. When Carol takes another detour, they find Daryl and she invites him to come along with them. Having been invited by Daryl to his camp, Henry asks Carol if she brought him so she could convince Daryl to be his chaperone and opposes to the idea. While having dinner that night, he asks Daryl how he got his scar on the eye but he ignores him and leaves to find his dog . When Daryl finds his dog stuck in a trap and surrounded by walkers later that night, Henry follows him despite his objections and saves him from a walker only for Daryl to scold him. When they return to the campsite, Henry notices an x shaped scar on Daryl's back as he changes his shirt. Daryl then sits next to him and tells him that this is the first time the dog got caught in his trap. Henry thanks him for the save and tells him Carol misses and worries about him. He then suggests he should come to Hilltop with them because he is not the only person he should look after, which finally convinces Daryl to travel with them. Upon arriving at Hilltop the next morning, Henry wonders if Enid will remember him from when he took refuge there during the war. When Aaron greets Daryl and tells him they could use his help locating Eugene , Henry tries to tag along, but Carol instead says he needs to stay and she will help him move to a new house in the community. Shortly after relocating, Henry says goodbye to Carol and promises to make her proud. He then starts his apprenticeship at Earl's blacksmithing tent under his and Alden 's guidance. Enid later checks up on Alden and jokes with Henry about how fast he is learning. When Earl invites him to dinner, Henry refuses when he sees Enid and Alden kissing. After finishing eating away from the other residents, Henry is called by a group of teens who recognize him from the war to talk with them and shortly after, they invite him to hang with them in the woods. That night, Henry drinks with his new friends in a shed outside of Hilltop when Gage suggests they have some more fun and takes them to a covered hole in the ground with a walker inside. Addy leaves as they throw rope rings at it and Rodney pees on it. Henry jumps in and mercy kills the walker but is left alone. Somehow, he manages to climb out and makes a fuzz to enter Hilltop, where he pukes on the animals and on Tara 's shoes. Having been punished for his misbehavior, Earl visits him in the cells and eventually decides to give him a second chance. While locked in his cell waiting for his sentence to be fulfilled, Henry watches confused as Daryl, Michonne , and Tara escort a girl into the adjacent cell and he is then informed by Daryl that Jesus is dead. Later that day, Daryl takes Henry outside for a moment and scolds him for his misbehavior before reminding him that he has one more night left in the cell. When Daryl returns to the cell and aggressively demands the girl to reveal details about her group, Henry listens to the entire conversation and yells at Daryl to stop but is immediately shut down. Daryl reluctantly agrees and then reminds Henry that his place is to remain locked in a cell until he realizes it. After he leaves, the girl thanks Henry for saving her life and eventually introduces herself as Lydia , while Daryl listens to the whole conversation from the window. Henry learns about Lydia's past after she tells him how she survived at the start of the apocalypse with her parents in a shelter. He then tells her his mother died at the start of the outbreak and he had been raised by Carol, who would do anything to protect him and he describes as someone nobody would want to mess with. The next day, Henry offers Lydia an egg but she says that hunger is a gift. When she asks why he's being nice to her, he confesses his brother and father were messed up before they found refuge and it took a lot of someone being nice to make things okay again. Upon revealing that his adoptive parents live in another community called the Kingdom, Daryl takes Henry outside and scolds him for endangering his family. After revealing to be using him, Henry lashes out, believing Lydia to be a good person who got messed up, and calls Daryl an asshole. That night, he reveals to Daryl, after realizing he was most likely abused in the past, that he overheard Carol telling Ezekiel that she kept her hair short because her ex husband used to pull it and abuse her when it was long. Henry guesses that it took her this long to feel safe again. Later that night, Henry frees Lydia from the cell so they can hang out outside. Lydia immediately grabs a worm from the ground and eats it before giving one to Henry, who does the same. Despite his good intentions, Lydia tries to hit him with a nearby hammer so she can escape until she hears a baby crying, which triggers memories and makes her ask Henry to return her back to the cell and stay with her the rest of the night. They hold hands through the bars and fall asleep. The next day when Lydia finally confesses her mother had lied to her all the time about her father and had been the cause of his death, Henry feels sorry for the abuse she had to suffer. He then follows Daryl outside and apologizes for his behavior earlier, before asking if Lydia can stay in the community. Daryl says they'll see and asks him to get Lydia fresh clothes, while he talks to Tara. Before leaving, Henry tells Daryl he's glad he and his mom are friends. When Alpha arrives outside the gates with a group of Whisperers to offer trading Alden and Luke for her captive daughter, Henry tells Daryl that they can't accept because Lydia will keep being abused, and eventually decides to hide Lydia in a cabin in the woods to keep her safe. When Enid and Addy show up to demand Lydia back for Alden and Luke, Henry refuses to give her up and listens as Enid explains she had to watch her parents die and how Carl told her she has to live for more than survival. Henry's torn so Lydia offers to give herself up to save their friends. She kisses Henry and they return to Hilltop. Later that day, Henry watches from the gates as Daryl hands Lydia over to Alpha in exchange for Alden and Luke. He then tells Daryl that what they did isn't right, but Daryl reminds him they had and they just have to live with it. That night, Henry leaves the community and heads into the woods to search for Lydia. While watching the Whisperers from a close distance, Henry knocks out a Whisperer when suddenly Beta grabs and tosses him in front of Alpha. Upon revealing he came alone to rescue Lydia, Henry is punched in the face by her and is taken as a captive by Alpha to their camp where upon arriving he is tied up to a tree by Beta. When a pair of Whisperers challenge Alpha for her leadership, Henry looks on in horror as Alpha brutally executes them and holds the woman's decapitated head as a trophy. Shortly after, Lydia shows Henry she still has the necklace he gave her, signaling she secretly supports him. That night, Beta takes Henry to Alpha who then orders Lydia to pick up a knife and kill Henry to prove her loyalty. Before Lydia could make a decision, a small herd of walkers arrive at the camp and begin eating the unmasked Whisperers. Alpha and the others quickly put on their masks to try to lure the herd away as Daryl and Connie arrive disguised as Whisperers to rescue Henry. They grab Henry, who grabs Lydia, and together they escape. Following their daring escape from the Whisperers, Henry and Connie refuse to leave Lydia behind and run off with her in another direction forcing Daryl to follow them. The next day when Lydia warns Daryl that Alpha's going to send Beta to retrieve her, Henry gifts Lydia a spear he made for the upcoming attack but she reminds him she's not willing to kill her own people and then scolds him for risking his life for her, claiming that what he did made Alpha look weak. He reminds her he cares about her and they kiss. Daryl interrupts and tells them to keep watch. When the Whisperers enter the building, Henry knocks one of them out until suddenly a Whisperer stabs him in the leg. Before Henry can be killed, he is rescued by the dog and Lydia. With all of the remaining Whisperers dispatched, Henry sits against the wall and is tended to by Lydia whom he apologizes for not being able to avoid killing. Lydia reassures him with both acknowledging that they hate the situation before Connie comes to help treat Henry's injuries. Afterwards, Connie draws the herd away with her slingshot and Daryl tells the group they're headed to Alexandria . After being received in Alexandria by Michonne, Henry has his leg stitched by Alex in the community's infirmary alongside Lydia. Once his wound is successfully healed, she assures him that the scar would help him remember his heroic act. When the main reason for their visit to Alexandria was completed, Henry and his group left the community that night to head to the Kingdom. The next day, they pick up Michonne and Judith in their cart along the way. Upon arriving at the Kingdom as the fair starts, Henry is scolded by Carol for running away, but then is embraced by his parents as the family reunites. As everyone catches up, Tara spots Lydia among the group. \"The plan was to bring Henry… just Henry\" Tara says angrily to Daryl. When the communities leaders reunite inside the theater, Henry listens as they decide to grant asylum to Lydia in Alexandria, send some soldiers to Hilltop to guard against any potential attacks from the Whisperers and to re-establish the charter. He then sees as they all sign the charter. Later that day, Henry shows Lydia around the community when his parents invite them to the movies at night. He and Ezekiel later say goodbye to Carol as she and a group leave to Hilltop. A while later, Henry talks with Addy who apologizes for ratting him out, although he tells her he understands. He then sits with a lonely Lydia and assures her he likes her. They kiss and he leaves to check on the pipes, asking her to save him a seat at the movies. At some point later that day, Henry is somehow among the residents kidnapped by Alpha and taken away to a barn in the woods where they are about to be attacked by the Whisperers but are found by Ozzy , Alek , and D.J. , giving the group a chance to fight back. During the fight, Henry stands up slow due to his leg injury. In the middle of the chaos, Alpha arrives and the group is subdued. She then decapitates everyone as Siddiq is forced to watch, only leaving him alive as a witness. Henry's decapitated head is later put by Alpha on one of the several pikes used for the Whisperers' border. The next day, Daryl, Michonne, Carol, Siddiq, and Yumiko find the border and watch in horror at the victims, a reanimated Henry being among them. They then put down their zombified heads to properly rest. When the group returns to the Kingdom, Siddiq delivers the tragic news and narrates how Henry and the others fought together as a family in their last moments. He finishes the story by encouraging everyone to remember the fallen as brave heroes and to honor them. Sometime later, Daryl and Lydia visit the border where the pikes had been placed. Lydia places the Hilltop medallion Henry gave her at the base of his pike in his memory. Henry is remembered in a post-traumatic flashback Siddiq has to the prisoners' last stand. Carol looks at the cover of a textbook and hallucinates seeing herself at the head of a table with Henry, Sophia , Lizzie , Mika , and Sam with blood over their necks sitting around the table. In another hallucination, Henry appears from behind Carol with blood around his neck and calls out to her as she walks around a hallway. When Carol dreams of an idyllic fantasy, she wakes up to the sound of music and finds Daryl cooking in the kitchen. She then sees Henry at the kitchen table asking her where she's going.",
        "Death": "Killed By Alpha (Alive, Off-Screen) In order to mark a border between the land belonging to the Whisperers and the communities, Alpha disguises herself and infiltrates the fair to kidnap several residents. Afterward, she decapitates them and then places their heads on wooden pikes to mark the border, with Henry being among them. Daryl Dixon , Carol Peletier , Michonne Grimes , or Yumiko Okumura (Zombified, Off-Screen) After finding the border, his zombified head is put down by either Daryl, Carol, Michonne, or Yumiko.",
        "Killed Victims": "This list shows the victims Henry has killed: Gavin 2 unnamed Saviors At least 1 unnamed Whisperer Numerous counts of zombies",
        "Relationships": "For a more in-depth look at Henry's relationships, read here: Henry Sutton (TV Series)/Relationships",
        "Appearances": "",
        "Gallery": "For more images of Henry, please visit Henry Sutton (TV Series)/Gallery .",
        "Trivia": "Henry is the youngest character to directly kill a living person . Henry is the third child adopted by Carol Peletier , the first being Lizzie Samuels and the second being Mika Samuels . As of his death in \" The Calm Before \", there are no surviving blood relatives of his family. Henry is the last character to die in Season 9 . Henry is the last named Kingdom resident to die. While Henry was the last named Kingdom resident to die, his brother Benjamin was the first to die. Henry appears in the archival footage shown at the beginning of \" A New Deal \" as Judith narrates past events of the show to the audience before the episode's story begins.",
        "Name": "Henry Sutton"
    }
]