[
    {
        "Henry": "Henry",
        "Pre-Apocalypse[]": "Nothing is known about Henry's life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "Sometime within the month after the assault from Woodbury , Henry joined the community at the West Georgia Correctional Facility . Armed with a sharp poker, Henry is out along the perimeter fence taking out walkers. Part of a group consisting of Karen , David , Chloe , and another man , they work methodically as a team to put down walkers and spread out any groups. Henry flees the zombie attack in Cell Block D with other survivors. Later, Henry is seen with Mr. Jacobson and a woman in the cell block, observing the aftermath and removal of the deceased survivors. Henry can be seen in the prison yard with Glenn Rhee , Maggie Rhee , and other survivors, digging graves for the residents killed in the Cell Block D attack. Sometime later, Henry is sent to Cell Block A for quarantine. Henry is first seen barely alive and receiving medical treatment from Hershel Greene and Glenn. Hershel attaches an intubator on Henry to enhance his breathing and leaves to check on the other sick survivors of the prison. Glenn watches over him and eventually Henry succumbs to the fever. Glenn attempts to revive him, but fails. Henry reanimates soon after and tries to attack Glenn, but is lured away by Lizzie Samuels . As Lizzie lures him away, she trips and he falls on top of her. Hershel runs over and tosses him over the railing to save her. Later on, Hershel returns to an undead Henry after Glenn is coughing blood, to retrieve the intubator around his head. Maggie breaks into the cell block and shoots him, saving her father. Henry is shown opening the front gate with Carl Grimes as survivors return to the prison in a flashback sequence.",
        "Death[]": "Killed By The Flu (Alive) Henry succumbs to the flu and dies from choking on his own blood. Maggie Rhee (Zombified) As Hershel struggles to get the intubator off a zombified Henry's mouth, Maggie shoots him in the head.",
        "Killed Victims[]": "This list shows the victims Henry has killed: Nick (Possibly, Zombified) Numerous counts of zombies",
        "Appearances[]": "",
        "Name": "Henry"
    }
]