[
    {
        "Hilde": "Hilde",
        "Overview[]": "Hilde is a cheerful, humble, and optimistic woman. She and her husband, Miles , had survived with only each other for a while, and are shown to love each other very much. Eventually they find Hilltop and become members of the group. Hilde's skills in making jewelry are greatly valued, as she also uses her skills to make a symbol for Hilltop, a wooden coin with the letter H on it. Overall, Hilde just seems to want the best for everyone and to make people happy, with Miles encouraging her to make more Hilltop coins, thinking people will like them. The two head to the fair with high-spirits. Tragically, the two are killed by Alpha , and Hilde's scalp and clothes are used by her to invade the Kingdom .",
        "Pre-Apocalypse[]": "Nothing is known about Hilde's life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "At some point in the apocalypse, Hilde and Miles discovered the Hilltop on one of their anniversaries after fighting walkers in the woods. Over the years, they become trusted members of the community, with Hilde being known for making Hiltop's signature coins. While preparing to head towards the fair on their anniversary along with Casper and Martin , Hilde shows her husband a box of her wooden \"H\" coins she will use to trade for a gift. On their way, they are ambushed by Alpha and are killed. Alpha then steals Hilde's scalp and clothes, disguising herself as \"Deborah\" to infiltrate the fair.",
        "Death[]": "Killed By Alpha (Caused or Direct) The Whisperers Hilde is ambushed in the woods by Alpha and is killed. She is then scalped and has her clothes stolen by Alpha.",
        "Killed Victims[]": "This list shows the victims Hilde has killed: Numerous counts of zombies",
        "Appearances[]": "\" The Calm Before \"",
        "Trivia[]": "Alpha killing Hilde and using her scalp and clothes as a disguise is ironic, as her actress, Caroline Duncan , works as a costume and wardrobe designer for film and television. It's possible she reanimated as when Ozzy directed the rest of the group to the location of the ambush, she was no longer there. Furthermore both Martin and Casper were left to reanimate as walkers.",
        "Name": "Hilde"
    }
]