[
    {
        "Holly": "",
        "Pre-Apocalypse[]": "Nothing is known about Holly's life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "At some point in the apocalypse, Holly joined a community called the Alexandria Safe Zone where, upon being interviewed by Deanna , she was appointed as one of the guards at the gates. While unseen, Holly attends Deanna 's welcoming party for the new arrivals and socializes with the other residents and the new arrivals. She casually flirted with newcomer Noah as witnessed by Tara . While unseen, Holly tricks Eugene to cover her post at the gate for a few minutes but ends up leaving her shift for him to finish. Later that day during the meeting at Deanna's house regarding security in Alexandria, Rick appoints Rosita, Spencer, and Holly as lookouts. As the Wolves invade Alexandria, ransacking homes and murdering residents, Holly fights to defend the community but a Wolf critically stabs her in the abdomen. She is immediately saved by Spencer from the outlook tower and then is taken to the infirmary by Rosita and Aaron . Though initially hesitant, Denise attempts to perform surgery in order to remove the knife stuck in her abdomen and stop the bleeding, but the surgery is unsuccessful and Holly dies of blood loss.",
        "Death[]": "Killed By Aaron (Indirectly Caused) Aaron leaves his backpack at Del Arno Foods , which causes the Wolves to locate and attack Alexandria. The Wolves (Alive) As Holly is fighting a Wolf, she gets stabbed in the abdomen and eventually dies from blood loss. Denise Cloyd (Before Reanimation) Before leaving the infirmary, Tara reminds Denise to put Holly down, which she proceeds to do.",
        "Killed Victims[]": "This list shows the victims Holly has killed: Possibly a few unnamed Wolves Possibly numerous counts of zombies",
        "Appearances[]": "\" JSS \" (No Lines)",
        "Trivia[]": "Holly was mentioned at least three different episodes in Season 5 and Season 6 before finally making her only appearance in \" JSS \", her death episode. In \" Spend \", Tara asks Noah about Holly, hinting that Noah has a crush on her, to which he shrugs off Tara's questions. Tara proceeds to joke around and ask Noah about Holly a second time."
    }
]