[
    {
        "Pre-Apocalypse[]": "Nothing is known about Huck's life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "At some point in the apocalypse, Huck somehow came into contact with a group called \"the Saviors\" which she subsequently joined upon where she was appointed as one of the Sanctuary guards. Huck aided her group in terrorizing other survivors and communities around the area into subjugating to Negan's will, where their victims would be forced to give half their supplies in exchange for not being murdered. Huck hangs out in the recreation room as Dwight and Laura play a game of tabletop hockey. Huck is outside at the entrance of Sanctuary with Fat Joey , Negan , and other Saviors, ready to unload the truck of provisions when suddenly Carl guns down George and Chris . She watches as Dwight subdues Carl and takes him inside. Huck is among the dozens of Saviors outside the Sanctuary cheering when Negan declares that they are going to war. Huck is working at the Shephard Office Plaza with her fellow Saviors when she is ordered by Mara to take over Todd 's place at a workstation. Moments later, she and her fellow Saviors are attacked by the Alexandrians led by Aaron and Tobin. As gunfire is exchanged by both sides, Huck picks up a rifle and begins firing back at the Alexandrians. Huck takes cover behind an overturned table as several of the deceased Saviors begin reanimating. Eventually, Huck is either gunned down or devoured by her zombified comrades. [1]",
        "Death[]": "Killed By The Militia (Caused or Direct) The Saviors (Infected, Possibly) Huck is either gunned down by the Militia or devoured by reanimated Saviors.",
        "Killed Victims[]": "This list shows the victims Huck has killed: Possibly numerous counts of zombies and unnamed people",
        "Appearances[]": "\" Sing Me a Song \" (No Lines) \" The First Day of the Rest of Your Life \" \" The Damned \" (No Lines)",
        "References[]": "",
        "Name": "Huck"
    }
]