[
    {
        "Isabelle": "",
        "Fate": "",
        "Contents": "",
        "Overview[]": "Though a member of the Saviors , Isabelle is shown to not be loyal to the same extent as many others. She seemed disillusioned by her way of life and has developed a very cold, callous, and cynical personality. After being captured by Michonne , she initially tries to fight back, but when her plan is foiled she seemingly gives up. She does as she is told and takes Michonne to Negan . Isabelle seems to despise who she has become, going along with the Savior terrorizing communities for supplies. Before her death, Isabelle gives advice to Michonne before apathetically telling her to kill her, knowing she probably will be punished for bringing Michonne to Negan.",
        "Pre-Apocalypse[]": "Nothing is known about Isabelle's life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "At some point in the apocalypse, Isabelle somehow came into contact with a group named \"the Saviors\" which she subsequently joined. Isabelle aided her group in terrorizing other survivors and communities around the area into subjugating to Negan's will, where their victims would be forced to give half their supplies in exchange for not being murdered. Despite this, it seems that she became disillusioned with this type of lifestyle. Isabelle is driving a pick-up truck by herself when she notices a line of walker corpses in the road. As she gets out to investigate, she is captured by Michonne . After being disarmed, she is forced to take Michonne to Negan . While she attempts to overpower Michonne, she is unsuccessful and Michonne continues to hold her hostage. Isabelle drives Michonne towards the Sanctuary and chooses to remain silent, ignoring all of Michonne's questions. After reaching a hill, she points out the Sanctuary in the distance to Michonne and advises her that she should leave and get rid of the car, and mentions there is a silencer in the glove box for her to kill her with. Moments later, Michonne executes Isabelle and dumps her body in the woods.",
        "Death[]": "Killed By Herself (Caused) Michonne Hawthorne After leading her to the Sanctuary, Michonne shoots Isabelle at her request, and dumps her body.",
        "Killed Victims[]": "This list shows the victims Isabelle has killed: Herself (Caused) Numerous counts of zombies and possibly unnamed people",
        "Relationships[]": "",
        "Appearances[]": "\" Sing Me a Song \" \" Hearts Still Beating \"",
        "Trivia[]": "In the \"In Memoriam\" scene on the Talking Dead for \"Hearts Still Beating\", this character is called Redheaded Savior ."
    }
]