[
    {
        "Jacqui": "Jacqui",
        "Overview[]": "Jacqui is a cautious woman with little words who shows compassion and sympathy for her friends. Although the world has fallen apart and many people have lost most, Jacqui remains calm and looks at the best of every situation, regardless of its flaws. She likes doing what is best for the group of survivors, and is not hesitant to make sure no threats are present, especially when she comes to the realization that Jim has been bit by a walker. During her time with the survivors, Jacqui is shown to be very resourceful, smart and helpful, helping to assist the group escape the department store by telling them the building might have access to the sewers in their basement. Although it didn’t work out as planned, Jacqui was still able to assist the survivors in a helpful way. Jacqui is ultimately also a brave woman, who ends up committing suicide during the CDC explosion, taking a lesser-painful way out, rather than being bit later on. In her last moments, she comforts Jenner as they hold hands and she smiles with tears in her eyes.",
        "Pre-Apocalypse[]": "Nothing is known about Jacqui's life prior to or as the outbreak began, except that she looked after her brothers when their mother died and she worked for the city's zoning department.",
        "Post-Apocalypse[]": "During the onset of the outbreak, Jacqui escaped from Atlanta as her entire family was devoured by walkers. Sometime later, she encountered and joined a campsite of survivors outside the outskirts of the city. She helped out the group by going out on supply runs and performing simple chores around camp. Jacqui also appeared to have developed a bond with T-Dog.",
        "Death[]": "Killed By Vi (Caused) With the CDC building losing power, Vi deploys the HITs to prevent any diseases from escaping and decontaminates the entire facility. Herself (Suicide) Jacqui decides to commit suicide in the explosion, along with Edwin, after losing hope in things going back to normal.",
        "Killed Victims[]": "This list shows the victims Jacqui has killed: Herself (Suicide) Possibly numerous counts of zombies",
        "Appearances[]": "",
        "Trivia[]": "Jacqui states that the item she misses most is her \"coffee maker with a dual drip filter and grinder\". In a Season 1 commentary, it is revealed that Jacqui was not originally planned to be killed off in the final moments of Season 1. Jacqui was also originally planned to only be in 1 or 2 episodes. Jacqui appears to have a bond or close relationship with T-Dog. When Jacqui calls T-Dog \"sweetie\" in \" TS-19 \", it can be inferred that they are close friends, relatives or possibly even lovers. Jacqui is the last character to die in Season 1 , along with Edwin Jenner . They are also the first supporting characters to die in the last episode of a season. They are also the first supporting characters to not die from a walker bite or infection. They are also the first supporting characters to commit suicide. Jacqui is mentioned numerous times in Season 2 and Season 3. In the deleted opening scene of \" What Lies Ahead \", Rick and Lori mention Jacqui as they discuss her death with the group as they rest in the Vatos nursing home. In \" What Lies Ahead \", Rick indirectly mentions Jacqui during an attempt to contact Morgan Jones over the radio. In \" Save the Last One \", Lori and Rick discuss Jacqui's death and how she no longer has to suffer while Carl deals with a gunshot wound. In \" Say the Word \", Carl mentions Jacqui's name as a possible name for his newborn sister . Jacqui is last mentioned in the episode \" Monsters \" in Season 8.",
        "Name": "Jacqui"
    }
]