[
    {
        "Jake Daniels": "",
        "Overview[]": "Jake appears to be generally friendly, eagerly introducing himself to Daryl Dixon upon their first meeting, although he is somewhat rude to Hershel when he captures the boy. However, Jake appears to be somewhat incompetent, struggling to take down a single walker on his own even when armed with a knife, stabbing it in the wrong spot and then being almost bitten by it, forcing Mercer to save him. He is later effortlessly ambushed and killed by Negan who is only armed with a crowbar. Despite coming off as an affable and genuine person, after he joins the Commonwealth Army he helps aide in wiping out the people of Riverbend under Toby 's orders. It's unknown how Jake felt about killing other survivors. He most likely joined the army with good intentions and when on the mission didn't want to disobey orders.",
        "Pre-Apocalypse[]": "Nothing is known about Jake's life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "At some point during the outbreak, Jake joined a community in Ohio. Jake is present at the \"Kill House\" along with his fellow trainees, including Daryl Dixon and Rosita Espinosa . General Mercer, overseeing their training for the day, informs them that they will be split up into teams of two and will have to share a small knife between each other as they make their way through the dilapidated home-turned-obstacle course. Mercer explains that the exercise is to promote teamwork and speed, and whoever kills a walker marked in red paint at the end of their run passes. Jake is paired with Daryl, who hands him their knife after the former introduces himself. Despite Daryl insisting that he and Rosita make a good team, Mercer refuses to switch the groups he assigned, and pairs them in competition against Rosita and her partner, Green . As Jake and Daryl make their way through their half of the Kill House, they are monitored by Commonwealth soldiers outside and attacked by walkers inside. After Daryl gets into a scuffle with one, Jake offers him the knife, only for Daryl to insist he go on ahead of him. Jake complies, and Daryl manages to kill the walker on his own with a brick. However, without his partner, Jake is attacked and pinned down by another walker, and begins to call out for Daryl to help him. Daryl spots the red-marked walker Mercer had spoken about earlier, and prioritizes killing it before saving Jake. He dispatches the target, and before he can rescue Jake (who is now seconds away from being bitten), Mercer intervenes and shoots it in the head with his handgun, saving his life. Daryl angrily interjects, saying he was about to save Jake himself, only for Mercer to reprimand him for putting 'speed' over 'teamwork', as the drill was meant to promote a combination of both. Jake is among the Commonwealth soldiers dispatched to accompany Aaron , Gabriel , Toby , and Jesse to offer an invite to the Commonwealth to a community that was discovered on the western edge of Virginia. However, the mission was a cover operation planned by Lance Hornsby to capture and interrogate the survivors after a Commonwealth caravan was massacred and looted. After taking over the community, Jake was tasked to check the rear of the building for any other hostiles, and when he returned to the front room, he found the body of a fellow soldier and the captured Gabriel missing. Toby then takes his gun and puts down the soldier before he could reanimate. In brief flashback on how Gabriel was freed, it was revealed that Negan and Annie rescued him and killed the soldier, in which Jake is seen arriving moments later and alerting Toby of the breach. He then accompanies Toby to the roof with the surviving soldiers and witnesses several Riverbend residents be executed. Jake finds Hershel Rhee in a truck near the apartment building and brings him into the lobby where he radioed Sergeant Crowe about locating the kid. Before he could share further details, he was hit and stabbed in the head with a crowbar by Negan , killing him.",
        "Death[]": "Killed By Negan Smith Shortly after Jake apprehends Hershel and reports his discovery, Negan comes up behind him and bashes him in the head with a crowbar. Negan then finishes Jake off by stabbing him in the head.",
        "Killed Victims[]": "This list shows the victims Jake has killed: Hart (Possibly) At least 10 unnamed Riverbend residents (6 Caused, Alive, 4 Possibly, alongside Commonwealth Army ) Numerous counts of zombies",
        "Appearances[]": "\" New Haunts \" \" Warlords \" \" The Rotten Core \"",
        "Trivia[]": "Jake is the last named character to be killed by Negan Smith in the TV Series . Negan's last kill in the TV Series is similar to the first person he killed, with both victims being hit from behind and then bashed/stabbed in the head."
    }
]