[
    {
        "Overview[]": "Jared can be summarized as a bully in every sense of the word; an obnoxious, violent, boorish, brazen, spiteful, and seemingly compassionless man who takes every opportunity to physically and mentally abuse people for amusement and who appears to be completely devoid of empathy for other human beings. Unlike most of his fellow Saviors , who generally had some positive aspect to their personalities, or at the very least, understandable motivations, Jared seemed to have no redeeming qualities whatsoever, never once showing the slightest bit of concern or genuine respect for anyone except himself. He is shown to take great pleasure in terrorizing, taunting and antagonizing the people of the Kingdom and seems to have a particular dislike of Richard , starting a fight or argument on each of their meetings. He also has no respect for property, as seen when he stole Morgan 's fighting stick. Jared appears to be a sadist, as he smirked while shooting Benjamin in the leg and seemed greatly amused by the subsequent pain and anguish this caused the people of the Kingdom, took delight in cruelly mocking Morgan over Benjamin's subsequent death and later says \"music to my ears\" with a smile as Hilltop members were screaming while being devoured by walkers, further showing Jared's lack of empathy and remorse towards other people. It was Jared's violent, vicious and bullying behavior towards the people of the Kingdom (and his cold-blooded murder of Benjamin) that motivated them to aid the people of Alexandria and the Hilltop in their fight against the Saviors. Jared is quite different from most of his fellow Saviors, who generally do what they feel they have to do to survive, while Jared takes visible delight in his violence, and subsequently has a poor relationship with his superior Gavin , who although tolerant of Jared's bullying has a very low opinion of him for it, although after learning that Benjamin had died of the gunshot injury Jared had inflicted Gavin reached the end of his tether and threatened to kill Jared himself should the latter answer him back. Jared's antisocial behavior is in sharp contrast to Gavin's, as the latter is a more reasonable and civil man. Jared was possibly the most morally bankrupt, unsavory, heartless and depraved of all the Saviors; while Negan genuinely believed he was saving people, and even the more sadistic Simon believed he was acting in the best interests of the group, both seeing their ruthless behavior as justified, Jared never once looked out for anyone except himself and the sole reason for his violent and murderous actions was the twisted, sadistic joy he got from victimizing other people. When the tables are turned on Jared however, he shows himself to be a coward. Although he arrogantly didn't believe the Militia would harm any of the 39 Saviors (Jared among them) they took captive, having clearly gotten used to getting away with his violent, bullying behavior without any consequences, he was shocked when Maggie proved him wrong by killing Dean and from that moment onwards became very withdrawn whenever she was around, doing his best not to attract her attention, having clearly realized for the first time that he actually may not survive after all. When confronted with an armed Henry looking for his brother's killer in \" Do Not Send Us Astray \", Jared pathetically tried to hide behind another Savior, mostly unsuccessfully due to Jared's size compared to the smaller man. In his final moments in \" Still Gotta Mean Something \", when he is trapped by walkers, he quickly resorts to begging and pleading for Morgan to save him even though he certainly wouldn't have done the same had it been the other way around (having been willing to kill him just moments before) and never once showed anyone the slightest bit of the mercy he begged Morgan to show him in his final moments, dying the pathetic and disgraceful person he always was.",
        "Pre-Apocalypse[]": "Nothing is known about Jared's life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "At some point in the apocalypse, Jared somehow came into contact with a group named \"the Saviors\" which he subsequently joined. Jared aided his group in terrorizing other survivors and communities around the area into subjugating to Negan's will, where their victims would be forced to give half their supplies in exchange for not being murdered.",
        "Death[]": "Killed By Reilly (Indirectly Caused) During the walker attack on the dive bar, Jared attempts to escape only to be engaged in a fight by Morgan, who has been released by Reilly. Morgan Jones (Caused) Ultimately, Morgan kicks Jared into a hallway from where walkers are coming down and closes a metal gate to block Jared's escape route. As Morgan holds the grate closed, he grabs Jared by his flannel shirt and holds him against it so that he can't escape. Zombies Jared screams as he is bitten several times and continues to beg Morgan to let him go, which the latter does after Jared is too weak to move. He is subsequently devoured by the herd of walkers as Morgan watches in seeming pleasure. It is unknown if Jared reanimated or not.",
        "Killed Victims[]": "This list shows the victims Jared has killed: Benjamin (Alive) Richard (Indirectly Caused) Numerous counts of zombies and unnamed people",
        "Quotes[]": "The following is a list of some of Jared's most memorable quotes.",
        "Appearances[]": "",
        "Trivia[]": "Jared's death is very reminiscent of Jimmy 's, T-Dog 's, Noah 's, David 's, and Paula 's deaths in the fact that all are eaten alive by walkers by a door/fence while another character(s) is able to escape and live. Also, most of them were initially bitten around the face/neck area. Joshua Mikel also played a walker in the season 2 finale \" Beside the Dying Fire \". Jared is shown to be a very weak fighter, despite his brutal personality. This is shown when he is easily overpowered and countered by Richard, and even by Morgan despite cheapshotting him and nearly killing him, is easily overpowered and later killed. In \"The Damned\" as Morgan reaches the outside of the outpost where the Saviors are rounded up, Jared can be seen holding a rifle. Several seconds later as he speaks to Morgan, his rifle is missing. During an interview, Joshua Mikel states that he had auditioned on the Walking Dead fifteen times before landing the part of Jared. [1] Joshua Mikel has stated that he found Jared's long hair extremely obnoxious and often asked the writers if there could be a scene where his hair gets cut off. On the other hand, he also says there are benefits, such as helping him get more roles as bad guys due to his villainous look. [1]",
        "References[]": "",
        "Name": "Jared"
    }
]