[
    {
        "Jed": "",
        "Fate": "",
        "Contents": "",
        "Overview[]": "Jed's personality while under Negan's leadership is unknown, as is his standing in Savior society, though it can be assumed that he was loyal to Negan's ways and more than willing to steal from other survivors. 18 months following the establishment of peace, Jed behaves as a regular person would, and is more helpful than some of his fellow Saviors. He has a tendency to panic under pressure, which results in him accidentally crushing Aaron's arm with a log, though he is quick to help afterwards. Jed seems to be on friendly terms with most Saviors , as he can be seen socializing with Laura and Regina around a campfire. He also mocked Justin when he was knocked down by Henry , but was quick to back his friend up in a fight. Indeed, Jed shows great care towards his fellow Saviors, as he exhibits concern and anger when members of his group start disappearing. During this time, however, Jed seems to have maintained a searing resentment of the other communities, which starts to boil over once Oceanside starts abducting and killing Saviors. He sees the disarmament of his group as an injustice that left them vulnerable to attackers. Jed becomes increasingly violent as more and more Saviors go missing, and even more so when Justin is discovered dead, going as far as punching Alden in the face. He eventually attempts to get the firearms he desires through violent means, going as far as taking Carol hostage and leading a raid on the campsite. After the shootout, Jed retreats and presumably cuts off all ties between the Sanctuary and the other communities. At some point afterwards, the Sanctuary goes bust. Rather than join one of the other communities, Jed decides to live in the wilderness, with Regina and 7 other Saviors following his example. When questioned about his decision, Jed claims that he simply doesn't fit in anywhere. Six years after Rick's disappearance, Jed was shown to have turned into an even crueler, desperate and hardened individual willing to do whatever was necessary to obtain resources. Overtime, he and his group resorted to robbing other survivors out of desperation. Despite this, he is also somewhat honorable, as he chose to leave Carol and Henry alive after robbing them due to her once sparing his own life, even allowing them to keep their wagon and horses. He also claims to have never hurt anyone he robbed, though it is possible he was lying to save himself. Before Carol burns him alive, Jed becomes fearful and tries to escape his fate, promising to never bother Carol again. His pleas, however, fall on deaf ears.",
        "Pre-Apocalypse[]": "Nothing is known about Jed's life prior to or as the outbreak began. The only thing that is known is that when he was 6 years old, he had a fight with a boy younger than him, a fight in which he lost.",
        "Post-Apocalypse[]": "At some point in the apocalypse, Jed somehow came into contact with a group named \"the Saviors\", which he subsequently joined. Jed aided his group in terrorizing other survivors and communities around the area into subjugating to Negan's will, where their victims would be forced to give half their supplies in exchange for not being murdered. During the year and a half that passed since the end of the war , Jed was forced to work on the Sanctuary under Daryl 's orders until Carol replaces him. Having moved from the Sanctuary to the work camp along with several other residents, Jed is part of the team of laborers working to build a bridge connecting the communities' trade routes. One morning, he mocks Justin after he is knocked down by Henry. As Daryl and Justin start fighting, Jed prevents Aaron from intervening until Rick arrives and stops them, forcing everyone to return to work. When a herd of walkers invades the lumber yard later that day, Jed panics and lets go of one of the logs, making it fall onto Aaron's arm, crushing it. Daryl orders Jed and another Savior to lift the log while he double-knives the walkers around him. That night, he socializes with Regina and Laura around a campfire. While searching for a missing Justin around the woods, Jed and a small group of Saviors encounter Maggie and Kal on their way to deliver food to the Sanctuary. He attempts to intimate Maggie by stealing one of the tomatoes from the supply cart and biting it in front of her. After questioning her about their missing people, Jed and the other Saviors let her pass and continue searching for their missing comrade around the area. When the work camp is informed of Justin's death, the Saviors become furious and Jed punches Alden for changing sides during the war until Carol steps in, threating to kill Jed otherwise. He then watches in amusement as the Saviors start accusing Daryl and Anne of being the culprits. They grab axes to retaliate when Rick rides in the middle of the group with his gun drawn and warns everyone to back off. Laura disarms Jed and tells him to calm down. At night, Jed stages an ambush in the woods for Carol and Rick by pretending to be a walker. When Carol holsters her gun and prepares to kill the seemingly undead Jed, D.J. blindsides her and pushes her into Jed who then holds Carol at knife-point and explains to Rick he only wants their guns back for protection. Carol sneakily pulls a knife out of her sleeve and stabs him in the shoulder while Rick forces D.J. to his knees. She then tells Jed he won't kill him because every life counts. The next morning, Jed and the Saviors leave the campsite upon learning of Arat's death. Shortly after leaving the camp, Jed and his fellow Saviors manage to disarm Alden while he tried to convince them to return to the bridge project. After discovering that the Oceansiders were responsible for the death of several Saviors, Jed leads a group of Saviors back to the camp to enact their revenge. As Carol pretends to surrender, she attacks him again while a shoot-out ensues. Jed fights alongside his companions and manages to survive the attack before the remaining survivors are forced to leave as a herd approaches the campsite. At some point following Rick's assumed death, the Sanctuary eventually falls as a community. Instead of joining any of the other communities, Jed takes the lead of a group of at least seven surviving Saviors and they choose to survive in the wilderness. In the following years, the group eventually became raiders where they would steal supplies from anyone they would encounter. They also ate their horses and started using walkers to transport their supplies. Six years later, Jed and his group use a trap to ambush Carol and Henry on the road. After taking all their supplies out of desperation, Jed tells Carol he will let her go due to her sparing him years ago but not before demanding her wedding ring. An angry Henry kicks up his staff and knocks Jed down, but is overpowered and thrown to the ground. Carol jumps in and gives Jed her ring so the bandits can leave. Jed thanks her and leaves with his group. At night, Carol sneaks into the Saviors' campsite and douses the sleeping bandits with gasoline. As Jed wakes up, Carol informs him the other supplies at their camp belonged to people who never came back and adds that he hurt her son. Jed claims that they found the supplies abandoned and never hurt anyone, and promises she will never see them again. Unmoved, Carol proceeds to light the match, setting Jed and the other Saviors on fire and burning them alive.",
        "Death[]": "Killed By Carol Peletier As payback for hurting Henry and presumably killing other survivors for their supplies, Carol locates Jed and his group's camp. She spreads fuel around and uses a lit match to ignite the fuel, burning Jed and the other Saviors to death.",
        "Killed Victims[]": "This list shows the victims Jed has killed: Kathy (Alive) 1 unnamed Kingdom soldier (Alive) Numerous campsite survivors (Caused and Direct) Several horses (Alongside his fellow survivors) Numerous counts of zombies and unnamed people",
        "Relationships[]": "For a more in-depth look at Jed's relationships, read here; Jed (TV Series)/Relationships",
        "Quotes[]": "The following is a list of some of Jed's most memorable quotes.",
        "Appearances[]": "\" The Bridge \" ” Warning Signs ” \" The Obliged \" \" Who Are You Now? \"",
        "Gallery[]": "For more images of Jed, please visit Jed (TV Series)/Gallery .",
        "Trivia[]": "Dan Fogler was the producers' top choice for Jed, but Angela Kang decided to cast him as Luke instead. With the deaths of Jed, Regina , and the rest of his group, all of the known remaining antagonistic Saviors are dead except for Negan. During the In Memoriam section of Talking Dead for \" Who Are You Now? \", Jed is listed as Savior Jed . He is the only one of his group who are named separately during the In Memoriam. The rest are billed as Saviors Getting Lit , including Regina despite her longer role on the show. Jed seems to have some kind of an oral fixation, as he is often seen with a toothpick, and later a match in his mouth, with which he is even shown sleeping. This match is ironically what is used to ignite the fire that kills him. Jed's claims of having only found the supplies may or may not have been true with the Whisperers as another possible explanation for what happened to the people that they once belonged to, given that the Whisperers were active at the same time as Jed's marauders. It is also possible that another group called \"the Highwaymen \" were responsible, since they emerged not long after Jed's group's demise. This is unlikely, however, given the Highwaymen's modus operandi. Instead, it is far more probable that the demise of Jed and his group enabled the Highwaymen to move into the area, as suggested by Carol. Oddly, depending on which version of the episode you watch, Jed's death is shown differently. He breathes loudly as he is set on fire rather than screaming and his reaction is different."
    }
]