[
    {
        "Jenny Jones": "Jenny Jones",
        "Pre-Apocalypse[]": "Nothing is known about Jenny's life prior to or as the outbreak began, except that she grew up in North Carolina and met her husband in Raleigh. At some point, they became married and together they had a son named Duane. The trio lived together as a typical family and they would go on several family trips.",
        "Post-Apocalypse[]": "During the onset of the outbreak, Jenny and her family evacuated from their home, upon where they witnessed several broadcasts informing other survivors to travel towards a supposed safe-zone in Atlanta . However, due to the chaos and horrendous events which transpired around them, the family was reluctantly forced to take refuge and heavily barricade themselves within a nearby house. At some point, Jenny was bitten and succumbed to the infection. Morgan was unable to put her down and released her into the outside to roam the streets for the following months. As her husband was unable to put her down, Jenny continued to wander around King County in a zombified state for some time after and would often return to the house where she had died at night. One day, while Morgan and Duane were scavenging in an abandoned house , Jenny followed them inside, presumably through the front door which Morgan had left ajar by accident. Jenny attacked Duane who was unable to bring himself to shoot his own mother. Upon finding this, Morgan was finally able to shoot Jenny in the head, but it was too late for Duane who died of his mother's attack and later reanimated himself. The loss of Jenny and Duane drove Morgan insane and he would leave Jenny's corpse in the house where Duane had died while chaining a zombified Duane up in the house where they had been living. Morgan would subsequently block out the memory of his return for Duane, believing that he had fled and never come back after losing his son.",
        "Death[]": "Killed By Zombies (Alive) Infection (Alive) During her family's evacuation to head towards Atlanta, Jenny gets bitten on the chest by a walker. Not being able to travel, she and her family stay in their house until she can feel better, but she succumbs to the infection and reanimates. Morgan Jones (Zombified) After a zombified Jenny bites Duane, Morgan finally makes the decision to shoot and put her down.",
        "Killed Victims[]": "This list shows the victims Jenny has killed: Duane Jones (Infected, Alive) Possibly a few zombies Possibly a few unnamed people (Infected)",
        "Appearances[]": "",
        "Trivia[]": "Jenny is credited as Morgan's Wife in \" Days Gone Bye \". She is the first Jones family to die of infection and reanimate and die. Jenny and Duane are mentioned by Morgan in \" Alaska \" as he chats with Rachel about staying healthy as a new mother. He mentions that Jenny had trouble keeping on weight to feed Duane, no matter how much Chinese food takeout Morgan brought home for them to eat. On the walls of Morgan's Houseboat in \" Remember What They Took From You \" is written \"Duane, Jenny, you were supposed to...\" and King County, Georgia . This is a reference to Morgan's lost family who died in King County. In \" All I See Is Red \", Jenny is seen for the first time physically alive in a flashback to when Morgan sees fond memories of his loved ones. Opening doors was a rare occurrence for the undead, and only occurred with those infected with the variant Wildfire strain. This makes it likely that Jenny was a variant walker that maintained intelligence about how to open doors and remembered where she died, and where her husband and son were staying at. The climbers encountered in Season 11 , including the one encountered in \" Variant \", were also capable of such skills, causing it to be mistaken for a Whisperer at first. Jenny was most likely a roamer variant. Jenny is one of the nine TV Universe characters to appear in Fear the Walking Dead , the others being Morgan Jones , Paul Rovia , Carol Peletier , Rick Grimes , Dwight , Sherry , Duane Jones , and Negan Smith .",
        "Name": "Jenny Jones"
    }
]