[
    {
        "Jerry": "",
        "Contents": "",
        "Overview[]": "Jerry is a friendly, jovial, generous, and rather optimistic survivor who also serves as the closest ally for his friend and leader Ezekiel . He is also a very charitable person, eager to give gifts of food to people he considers friends. Whenever he departs, he often waves away cheerfully with a peace sign, exhibiting his carefree nature. Although Jerry's behavior can sometimes irritate Ezekiel, the fact that they are almost always by each other's side suggests a great deal of mutual trust and respect between the two. Jerry's respect for Ezekiel is such that he will verbally admonish someone for interrupting as Ezekiel speaks. Despite his good natured personality, Jerry will never hesitate to kill someone who threatens him or his loved ones. However, he will only kill in self-defense and not because he genuinely wants to. This can been seen several times during the war against the Saviors , where he slaughters several members in order to protect his friends. A specific example is when he brutally chops Gunther in half, a Savior who was ready to kill Ezekiel.",
        "Pre-Apocalypse[]": "Nothing is known about Jerry's life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "At some point after the apocalypse he became one of the most trusted knights in Ezekiel's court. He later became his personal steward and bodyguard making sure to never leave his sight. He is almost never seen without his signature melee weapon—a two-handed battle axe. Jerry is first seen in the auditorium with Ezekiel and introduces his king and Shiva to Carol and Morgan . Jerry also accompanies Ezekiel and the others as they gather feral pigs in the city to give to the Saviors and later is present for the Savior exchange. At night, when Carol is gathering food from a courtyard, Jerry and Ezekiel appear, startling Carol. Jerry is dismissed by Ezekiel as he wishes to speak with Carol privately. Jerry attends to Ezekiel when he grants Rick Grimes and Paul Rovia an audience. Jerry at first calls Rick's attention to the regality of Ezekiel with his axe, watching the newcomers beg the king for his assistance. When Ezekiel expresses outrage at Jesus' betrayal of their trust in not sharing the community's association with the Saviors, Jesus defends himself, but Jerry harshly tells him to be silent when the king is speaking and to not interrupt him. Jerry seems to side with Rick and Jesus in their arguments that the Saviors could be fought and beaten, loudly offering his gratitude to Rick's story about the rock in the road. When Ezekiel announces that he would arrive at a decision the following day, Jerry ends the proceedings and attends Ezekiel out of the theatre. Jerry, Ezekiel and other members of the Kingdom are waiting at the pickup location for the Saviors' collections. He witnesses the heated exchange between Richard and Jared before the Saviors finally leave, Jerry is later present when Ezekiel and other Kingdom soldiers arrive at Carol's house to deliver a casserole. Ezekiel tells her they are there to clear the dead. As Carol says goodbye, Jerry hands her some cobbler which she accepts before telling them to go. Jerry is first seen with Ezekiel and the other Kingdom residents as they load a single cantaloupe onto a truck which has been stained with blood. Jerry is eating cobbler as the crew get ready for their scheduled drop with the Saviors - Ezekiel is slightly annoyed by Jerry's demeanor but allows him to continue. He helps the others search the area when the road is blocked by a row of shopping carts. They then come across the empty grave. He helps to clear the carts and they continue on their way. They arrive at the meeting point, where the Saviors await. Gavin reprimands Ezekiel for arriving late. Gavin interjects as Ezekiel begins explaining their delayed arrival. Jerry orders Gavin not to interrupt the King; Jared hits him over the head with Morgan's stick in response. He raises his gun when Gavin tells them to hand over their weapons. When the tribute surprisingly turns up short, Jerry watches helplessly as Jared prepares to execute Richard. Much to the surprise and shock of everyone, Jared instead shoots Benjamin in the thigh, severing his femoral artery. Jerry helps load Benjamin on to the truck and, because they won't make it to the Kingdom in time, they make haste to Carol's house. Jerry carries Benjamin into Carol's house and places him on the table. He is visibly upset when Benjamin dies from his injury. Jerry is present for the meeting with the Saviors the next day. He watches, frozen in confusion and horror, as Morgan strangles Richard to death. He and the others then leave at Morgan's request. Jerry appears with Ezekiel as he leads a regiment from the Kingdom toward Alexandria . Jerry and the rest of the Kingdom residents arrive just as Negan is about to execute Carl and begin to kill the Saviors. He works alongside Ezekiel throughout the battle. After the battle is over, Jerry is then present for Rick, Maggie and Ezekiel's speech to the communities, all united and ready for war. Jerry is also seen getting an apple from Aaron . Jerry is among the Militia to listen to the leaders' speeches before they launch their assault on the Sanctuary . He also tries to persuade Enid on applying some armor for additional protection, despite her politely declining his requests. After successfully ambushing the Saviors' headquarters, he and the others leave in their vehicles so the incoming horde may swarm the factory. Jerry is there when Ezekiel leads another group toward a third Savior outpost. They see a Savior guarding the front entrance and shoot at him. However, they all miss and the Savior ducks behind a car for cover. He then throws a smoke grenade at the group which explodes, creating a big cloud of smoke. Jerry appears with the Kingdommers when Ezekiel and Carol are fighting walkers in a cloud of smoke. Jerry kills them with his axe. He orders the others to \"protect the king\" but Ezekiel orders them to protect themselves. Carol is worried that their ambush will be ruined if the man they saw warns the outpost but Ezekiel insists they will catch him and execute their plan. Ezekiel gives orders, sending a man back to the Kingdom, and if there is trouble he is to unleash Shiva from her cage. They now march forward to the compound and to \"certain victory\". Jerry is among the Kingdommers to hunt down Nelson. After a while, he is eventually hunted down and mauled by Shiva. Jerry and the Kingdommers regroup in the woods, where they hear on the radio that the nearby Savior outpost is sending out an active patrol, indicating that they know the Kingdommers are coming. Despite the concern of his closest advisors, Ezekiel is unfazed, and confidently prepares for the upcoming attack. Jerry is among the Kingdommers to successfully ambush two groups of Saviors as they proceed in clearing out the different buildings that make up the outpost controlled by Gavin's men. After Ezekiel realizes there's a gun aiming for his group, he orders everyone to scatter, including Jerry. Jerry was one of the few members of the Kingdom who survived the machine gun barrage after the attack on the Savior outpost. He is first seen slicing Gunther with his axe , killing him and saving Ezekiel. Jerry, battered from the war, helps Ezekiel to his feet and props him against the fence. He puts down two former Kingdommers with Ezekiel's sword before returning it to him with a \"your Majesty\". Ezekiel, discouraged by Gunther's taunts and insults, denounces this, but Jerry insists that he continue bestowing that title on him. He takes his axe and begins swinging at the chain on the gate. Jerry continues to swing at the chain, but finds that it's not breaking. In a last attempt to breach it, he slips the axe's handle through the chain and tries to wrench it off, but breaks the axe head off in the process. The men find that the herd is closing in on them. With no time to break the gate open, both men decide to fight off the herd. Ezekiel and Jerry begin to fight back against the oncoming herd. Jerry takes a moment to thank Ezekiel for \"being such a cool dude\" before continuing the slaughter. The two men continue to fight the herd, but Ezekiel begins to fatigue. Carol appears and assists them, mowing down half of the herd with Joseph's rifle, as the two Saviors drive away with the machine guns. As Carol opens the gates, Ezekiel inquires about the heavy weapons. Carol responds that nothing can be done about them at the moment. Ezekiel is dismayed at this revelation and opts to warn Rick, but Carol, hearing a motorcycle and a truck in the distance, assures him that the guns won't make it to the compound. Jerry, Carol and Ezekiel fight their way through more walkers. Ezekiel begins to falter and begs the others to leave him, knowing he'll slow them down with his injury, but they refuse. They eventually reach a polluted creek bed, where more walkers are roaming. They manage to push through, but Ezekiel turns back, fighting off the approaching walkers and yelling for the others to leave him. Jerry refuses to leave, feeling it is his duty to protect his king, but Ezekiel rejects his title, iterating that he is just \"some guy\". Suddenly, Shiva jumps into the fray, mauling walkers and violently throwing several aside. As Ezekiel, Jerry and Carol watches helplessly, Shiva is set upon and ripped apart by the small herd, staining the waters red, but allowing more time for the three soldiers to escape. The three make it back to the Kingdom, battered, bruised and broken. The townspeople gather to find that Ezekiel, Carol and Jerry are the only survivors of the fight. Jerry is seen guarding the theatre where Ezekiel is hiding in. Carol marches past Jerry, but he tells her he's not taking any visitors. She bangs on the door and tells him they promised Rick they would meet up. Jerry tells her he won't come out and is no longer their king, but Jerry refuses to give up his job. Later, Carol approaches Jerry and orders him to the side. She takes aim with a shotgun, attempting to shoot the door, but Jerry tells her the doors are not locked. Jerry is first seen with Carol picking up Rick from an ambush, he is involved in a collision caused by the Saviors. He is captured and forced to his knees by Gary and Simon threatens to execute him. As Gary was about to kill him, Simon stops him and kills Neil instead. With that, Jerry's life is spared and he is returned safely. In the future, Carl envisioned for Rick, Jerry is tending the gardens with Siddiq in Alexandria . When Judith runs up to him, Jerry warmly greets Judith and embraces her. Jerry, along with Oscar , Scott , and Dianne , accompanies Maggie to the makeshift prison and listens on as Maggie declares the Saviors will be let out for a few minutes a day in pairs and under close watch of the guards. Jerry and Maggie discuss what the community is doing to protect themselves from the Saviors' imminent attack. He informs Maggie that there are lookouts stationed every half mile down the road, and they are instructed to honk their car horns if they see the Saviors incoming. The chain reaction alarms will hopefully give Hilltop enough notice to be ready for battle. Jerry is among the Hilltop residents and refugees who are prepared to defend the Hilltop from the Saviors. He is atop the wall with Eduardo , Wesley , Kal , and Tobin , among others, when the Saviors attack. He and the others open fire and are able to survive long enough until the Saviors are driven away. The next morning, he buries the dead the graveyard as Maggie and Kal pay their respects. Jerry also survives the outbreak sparked by the tainted weapons that leaves several people dead. The next morning when everyone realizes Henry is missing, he helps search the Hilltop grounds for him, but is unable to find him. Jerry is on guard with Kal at the Hilltop when they spot Carol and Henry returning. As Kal and the other guards distract the walkers outside, an excited Jerry rushes to tell Ezekiel the good news. Jerry is seen carrying and rocking Gracie . Jerry accompanies Rick and the rest of the Militia to fight the Saviors in the final battle. After most of the Saviors are wiped out due to Eugene 's faulty bullets, Jerry and the others fight the surviving Saviors until they surrender. He watches on as Negan is defeated and captured while Rick addresses the crowd, declaring peace among all communities. Afterwards, Jerry returns home to the Kingdom. Following the end of the war, Jerry and Nabila entered a relationship with each other. On the road, Jerry is patrolling as Daryl rides off to meet Rick and the others in downtown Washington D.C. When Rick and the group arrive at the Sanctuary to deliver supplies, Michonne points out graffiti that proclaims, \"We are still Negan\" . Jerry tells Daryl that he doesn't know who painted that. The next day, Carol kisses Ezekiel goodbye since she's staying at Sanctuary and instructs Jerry to take care of him as they head off. At the camp, Nabila kisses Jerry outside their tent as Rick passes by and watches them happily. Later, Jerry is radioed by Tara to turn on one of the sirens, in order to lure a herd away from the construction site. In the camp, at night, as everyone laughs and talks, Jerry plays a card game with Henry and Nabila. At the camp, the Saviors are furious with the news of Justin 's death. Alden promises they'll get to the bottom of it but is punched in the face by Jed , who claims he isn't one of them anymore. Carol steps in with her gun at her hip, stopping Jed. Jerry watches from the crowd as the Saviors start accusing Daryl and Anne of being the culprits. They grab axes to retaliate when Rick rides in the middle of the group with his gun drawn and warns everyone to back off. Later, Jerry is present as Rick implores his team to find Arat before the Saviors find out and leave, delaying the bridge construction. Jerry asks what kind off punishment will receive the responsible for the missing Saviors, causing Rick and Maggie to look at each other in thought. Jerry arrives at the camp to warn Rick about Maggie's march to Alexandria. Later, when Jed and several Saviors return to demand guns so they can enact their revenge on Oceanside, Jerry steps out of his tent with a gun in hand. However, after Carol attacks Jed, more Saviors show up and a shoot-out ensues. On the bridge, as Rick limps away before collapsing, he hallucinates as Jerry and the others rush past him to kill the walkers. Michonne stops and sees Rick's wound. She reminds him she fell in love with him because he's a fighter. After killing the walkers, everyone stops to watch them. Michonne tells Rick how much she loves him and he tells her, \"This isn't real.\" Michonne tells him to wake up and he does, now alone on the bridge. The walkers approach as Rick hobbles away. He makes it across the bridge and turns around hoping to see the walkers fall through, to no avail. A walker makes its way inches away from Rick before getting shot in the head by a crossbow bolt. Rick watches as Jerry and the rest arrive nearby. Maggie and Michonne hatch a plan to divert the walkers but Rick won't allow it. He notices the dynamite on the bridge, takes aim, and says to himself \"I found them,\" before shooting and igniting the dynamite. The bridge ignites and explodes as Jerry and the rest can only watch in horror, assuming Rick to be dead. Six years later, in the Kingdom, Jerry jokingly refers to Carol as his Queen. Suddenly, they hear a noise coming from the basement and find a teenager Henry trying to fix the pipes. Jerry then listens as Ezekiel arrives and Henry sasses him about their deteriorating community, but Ezekiel warns him to watch his tone. In a flashback, Jerry, Ezekiel, and Carol are in a clearing in the woods. Jerry tells Ezekiel and Carol that Nabila is pregnant, and a jubilant Ezekiel congratulates him. Suddenly, Jesus and Tara ride up to them. Tara tells them that she has left Alexandria and hands Ezekiel the community charter before leaving. He then promises Carol that someday the community leaders will all sign it together. In the present, Jerry spends time with Nabila and his children in the Kingdom as everyone is setting things ready for the fair. He then gears up to accompany Ezekiel on a deer hunting mission. Later, in the woods, Carol senses something’s up but Jerry decides not to lie to her, so Ezekiel explains he and his people planned a minor side mission to grab something for the fair. Carol agrees to tag along and they go to an abandoned movie theater. Outside the movie theater, Ezekiel reveals to Carol that he wants to get a projector bulb, but she's understandably upset they're risking so much for something so trivial. Ezekiel explains how important it could be for families and she relents. Jerry then uses a boombox to draw the walkers away from the theater. Inside, Jerry gingerly retrieves the bulbs as Dianne accompanies him. Suddenly, some walkers attack them, causing him to drop the bulb into the walker infested room. Jerry then tells Carol and Ezekiel about it. Ezekiel considers leaving, but Carol steps in and sets up a plan to retrieve it. They take out the walkers, grab the bulb and finally head out. At night, in the Kingdom, Ezekiel and Carol place the charter in the frame and kiss as Jerry turns on the projector. Later, Jerry holds his baby and cuddles her as Nabila sleeps in their bed. In the Kingdom, Jerry and his group arrive bruised and without armor from a supply mission. Inside the theater, Jerry tells Ezekiel that his patrol got jumped and robbed on the road by a group called \" The Highwaymen ,\" who gave them a note warning anyone traveling to the fair will be turned back unless they pay their toll. Dianne guesses it could be Jed's group of Saviors, but Carol politely rules that out. Ezekiel decides they should fight these marauders and instructs Jerry to gather all their fighters. Later, on the road, Jerry and Carol scope out the highwaymen community while Ezekiel laments the violence they have to resort to. Carol suggests they try talking to them first, and if that doesn't work they'll kill them. Ezekiel, Carol, and Jerry infiltrate the Highwaymen base, where, the leader, Ozzy , informs them that the meeting is for the King alone. They disagree, sticking by Ezekiel's side. Ozzy asks if they have his toll, while his people approach with their weapons drawn. He suggests they use Ezekiel as ransom when suddenly the Kingdom fighters grab Ozzy's people from behind. Ezekiel draws his sword and says he's prepared to fight for what they've created. He then offers the man a job to clear the roads for him in exchange to access the Kingdom and the fair. Ozzy laughs in his face and draws Jerry's sword, telling them they'll have to do better than that. Carol then asks when the last time they've seen a movie and a shocked Ozzy responds, \"Seriously?\" Back in the Kingdom, Jerry watches in suspicion as Ozzy walks around the fair, having accepted the deal. In the Kingdom, Jerry watches from the crowd as Ezekiel declares they've finally accomplished Rick, Carl, and Jesus' dreams of reuniting the communities. \"Let the fair of a new beginning begin!\" Ezekiel says as everyone celebrates and applauds. At the fair, Jerry plays with his kids and Judith. Later that day, he and Nabila walk around some booths and talk about Michonne's decision to let Alexandria come to the fair. At night, Jerry and his family alongside Judith attend the theater and watch the movie. The next day, Jerry listens from the crowd as Siddiq delivers the tragic news regarding the fate of the missing residents from the fair, tells them how brave everyone was in their final moments and how he was intentionally kept alive to tell this very story. He encourages everyone to remember the fallen as brave heroes and to honor them. Several months after the fair massacre, the Kingdom has fallen due to burst pipes, rot, and fires that have consumed multiple buildings across the community. Jerry and his family get ready and leave the place to move to the Hilltop. On the road, the group spots walkers in a field but keep moving undetected. After a while, he warns Ezekiel they better find shelter before the storm arrives. Later, as more snow starts falling, Michonne decides to take the group to the Sanctuary for shelter during the night. In the Sanctuary, Jerry helps his family rest and stay warm. After a while, the group gets ready and leave the Sanctuary. In the woods, the group passes the pikes into Alpha's territory. Michonne kills frozen walkers, unsure if they're Whisperers or not, before reaching the frozen lake. Daryl notices Lydia's missing again, so Carol leaves to find her and instructs him to get everyone across safely. Suddenly, walkers awaken from the snowbanks and the group kills them one by one before escaping across the ice. Jerry embraces his family, glad for their safety. In the morning, Jerry and the group finally arrive at Hilltop, where Daryl knocks off the head of a frozen walker. That night, he spends time with his family in their new community. Some months after the blizzard, Jerry and the Coalition form a militia in order to train the several residents of the communities to face any future treats. During the training exercise on the Oceanside beach, he and Ezekiel methodically release walkers from a shipwrecked boat as the militia works together as a unit to take out the walker threat. That night, Jerry and the others decide to cross Alpha's border to put out the fire and avoid it burning down Oceanside. They discover the remains of the satellite and start combating the fire. Some use water while others dig a means to prevent the fire from spreading until the morning arrives. However, Ezekiel starts coughing from the smoke and Jerry immediately tells him to rest while the rest handle the situation. Jerry is alerted to the commotion of a tree falling onto a house and a portion of Hilltop's walls. While the group helps the injured, Jerry notices Ezekiel is acting odd and asks if he needs help, despite his objections. He then continues to help the other residents rescue the trapped injured from the rubble. The next day, Jerry and the other residents kill the incoming walkers with the help of the Alexandria convoy when the herd invades the community that night. The following morning, Jerry helps load the supplies onto the cart for the parting group towards Oceanside and is reassured by Ezekiel that he is feeling better. Jerry is part of the group from Hilltop to meet up with Daryl, Carol, and Aaron in the woods to go find the horde following Gamma's intel. He greets his companions and hugs Carol after not having seen her for a while. That night, the group crosses one of the borders in the woods to continue their mission. The next day, the group arrives at the location of the horde in a clearing only to find it's empty, so they leave to go search for the missing Lydia. When Carol chases after Alpha into a dark building, Jerry and the others follow her inside. The group then falls below a cave into a trap where they find themselves surrounded by most of the horde. Having become trapped in the cave with the horde, Jerry and the group recover from the fall and realize Alpha is watching them from the top as they look around for a possible exit. He watches as Carol screams in anger and later as Magna tries to climb a wall in vain. The group starts seeking other avenues of escape and eventually they decide to jump from rock to rock onto the other side of the cave in order to find another exit. As the group moves through the cave, Jerry discusses with Aaron how much food they have left when Kelly tells them they don't have enough. He then assures her there has to be an exit since walkers managed to get inside. When Magna is ambushed by a Whisperer, the group engages in a fight and kills several Whisperers, before deciding to follow the ones who escaped to find the exit. They follow the path and squeeze through narrow tunnels where Jerry has a close call with walkers until they find an underground mine station where Kelly discovers a box of dynamite. When Carol accidentally drops a stick of dynamite in an effort to destroy the herd, the explosion causes the cave to begin collapsing. Jerry holds a beam to allow the others to escape. Magna and Connie stay back and kill several Whisperers to protect Jerry, but he cannot hold the log anymore and leaves through the hole. The rest of the dynamite immediately explodes and the cave implodes, trapping Magna and Connie inside. Jerry comforts a devastated Kelly as she falls to the ground in agony. He continues to console her and then listens as she states that the explosion will attract walkers and Whisperers in the vicinity and they should leave because they won't be able to help Connie and Magna if they die. Daryl then tells the group to head home and inform everyone they found the horde, while he'll find the other entrance to the cave. Jerry joins the discussion about what should be done with the Whisperers . Lydia thinks they should run, explaining that even if the explosion at the cave took out half the horde, Alpha would still have thousands of walkers left. Earl thinks the Whisperers might bypass them and go for Alexandria first, but Lydia negates this. Jerry wishes to stay and fight instead, while Dianne agrees with Lydia, believing that they can rebuild in another location. Earl is skeptical, however, and reckons that they will never find a place as good as Hilltop. While Yumiko points out they're heavily outnumbered, Earl insists that fighting is the best course of action, and even if they die, they will die for a place that means something. Aaron points out that there are children at Hilltop, too. Daryl agrees that they should get the kids out first, and instructs the others to pack up and regroup at Oceanside . As everyone is gathered on the front lines including Jerry, Kelly puts her palms on the ground and confirms that the horde is close. Indeed, the horde soon emerges from the bushes and approaches the Hilltop. While they are momentarily halted by the electric fence, the walkers soon break through it and approach the second line of defense. Aaron orders the survivors to split ranks. The shield-wielding survivors reinforce the makeshift barbed wire fence, while the melee weapon-wielding survivors start taking out the walkers. The archers, meanwhile, stay in the back and rain arrows on the herd. With no choice, the defenders begin to retreat towards the Hilltop, but are trapped when the Whisperers launch another volley of fire-arrows into the Hilltop's walls, setting the community ablaze. Jerry survives the fall of the Hilltop and escapes with Daryl, Rosita, Dianne, Nabila, and a few others as they make their way to the rendezvous where Ezekiel should be waiting for them with the kids. Once there, however, they discover the house to be empty, save for a lone walker. Nabila despairs about the whereabouts of her and Jerry's children, Jerry attempts to calm her down. Jerry and Daryl travel back to the ruins of Hilltop, and discover Ezekiel still alive under some debris. Ezekiel tells them that Earl has the kids and leads them to the shed where Jerry, Ezekiel, and Daryl approach the cabin, they are relieved to find all of the kids alive. Jerry meets up with the others at the rendezvous point. He and the other Hilltop survivors welcome Magna back. Jerry catches Ezekiel readying his horse, and tries to talk him out of it. Ezekiel asks if this is because he is sick, but Jerry replies that it's only because he will miss Ezekiel. Jerry, however, accepts that he can't stop a man from being foolish, to which Ezekiel replies \"Or a man willing to believe in future friends\". Jerry questions if this is Ezekiel's sole motivation, but the latter claims that it is enough for now. Ezekiel tells him that the Kingdom needs Jerry, and charges his former bodyguard with carrying on their legacy. Jerry accepts this, and nearly calls his former leader \"Boss\", but stops himself and calls him Ezekiel instead. The two hug each other goodbye. Jerry is among the Alexandrians to relocate to the abandoned hospital being referred to as \"the tower\". Jerry is with the group in the tower as they make a plan to escape Beta's horde. He, alongside Daryl, Carol, Magna, Kelly, Luke, Beatrice, and Jules, cover themselves in guts and slowly make their way through the horde. After successfully traversing the horde Jerry helps Daryl, Carol, Magna, Kelly, Luke, Jules, Negan, Lydia, Oscar, and Marco take out the last of the Whisperers. Afterwards, he makes it to the rendezvous point in the woods, where he reunites with his family and fellow survivors. Jerry is among the residents to continue clean-up efforts after the Whisperers caused destruction and mayhem all across town. He notices Carol returning to Alexandria without Daryl and checks in with her to ensure she is doing alright. After Carol offers to help with fixing the north guard post or cleaning out the fishery, Jerry informs her that Rosita and several others have those projects taken care of, as most of the projects are being taken care of by their fellow Alexandrians. Jerry and Carol share several brief interactions throughout the day as she helps prepare dinner and fixes a solar panel to restore electricity to her house. By the next morning, Jerry visits Carol at her home and they embrace in a hug as Jerry reveals he thought Carol may be struggling with everything that has happened and offers his support and friendship. Following the conclusion of the Whisperer War, Jerry is among the Hilltop refugees to move to Alexandria. Jerry is part of a group consisting of Daryl, Elijah, Maggie, Carol, Alden, Rosita, Lydia, Gage, Roy, Kelly, and Magna who raid the abandoned Fort Connors military base for food supplies. He remains on watch on the roof as the women make their way into a hangar by rope to collect supplies. When walkers attack the women, Jerry joins the other men in providing covering fire using a bow. After the mission, Jerry returns to Alexandria with his fellow survivors. Jerry looks out the window and sees a walker roaming inside Alexandria 's walls. He alerts everyone. Walkers stream into Alexandria through a breach in the wall, created by a fallen panel. Jerry and the crew hoists the panel back up as others slaughter the walkers. Walkers swarm the walls of Alexandria. Jerry, Aaron, Carol and Lydia decide to go to Hilltop to scavenge for blacksmith tools they can use to reinforce the walls. Aaron's group arrives at Hilltop and finds it overrun with walkers. They recognize the walkers as former Hilltoppers. Jerry and Aaron become emotional as they kill the walkers. Jerry and the group scavenges for supplies at Hilltop. They notice walkers moving in a herding pattern and realize one of them is a Whisperer. Aaron spots the Whisperer and shoves him to the ground, then yanks off his mask. Lydia recognizes the Whisperer and tells Aaron not to kill him. Aaron interrogates the Whisperer, whose name is Keith . Keith insists that he's the only Whisperer left at Hilltop. Lydia defends Keith, but Aaron doesn't believe him. Jerry and Aaron drag Keith to the root cellar and find other Whisperers hiding. Keith insists they are the last ones. Jerry spots Nabila's scarf and realizes these Whisperers helped burned down Alexandria. Keith grabs a knife and slashes Aaron, allowing the other Whisperers to escape. Jerry and Aaron suspend Keith from the rafters of a stable and demand to know how many more Whisperers there are. Lydia refuses to watch and leaves. Aaron pushes a walker on Keith's hand then offers to amputate it and prevent infection if Keith tells them where his people are. Carol kills the walker and warns Aaron against the dangers of becoming consumed with rage. Aaron spares the Whisperer, who amputates his arm and reveals to the four that Connie is still alive. Aaron suggests they search for her first thing in the morning. They leave Hilltop. Jerry and Aaron burst through the church doors to escape the storm. Jerry suggests that it might be time to give up on the windmill after Aaron tells him that the wind keeps stoking the flames, Aaron refuses to give up and tells him they just need to find another way. Aaron notices Carol, Connie, Magna, and Kelly running past and calls them over. The group decides on a plan to fight the fire and fix the wall breach simultaneously, and goes to split up before Aaron hears a whistle and is stopped in his tracks. He recognizes it as the sound of Gracie's emergency whistle and begins to race towards it, calling back to the group to save the windmill or they lose Alexandria. The next day, Jerry goes over and greets the group returning from Meridian with a cart full of food. Jerry is chagrined to see their numbers greatly diminished. Suddenly, Jerry yells to the group about an approaching group. Jerry is seen listening to Lance Hornsby address the residents of Alexandria, and offer the Commonwealth 's help in rebuilding Alexandria, and \"another, potentially more interesting choice\" for any who are interested in it. Jerry is one of the residents to leave Alexandria and join the Commonwealth. Jerry is spending time with his family. As Jerry asks a reluctant Ezra to give Ezekiel Shiva's collar back, which he saved from Hilltop and Ezekiel let Ezra use for his tiger costume, Ezekiel lets him keep it under two conditions: that he honor Shiva's memory with it, and that it always brings him joy. Jerry accompanies Ezekiel when he undergoes what he believes to be a routine checkup. Ezekiel is surprised to learn his surgery has been moved to the top of the list. Jerry is pleased by it and tells Ezekiel that he deserves some luck. Ezekiel is later wheeled into surgery with Jerry and Carol promising him that they will be waiting for him when he comes out. Jerry notices Negan as he takes in seeing the Commonwealth for the first time. Jerry asks Negan what he's doing there. Negan states he is there to save them and asks about Carol's whereabouts. Jerry leads him to her apartment. Jerry and Negan enter Carol's apartment. Negan makes a joke about how he probably should've stayed in the cabin . Negan tells Carol the situation with Lance and try to devise a plan. Carol tells Jerry to look out for the kids while she and Negan go do something. Negan asks what the plan is seeing as they can't just walk out, and Carol tells him that they are going to get some insurance. Jerry and the kids walk amongst the crowd when suddenly Roman and Shira appear behind them and spot them. Jerry asks some fellow Alexandrians and Hilltoppers to help them out and they get in Roman and Shira's way to buy them time. Jerry and the kids climb up a ladder to a balcony before raising it so their followers won't know where they went. Just then, Roman approaches and finds no sign of Jerry or the kids. As he begins to leave, Jerry accidentally knocks some hay onto him. Roman looks up the balcony but narrowly doesn't see them. He walks away to go look elsewhere. A window opens from above and a civilians looks down upon Jerry and the kids. Jerry asks for a small favor and the citizen nods in approval. Jerry, along with Aaron, Lydia and Elijah decide to head to Oceanside to fill in Rachel and Cyndie on the plan. Jerry, Aaron , Lydia and Elijah are still making their way to Oceanside . Aaron looks back and smiles as he sees Lydia and Elijah flirting with each other. Up ahead, they see a large herd of walkers coming down the road towards them. Jerry suggests they wait it out but Aaron says they'll find a way around. Jerry believes that off-roading with the wagon is dangerous and they should relax since it's a nice day and he can treat them all to his \"famous fettuccine con cannellini beans a la Jerry\". Aaron says they have to keep moving since they don't have time to spare. As the group off-roads, a walker turns its head in an unusual fashion, as if watching them. Later, Aaron's group's wagon gets stuck in a divot in the woods, and they try to push it out. They finally do, but it hits Jerry in the leg, injuring him. Aaron spots a nearby site, an abandoned renaissance fair park, and suggests they take a rest inside. They arrive, and begin setting up for the night. Lydia brings Elijah some wood to make a fire and kneels down to help. Elijah and Lydia start staring lovingly at each other and Elijah goes in for a kiss. However, Lydia backs away at the last second, causing an awkward silence. She then tells him he's going to get more kindle and leaves. Jerry tries to converse with Aaron, who is lost in thought while trying to sharpen a stick, saying that the place is quite habitable and potentially could become the Kingdom 2.0. Aaron doesn't answer back and throws away his stick in frustration when it breaks. Aaron asks what Jerry said, but he tells him it's nothing. At night, Lydia and Aaron are on watch, stoking a fire. Lydia grows concerned when she hears wood and hinges creaking in the distance, but Aaron assures her they triple-checked and locked everything, and that its most likely just the wind. Just then, they hear the sound of a gate opening. Lydia insists wind could not have done that, and Aaron agrees that they should do another sweep. A small herd of walkers begin pouring into the fairgrounds, and Aaron and Lydia get ready to fight them. They manage to take out a couple each, but when Lydia stabs her staff into the chest of one of the walkers, it grabs her onto her weapon and begins pulling her towards it. Lydia manages to stab it in the shoulder, stunning it, and she and Aaron retreat to get Jerry and Elijah. The group briefly hold the walkers at bay, killing several more, but are forced inside one of the buildings as the undead continue swarming them. Aaron estimates the herd is at least fifty strong, and Elijah wonders aloud how they managed to get inside. The knob on a door to their left begins turning, and Jerry presses himself against it, holding it shut. Jerry asks when the dead began opening doors, and Aaron surmises it to be the work of the Whisperers . Aaron sends Elijah and Lydia through a hole in the roof, and switches with Jerry in holding the door shut so that he can get out, as well. Lydia and Elijah help Jerry up, sitting him against a box, as Aaron joins them. Elijah spots an opening in the herd, and Lydia suggests they make the short jump. Aaron lets them head down so that they can flank the herd. While Jerry remains in place, the same walker that grabbed Lydia's weapon begins climbing onto the roof behind them. After it manages to pull itself up, Jerry calls out to Aaron as it grabs a nearby rock and readies to strike Jerry with it. Aaron intervenes, tackling the walker and punching it. \"Goddamn Whisperers!\" he grunts as he grabs onto the walker's face, ready to pull it off as a mask. Instead, Aaron pulls off the entire face, revealing its facial muscles and skull as it continues growling at him. It's not a Whisperer, but a walker. Aaron grabs Lydia's knife from its shoulder and stabs it through the forehead, killing it. He and Jerry stare in alarm at the remains of the anomalous being, as Jerry worriedly asks \"how the hell did a walker do that?\" The next morning, having successfully cleared out the rest of the herd, Aaron and Jerry talk about what they witnessed last night as Lydia and Elijah ready themselves to leave. Aaron theorizes that the walkers are evolving into new variants, such as the ones which return to places that were important to them in their past lives. However, he always thought stories he had heard about some of the undead being able to climb and open doors were nothing more than hearsay. He wonders if there are other variations of more dangerous, more intelligent walkers out there. As they head out, Lydia kisses Elijah, having taken Aaron's advice from yesterday to heart. As they depart from the fairgrounds on the wagon, Aaron voices his supports Jerry's idea of one day turning the location into a second Kingdom, with King Jerry and Queen Nabila in charge of it. In the woods, Lydia puts down a walker with her knife against the objections of Elijah who is worried that it could've been one of the climber variants. Although Jerry makes a joke about it, Aaron warns the others that they all need to stay alert as they don't know if their encounter with a climber was a one-time thing or not and there might be more of them out here. Aaron notices footsteps nearby, but Lydia recognizes them as being human, not walker. Aaron's group readies themselves to defend against possible threats, but Luke and Jules emerge from the trees instead. The friends are happily reunited with each other while Aaron introduces Luke and Jules to Elijah whom they have yet to meet. Jerry invites the two to join them in journeying to Oceanside , but Luke explains that \"it's gone, man. It ain't ours anymore. These guys in white gear showed up and... said they were from the Commonwealth\" with Jules adding that they had just taken over. Aaron is surprised as they had made a deal with the Commonwealth, but Luke tells him that something must've changed as the Commonwealth Army is tracking him and Jules right now and they're dead if they're found. Luke suggests getting far away from Oceanside as humanly possible which Aaron agrees with. Shocked by the news, everyone begins moving out. Aaron's group puts down several walkers and Luke and Jules explain that they were out scavenging and thus they weren't present when Lance Hornsby 's men arrived at Oceanside. They were hiding behind the houses trying to figure out what the hell to do with Luke wanting to stay and fight. However, Rachel wasn't having it and she insisted that they had to go, warn everybody and tell them what was coming which is why Luke and Jules had left in the end. Luke and Jules haven't seen Rachel or any of the others since and Luke feels guilty that they didn't stay and fight. Jerry and Aaron reassure them that they've got the group and everyone else now who are heading for Alexandria right now. Luke asks if that includes his old group which Aaron confirms. Hearing the sound of engines nearby, everyone quickly hides behind the wagon. Lydia and Elijah realize that the soldiers are closing in and that they can't outrun them. Spotting a herd moving nearby, Lydia looks at one of the dead walkers and gets an idea. That night, Aaron's group, covered in walker guts , moves with the massive herd, Lydia whispering directions to the others to move east. Two Commonwealth jeeps drive up and begins leading the herd in another direction, forcing Aaron, Lydia, Elijah, Jerry, Luke and Jules to follow them in order to maintain their cover. Lydia is bumped into by a walker, causing her to drop her knife which is then picked up by a variant walker that's amongst the herd. In the woods, a Commonwealth jeep leads a large herd , amongst them Aaron , Lydia , Elijah , Jerry, Luke and Jules , covered in walker guts . Spotting a break ahead to the right, Aaron whispers the message that it's now their chance with the others planning to make a break for the trees. However, as the group begins to make their break for it, a soldier pulls up on a motorcycle, leading a second herd in from the side that joins up with the massive herd that the jeep is leading, trapping Aaron's group amongst the walkers once more. From the other side, a third herd is brought in by another motorcycle, resulting in a massive herd of thousands of walkers having been corralled together by two Commonwealth jeeps and two motorcycles. Having completed their mission, the soldiers drive off, leaving the herd heading towards the Commonwealth itself which is just miles away. As they continue, Aaron spots an abandoned RV up ahead and directs the others towards it. Putting down a walker in the RV, Aaron, Jerry and Lydia manage to get inside, but Jules gets swept away by the herd and Luke goes after his girlfriend. Trying to enter the RV, Elijah gets caught in the herd and as Lydia desperately tries to hang on to her boyfriend's hand, she is bitten in the left arm by a walker before Aaron and Jerry pull her into the RV as Elijah gets swept away as well. As the herd continues on towards the Commonwealth, a number of walkers begin banging on the RV's door, trying to get at the survivors within. In the RV, Lydia frantically tries to go back out into the herd to search for Elijah, unwilling to risk losing him, while Aaron and Jerry try to stop her in order to deal with her bite. Aaron finally manages to get Lydia to see reason by pointing out that if they don't act quickly, Elijah will lose her instead. Jerry promises that they will find him as soon as they can, but they have to amputate her arm first. Lydia takes a seat and Jerry makes a torniquet for her out of his belt. Aaron reminds Lydia that he lost his arm too and he made it alright and reassures Lydia that she is so loved. Aaron promises Lydia that they will get her through this before Jerry chops her arm off with his sword. Lydia regains consciousness in the RV as walkers bang on the outside from all sides. Despite being weak from blood loss, Lydia insists that they have to go after the others who need their help. Aaron states that Lydia needs a doctor first while Jerry tries to reassure her that Elijah, Luke and Jules are all pros. Lydia tearfully refuses to abandon their friends, stating that they don't leave each other and the others need them. Aaron and Jerry embrace the sobbing girl and Jerry decides to go back into the herd by himself to find the others, stating that Lydia has lost enough. Ordering Aaron and Lydia to get her arm looked at, Jerry promises that they will meet up later, \"I find them... I find you. Piece of cobbler. See you on the other side.\" Zipping up his jacket and pulling up his hood, Jerry opens the door and carefully slips back into the herd which continues to ignore him due to the walker guts covering Jerry. However, while Luke and Jules emerge from the herd in the Commonwealth, there remains no sign of Jerry and Elijah. As Gabriel opens the gate of the Estates for the trapped residents, the crowd rushes in just in the nick of time, amongst them Jerry and Elijah, before the gates are closed, keeping out the herd. Elijah reunites with a relieved Lydia while Jerry desperately looks for his family before Ezekiel reassures his friend that they're safe back in Alexandria and that they will get back out there to help the people that still need their help. Approaching the gates, Pamela notices a zombified Lance Hornsby , Carol's arrow still in his neck, at the front of the herd, reaching through the gates. Pamela approaches Lance, baring her neck and intending to have Lance bite her as a form of suicide . Judith begs Pamela not to go through with it as it's never too late and they have to help everyone still out there. Before Lance can bite Pamela, Maggie shoots him in the head with her sniper rifle, putting Lance down. Maggie states that it's time to take the Commonwealth back. With the variants being too dangerous to just lead away, Mercer outlines a new plan as everyone rushes to carry out his orders. As they need to get a vehicle out of the Estates, a mixture of Coalition forces, Commonwealth soldiers and Commonwealth residents, led by Aaron, rush out of the Estates, armed with melee weapons and riot shields with the aim of drawing the herd away and clearing a path, although Mercer warns them not to engage the walkers more than absolutely necessary. Working together, the group holds the line against the herd while Mercer calls in that the vehicle is out of the back gate and on its way to the town square, asking them to let him know when they're clear. Magna reports that they've diverted the walkers and its clear as it's going to get, ordering them to move out. As the combined group continues to fight the walkers, the truck by through the cleared path to the fuel depot where Vickers, Ezekiel, Jerry, Dianne and several Commonwealth soldiers collect the fuel. Max reports in that they've got fuses running to the private sewers under the Estates and they'll finish wiring the rest once they get the fuel back while Princess goes to start the PA system to draw all of the walkers to the Estates. Using Pamela's record player, the song \"Cult of Personality\" is blasted throughout the Commonwealth from the Estates, drawing all of the walkers overrunning the Commonwealth towards it. Elijah helps set up speakers throughout the Estates as Jerry, Ezekiel and Lydia pour fuel down into the sewers and the walkers fighting the forces outside of the Estates begin moving towards it as well. Mercer brings out some dynamite which Eugene and Yumiko help to wire up to drums of fuel placed throughout the Estates and Connie helps to wire up more speakers, unharmed by the loud music due to her deafness. As Max helps to coordinate the efforts, Mercer calls in that they're prepared to open the gates and to let him know when they're ready. Max calls in that they're good to go before she joins the others in retreating to the rendezvous point, the two women acknowledging that they're dead if this plan fails. The gates are opened and the herd floods into the Estates. Once the song ends, the fuses connected to explosives inside of Pamela's house are ignited, detonating the fuel in a chain reaction that obliterates the Estates and the entire herd, saving the Commonwealth. Jerry later attends a celebration in Alexandria which is joined by Max , Mercer and Tomi . A year later, Jerry and Nabila walk together through a rebuilt Alexandria as their daughters play outside during Daryl, Carol, Lydia, Elijah, Judith and R.J.'s visit.",
        "Killed Victims[]": "This list shows the victims Jerry has killed: Gunther Lance (Alongside his fellow Militia members) Norris (Alive, alongside Carol , Beatrice , and Kathy ) At least 25 unnamed Saviors (20 alongside his fellow Kingdomers, at least 5 Zombified) At least 3 unnamed Kingdom soldiers (Zombified) At least 13 unnamed Whisperers (12 alongside Daryl , Carol , Lydia , Magna , Luke , Kelly , Marco , and Jules ) Many unnamed U.S. Military soldiers (Zombified) At least 1 unnamed Coalition soldier (Zombified) Several elk Numerous counts of zombies",
        "Relationships[]": "For a more in-depth look at Jerry's relationships, read here: Jerry (TV Series)/Relationships",
        "Appearances[]": "",
        "Gallery[]": "For more images of Jerry, please visit Jerry (TV Series)/Gallery .",
        "Trivia[]": "The casting call for this character used the name Lester . [2] Jerry was credited in \" Stradivarius \" and \" Evolution \" but did not appear in either episode. Jerry's signature weapon was a two-handed battle axe until he broke it during the war against the Saviors . His current weapon is a short medieval sword. Jerry is one of eight characters introduced in Season 7 that are confirmed to be alive, the others being Ezekiel Sutton , Dianne , Nabila , Theresa , Douglas , Rachel Ward , and Cyndie . Jerry and Ezekiel are the only main characters introduced in Season 7 that are confirmed to be alive. Jerry revealed in \" Squeeze \" that he is 6'2. He also stated that he has been on a plane at least once before the apocalypse and that he had trouble using their bathrooms. In \" Find Me \", Carol mentions that Jerry has taken up a leadership role in the effort to rebuild Alexandria following the Whisperers' rampage through town. Oceanside and the Sanctuary are the only two major communities connected to the Militia and the Coalition that Jerry has never resided in. Jerry has lived in the Kingdom, the Hilltop, Alexandria and the Commonwealth. Jerry is one of four main characters to be go from being billed as a co-star to being part of the opening credits, the others being Carol , Enid , and Kelly . Although Jerry discussed turning Ye Old Renaissance Faire into Kingdom 2.0 in \" Variant \", he seemingly abandoned the idea as Jerry is still living in Alexandria a year later. However, the rebuilt Alexandria aesthetically resembles the Renaissance Faire, indicating Jerry had a hand in redesigning it.",
        "References[]": ""
    }
]