[
    {
        "Jesse": "",
        "Fate": "",
        "Contents": "",
        "Overview[]": "Jesse is a helpful and jovial young man. According to Aaron , he is training to become a recruiter for the Commonwealth . On the mission to Riverbend , he is shown to be enthusiastic to help. However, he becomes quite scared when they enter the building. He becomes more shocked when he realizes Toby 's true motives that he was assigned by Lance to wipe out the complex, instead of recruiting them, believing they are responsible for an attack on a Commonwealth caravan. Due to this, he attempts to flee instead of going through with Toby's plans, getting shot under Toby's orders, but manages to get away. In his last moments, he arrives at Hilltop and manages to warn the group about the Commonwealth.",
        "Pre-Apocalypse[]": "Nothing is known about Jesse's life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "At some point during the outbreak, Jesse joined a community in Ohio. Jesse joins with Toby , Aaron and Gabriel to take point on an outreach mission with a community in an apartment complex to offer them membership with the Commonwealth. The group's leader, Ian , meets with Aaron, Gabriel, Carlson, and Jesse and believes them to be enemies. Though Aaron and Gabriel talk Ian into letting them leave with their lives, Toby attacks and kills him and many of his people. Realizing his true intentions, Jesse attempts to flee on horseback. Toby orders a trooper to kill him, firing a shot at Jesse's back. Aaron cuts the soldier down with a swing of his mace arm , as Jesse escapes. Prior to getting shot, Jesse flees the complex to unhitch his horse. He is encountered by Negan when he emerges from the woods with a comrade named Annie and realizes Aaron and Gabriel are at the complex. Negan gives Jesse a map to Hilltop and asks him to tell Maggie that Gabriel and Aaron are in trouble. Eventually, Jesse approaches Hilltop on horseback, then falls off his horse. He gives Lydia a map and says that a slaughter is taking place before dying. His message ultimately leads Maggie, Elijah and Lydia to Riverbend to help their friends and the surviving residents.",
        "Death[]": "Killed By Lance Hornsby (Indirectly Caused) Toby Carlson (Caused) An unnamed Commonwealth soldier (Alive) On Toby's orders, Jesse was shot in the back by a Commonwealth soldier and later died of blood loss outside of the Hilltop. Lydia , Elijah or Marco (Before Reanimation) After his death, Lydia, Elijah or Marco prevent Jesse from reanimating.",
        "Killed Victims[]": "This list shows the victims Jesse has killed: Possibly numerous counts of zombies",
        "Relationships[]": "",
        "Appearances[]": "\" Warlords \"",
        "Trivia[]": "Jesse is the first resident of the Commonwealth to die on-screen. In \" A New Deal \", Annie lists Jesse amongst the people that the Commonwealth killed whose death haunts her alongside the Riverbend residents."
    }
]