[
    {
        "Jim": "",
        "Fate": "",
        "Contents": "",
        "Overview": "Jim is shown to be a helpful and caring man. However, he does have moments of impulsiveness and delusion. At one point, he digs a bunch of holes because of a dream he can't remember. When confronted by the other survivors about this, he tells them to go away and becomes hostile. He is tied to a tree and apologizes for his behavior. Later it's revealed that he dug the holes as graves, his dream seemingly being a vision of the future. Jim reveals that the only reason he made it out of the city was because walkers were too busy devouring his family, something he feels guilty about. After the walker attack, Jim is revealed to be bitten causing a debate in the group deciding what to do with him. They decide to go to the CDC, but Jim's condition worsens and he volunteers to be left behind. He faces death with dignity, cracking a joke about being put next to another tree. He refuses to take Rick 's gun to put himself out of his misery and is left to reanimate so he can go find his family.",
        "Pre-Apocalypse": "Nothing is known about Jim's life prior to or as the outbreak began, except he lived in the city with his family and he was an auto mechanic specialized in vehicle repair.",
        "Post-Apocalypse": "During the onset of the outbreak, Jim and his family were attacked by walkers , with Jim narrowly escaping while his family was devoured. Sometime later, he encountered and joined a campsite of survivors outside the outskirts of the city. In the camp, Jim helps Dale work on his RV 's radiator hose. Suddenly, the radio crackles and squeaks, and T-Dog 's garbled transmission comes through, explaining that they're trapped in the department store, surrounded by hundreds of walkers. Jim then watches in silent as Amy and Shane argue about rescuing their fellow companions. When Glenn arrives back to the camp with his red sports car, alarm blazing, Jim quickly deactivates the loud noise by pulling a wire under the hood. When Carl and Sophia find a walker, he and the other men rush to kill it. When asked why was a walker so far away from the city and out in the woods, he stated that it was probably because food was running out in the city. Later, when Rick and some others are going back to Atlanta to retrieve Merle Dixon and some guns, Jim and Dale negotiate a deal with Rick, they'll lend the bolt cutters they need for their lost tools and car parts from Rick's van. Due to a dream he cannot remember or understand, Jim starts digging holes on the hillside. Dale approaches Jim with a canteen of water, offering him a drink since the outdoor temperature is over a hundred degrees. He also asks Jim why he is digging the holes, to which Jim does not reply. Concerned, Dale approaches the other survivors saying they may have a problem referring to Jim's behavior. Jim is approached a second time, by Dale and the others. Dale and Shane try to talk to Jim, asking him to take a break. Jim tries to have everyone go away, stating that he's not bothering or hurting anyone so they should leave him alone. As Shane approaches Jim, Jim becomes hostile and is restrained. Jim is tied up to a tree for a few hours and he calms down as Shane explains his reasoning for tying him up. Jim apologizes to Carol Peletier 's and Lori Grimes ' chil dren who are doing school work nearby with their mothers for scaring them. When asked why he was digging, he replies that he honestly does not remember. Later that night, Jim is present for the conversation about Dale's watch during the fish feast, zombies attack the camp, triggering Jim to help defend the remaining survivors. During the zombies' attack, Jim is bitten by one on the stomach. He also kills the zombie that bit Amy with a baseball bat. Once the zombies are dispatched, Jim says that he remembers, that the holes he dug were a part of his dream, hinting that they are the graves for the fallen. As Jim helps in the clean-up of zombie corpses the morning after the attack, Jacqui notices blood on his shirt, and demands he lifts up his shirt, but he rejects so she alerts the remaining survivors. T-Dog restrains him, and Daryl lifts his shirt to reveal the bite wound he suffered during the attack on the camp. There is controversy over Jim as the survivors discuss what to do. Daryl wants to kill him immediately, but is stopped by Rick. Jim is taken with the rest of the survivors in the RV as the women care for him as he throws up and burns from a fever. While on the road, he claims his sickness is worsening and asks that he be left behind, for the sake of the survivors. He is reluctantly left by a tree after being carried out of the RV, refuses to take a handgun from Rick in order to spare himself/his body the \"life\" of becoming a walker, and is bid a final farewell by each of the survivors as they leave. His fate is left unknown, but presumably he died due to the fever, reanimated, and is now a walker, though it's possible he may have been killed again in the years that have passed by since his reanimation. Rick begins receiving phone calls from individuals who he believes are part of another group. A man calls Rick and tells him that he and others are in a safe place where no one has turned or gone insane. When Rick begs him to take in his group, the man questions if Rick is dangerous and asks if he has ever killed anyone. He asks how Rick's wife died, noting that he mentioned he had a son and baby. When Rick declines to answer, the man hangs up. Rick later receives a phone call from Lori, who informs him that the people he had spoken to all day were Amy, Jim, and Jacqui, revealing that all the calls did not actually take place in the real world, but were merely hallucinations in Rick's mind.",
        "Death": "Killed By Zombies (Alive) During the walker attack in the Atlanta camp, Jim is bitten by a walker on his ribs. Following the attack, as the remaining survivors clean up the camp, they discover Jim's bite mark. After attempting to get Jim to the CDC , Jim has enough of the strenuous journey and asks to be left behind. The group grants his request and leave him behind. Jim then dies from the infection, reanimates, and turns into a walker.",
        "Killed Victims": "This list shows the victims Jim has killed: Numerous counts of zombies",
        "Relationships": "For a more in-depth look at Jim's relationship, read here: Jim (TV Series)/Relationships",
        "Appearances": "",
        "Trivia": "According to Glenn in \" Four Walls and a Roof \", Jim lived for nearly two days following his bite. Not counting people who have amputated their limbs and survived, this made him the longest survivor of after being bitten. Before Alicia Clark , who still got sick from the infection despite amputating her arm off, he was by proxy the person who survived the longest amount of time with the infection that came with it. Jim is the only original group member to still have an undead status. He is also one of nine survivors classified as being undead, the other eight being Callaway , Pete Dolgen , Winslow , Eric , Matias , Lucille , Clara , and her husband Eddie . While Duane Jones was also classified as undead at the end of the TV Series, he was finally put down in the episode \" King County \" of Fear the Walking Dead ."
    }
]