[
    {
        "Jimmy": "Jimmy",
        "Overview[]": "While having limited on-screen interactions, Jimmy is shown to be a helpful, kind, and caring individual that has been shown or implied to be on positive terms with almost everyone on the Greene Family Farm and with the Atlanta camp survivors . He has also been shown or viewed to be immature to some extent, notably by Hershel and Lori . One such example being the way he was holding his gun like a gangster during target practice, presumably from listening to rap music. This trait was likely how he got along with Carl the way he did.",
        "Pre-Apocalypse[]": "Jimmy was born in 1993. Before the outbreak, Jimmy and Beth attended school together. They eventually began a casual relationship and dated for three months. Whenever Jimmy and Beth were around each other, Hershel would always keep an eye on them, particularly due to their immaturity as young people and his fear of their sexual activity.",
        "Post-Apocalypse[]": "After the apocalypse unfolded, Jimmy was taken in by the Greene family to live on the farm and treated as one of Hershel's own children. When Maggie witnesses a man running toward their property, she calls everyone out to the porch. Jimmy comes outside holding a baseball bat. When Rick explains that his son Carl had been shot by Otis, Jimmy holds Beth's hand and approaches him. He and his girlfriend Beth watch as Hershel attempt to save Carl's life. Later, he can be seen with Beth while Otis goes to his wife. Jimmy is first seen gathering rocks for Otis ' funeral, and then attending it. He is present when the rest of Rick's group return to the farm. He, along with the others, placed a rock on the grave in appreciation for what Otis had done for his entire life and what he did right before his death (according to Shane ). When Jimmy finds out the men were heading out again into the woods to continue their search for Sophia , he wishes to join the group and assist in looking for her, claiming that he knows the surrounding area pretty well. Rick asks Jimmy if Hershel was alright with the idea, to which he replied, \"yes\" (however, later it turns out he never asked). Daryl starts talking about the time he was squirrel hunting and saw a chupacabra, and Jimmy laughs and finds it funny why Daryl would believe such a thing. He then attempted to pick up a rifle on the hood of a car, but Rick stopped him and asked if he had any practice using a gun before. Jimmy insisted that if he went out on runs he would want a gun. Jimmy starts to walk off but Shane suggests he can teach him how to use a gun properly. Andrea suggests that he can accompany her and T-Dog to look for Sophia in the meantime. Later, he runs out of the farmhouse with the others when the group hears gunfire (Andrea shooting Daryl). Afterward, Jimmy joins the group for dinner and sits at the small table with Beth, Maggie, and Glenn . Jimmy is with Rick and Shane talking about locations that they could look for Sophia. Rick asks Jimmy about a certain location and Jimmy explains that it was a housing development that Shane and Andrea would later visit. He thanks Glenn when he comes by to give them apples. Beth and Patricia then walk up, wanting to take part in gun training. Jimmy stands there quietly as the two girls talk to Rick and Shane walks off to have a conversation with Carl. Jimmy and the others then all go to the shooting range, He drives Otis's truck accompanied by Beth and Patricia . While there, Jimmy slowly becomes a better shot. Jimmy at the range holds the gun on the side and tries to shoot like a gangster, but T-Dog tells him to stop, and Jimmy holds his gun normally, fires it and knocks down one of the bottled targets. Jimmy notices in the creek that two walkers, Louise Bush and Doug , are trapped in the mud. He alerts Hershel and himself, Hershel, and Rick go out to the creek to capture them. Hershel shows Rick how to free the walkers from the mud, and Jimmy and Rick try freeing Doug. During the struggle to free Doug, Jimmy tells Rick that Otis told him that if you get them half way out they'll do the rest of the work. Both Jimmy and Rick after freeing Doug trip over themselves and fall into the mud. Jimmy is nearly bitten by Doug but he quickly gets up to spot for Hershel and Rick. After leading them back to the barn, Shane starts to lose his temper, and he lets out all the walkers from the barn. Soon the group begins to kill all of the walkers in the barn. Jimmy watches in disappointment as all his zombified friends and neighbors are shot, and when Beth starts to cry, he embraces her. Jimmy is seen with Beth after the barn shooting and holds her as she cried. When Hershel, Maggie, Beth, and Patricia walk back to the house, Jimmy remains at the barn and helps the others dig graves for Sophia , Annette , and Shawn . He is later seen alongside everyone at their funeral. Later, he is seen checking up on Beth with Maggie, Patricia, and Andrea after she went into a coma, and gives Andrea a worried look. Jimmy is seen in Hershel's house, preparing dinner and handing out silverware, before noticing that Lori was missing, and is later seen when Hershel, Rick, and Glenn arrive back at the farm. He shows interested in the prisoner Rick brought back with him, but Patricia got him to go back inside. He was later present when the group was deciding what to do with the boy. Jimmy is seen in the background with Patricia tending to the cattle along with Hershel. When the group was discussing the fate of Randall, he was not present as he was watching Carl at that time. He was also not present after Dale had his stomach ripped open by a walker, and was most likely watching over Beth. Jimmy is briefly seen attending Dale's funeral and later boarding up the windows of Hershel's home and helping the Atlanta group move things in to the farmhouse. At the end of the episode, he is seen investigating the barn after Randall was set free by Shane, and ran back to the farmhouse with the others for safety. Jimmy is seen waiting in the farmhouse for Rick and Shane to get back. When the group notices walkers coming toward the farmhouse, Jimmy took a gun and goes inside Dale's RV and begins shooting many walkers. Later, Daryl drives up on his motorcycle and alerted him to Rick and Carl being in the barn. He parked the RV alongside the barn so they could jump on. After they jump on the top of the RV, zombies force their way into the RV and devour him. His body along with the RV is engulfed in flames, stopping him from reanimating. In a hallucination, Rick walks through a floor full of the corpses of his friends and loved ones, among them Jimmy.",
        "Death[]": "Killed By Carl Grimes (Indirectly Caused) Zombies A large herd is drawn towards the farm after Carl shoots his gun to put down Shane. Jimmy drives Dale's RV to the barn so Rick and Carl could jump from the roof and escape. After they proceed to do so, Jimmy attempts to leave the RV but the walkers manage to enter and pull him to the floor. He is then ripped apart and devoured as the walkers swarm the RV. Later, his body along with the walkers devouring him was incinerated after the RV was completely engulfed in flames.",
        "Killed Victims[]": "This list shows the victims Jimmy has killed: A few zombies",
        "Appearances[]": "",
        "Trivia[]": "In the episode \" Judge, Jury, Executioner \", Dale was supposed to find Jimmy devoured by the Swamp Walker in the field, but it was replaced with the cow. [1] According to Glen Mazzara , actor James Allen McCune was terrified while filming his death scene, as his greatest fear is being eaten alive. Jimmy appears in the final flashbacks of the last episode \" Rest in Peace \".",
        "References[]": "",
        "Name": "Jimmy"
    }
]