[
    {
        "Joan": "Joan",
        "Overview[]": "Joan is described as \"A fierce spirit despite being petite of stature. She is defiant, independent, easily worked up. It's clear she has a haunted past, but she's kind to those who deserve it. And although she's self-aware enough to know when she's outmatched, she won't go down without a fight.\" [1]",
        "Pre-Apocalypse[]": "Nothing is known about Joan's life prior to or as the outbreak began. It is possible that she used to live in or near Atlanta before the outbreak.",
        "Post-Apocalypse[]": "Joan is dragged down to a hospital room by Tanaka and Bello . Gorman calls for Dr. Steven Edwards to come into the room at Dawn Lerner 's request. Joan is being held down and struggling in a hospital bed at Grady Memorial Hospital. She tried to escape the compound and was bitten outside. Joan, clearly traumatized, is rather willing to die than have her arm amputated. As Dawn and newcomer Beth Greene hold her down, Dr. Edwards cuts off her arm. As Beth is cleaning up Joan's blood in her hospital room, Joan compliments Beth's humming, calling it \"really nice\". Joan implies that Lerner is allowing Gorman to rape her. [2] Later Beth finds Joan dead in Dawn's office. She had committed suicide by opening her stitching, ultimately resulting in her bleeding out. When Gorman attempts to sexually assault Beth, she knocks Gorman to the floor and a reanimated Joan rips out Gorman's neck. Beth then informs Dawn that Joan and Gorman went into her office. Dawn and Jefferies walk into the office and Joan attacks and kills Jefferies. Dawn then puts down a zombified Joan. When Beth and Noah are escaping the hospital, Joan's severed arm can be seen at the bottom of the elevator shaft.",
        "Death[]": "Killed By Gorman (Caused) Herself (Alive, Suicide) No longer wanting to be sexually abused by Gorman, Joan goes into Dawn's office and commits suicide by cutting open her stitches, causing her to bleed out. Dawn Lerner (Zombified) Later, a zombified Joan is put down by Dawn after having killed Gorman and Jeffries.",
        "Killed Victims[]": "This list shows the victims Joan has killed: Herself (Suicide, Alive) Gorman (Infected) Jeffries (Infected) Numerous counts of zombies",
        "Appearances[]": "\" Slabtown \"",
        "Trivia[]": "The casting call for this character used the name Amber . Joan was described as \"20s. A fierce spirit despite being petite of stature. She is defiant, independent, easily worked up. It's clear she has a haunted past, but she's kind to those who deserve it. And though she's self-aware enough to know when she's outmatched, she won't go down without a fight.\" Joan is the only named character in Season 5 to die and reanimate into a walker.",
        "References[]": "",
        "Name": "Joan"
    }
]