[
    {
        "Joe": "",
        "Overview[]": "Joe is portrayed as being a sadistic, violent, and dangerous man with no qualms about committing heinous crimes such as rape, physical and psychological torture and murder but at the same time a strong leader to those in his group. He established only a few rules for the group and therefore he allows his men to do as they please, as long as they don't break them. When a rule is broken, he is cruel and merciless toward the offender and his approved methods of punishment are harsh, and often lethal. Joe appears to have complete power over his group and appears to be respected by them all, as they rarely seem to question his orders. He is shown to be a savage and ruthless man, very much capable of cold-blooded murder and torture, however he still exercises patience and fairness (especially for Daryl ), when newcomers wish to join him. Nonetheless, he is very cautious and inquisitive, making it clear that not just anyone will be allowed in. Joe is also a hardened survivor, and appears to take sadistic pleasure in the violence that he and his group inflict on others as shown during the run-in with Rick 's group, where Joe joyfully informs Rick of what he and his group plan to do to him, Carl , Daryl, and Michonne , and is shown to have no qualms about harming and killing children as he allowed his group member Dan to molest Carl and surely would have allowed him to kill him afterwards, showing that Joe is completely remorseless. Joe is also shown to be a very honest and direct man and has made it very clear that he despises liars, as seen when he had Len beaten to death for lying after attempting to frame Daryl and also nearly had Billy and Harley kill Daryl when he believed Daryl was lying about Rick being a good person. However, at the same time he lacks the ability to look at things through the perspective of other people, as when he thinks that Daryl is lying about Rick being a good person, he fails to consider the possibility that Daryl may perceive Rick as a good person and may not be lying through his own point of view. Joe is also shown to be a little bit of a hypocrite, in the sense that when he thinks that Daryl is lying about Rick being a good person on the grounds that Rick had killed Lou , Joe arrogantly fails to see that he and his men are not good people either and this ironically is why Rick killed Lou in the first place. That and the fact that Joe and his men are rapists and murderers who evidently have no problem with killing children, making them worse than even Rick has ever been. Despite his villainous nature, Joe appears to hold respect and care for most of the members of his group, most notably Lou , as he makes it a mission for his group to track Lou's killer, Rick, down and slaughter him as revenge and to also bring harm to those whom Rick cares about to further intensify their revenge towards him; an act that eventually leads to his violent demise as well as the deaths of the other members of his group.",
        "Pre-Apocalypse[]": "Joe grew up in rural Georgia. At the age of 3, Joe gained an affection for cats where he believed there was nothing more sadder than an \"outdoor cat\" thinking it was an indoor one. As an adult, Joe worked as a mechanic. It was through his work with vehicles that he grew to become a motorcycle enthusiast and presumably a member of a Harley's motorcycle club. Joe was also an outdoors-man, as he held a genuine respect for bowmen and their ability to wield crossbows. He experienced a country-based lifestyle where he enjoyed camping, hunting, and even bared knowledge on brewing homemade alcohol.",
        "Post-Apocalypse[]": "At some point after the outbreak, Joe eventually formed a small group of survivors whom he maintained a firm leadership over and thus he strongly enforced his personal set of rules towards which included a sense of honesty along with the notion of claiming supplies in order to prevent tension from arising within the group. Over time however, Joe and his group gradually descended into a sinister lifestyle where eventually they became a group of marauders where they committed numerous horrific actions which included murdering innocent survivors, savagely raping several women as well as sadistically hunting their victims.",
        "Death[]": "Killed By Rick Grimes Joe locks Rick with his arms to prevent him from saving Carl from being raped and starts taunting him. Rick, in response, bites Joe's throat and rips it out, killing him. He is presumably put down before reanimation.",
        "Killed Victims[]": "This list shows the victims Joe has killed: Thief 1 Thief 2 Lou (Zombified, Possibly, Alongside fellow Claimers ) Len (Caused) 2 unnamed men (Caused, Alongside fellow Claimers) 1 unnamed Claimer (Caused) Numerous counts of zombies and unnamed people (Caused and Direct)",
        "Quotes[]": "The following is a list of some of Joe's most memorable quotes.",
        "Appearances[]": "",
        "Trivia[]": "Joe is the first primary antagonist on The Walking Dead to appear physically in both the main series as well as a webisode. Joe is the first and only character in the Red Machete webisodes to have lines. Rick killing Joe was indirectly mentioned by Shane during Rick 's dream in the episode \" What Comes After \". Joe's hair is visibly longer in the webisode than it is in the TV Series, even when the events coincide with \" A \". Jeff Kober , who portrayed the character, also voiced Silas' grandfather on World Beyond . In The Ones Who Live , Rick tells Beale that killing Joe was the worst thing he did to save someone else's life."
    }
]