[
    {
        "Pre-Apocalypse[]": "Nothing is known about Jones' life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "At some point during the outbreak, Jones joined a community in Ohio. Trooper Jones is one of the Commonwealth soldiers guarding the supply train. The train arrives at Junction 7 where Trooper 192 emerges and puts down a walker before trying to move the junction switch which is stuck. Wilson attempts to let Outpost 22 know that they have a stuck junction switch and that it will take a few minutes to dislodge it, but he receives no response as Trooper 192 puts down another walker that emerges from the woods. Entering the cab, Maggie orders Wilson to put down the radio at gunpoint. Daryl and Carol sneak along the side of the train, putting down an approaching walker before ducking as an annoyed Jones asks his fellow soldier how hard it can be and Trooper 192 challenges him to come over so he can show Jones. Spotting a herd emerging from the woods and coming down the tracks, Jones orders Trooper 301 and Trooper 263 to cover the woods and the flank respectively. Daryl and Carol crawl under the train as Jones jumps off the side, puts down a walker and goes to join Trooper 192 at the junction switch. In the woods, Trooper 301 finishes clearing the woods of walkers and calls in that the woods are cleared and she's heading back. Rosita and Gabriel ambush the soldier, disarming and killing her quietly so as not to draw notice from the other soldiers. Jones attempts to move the junction switch without success, and takes a closer look, realizing that someone had purposefully jammed it. Alarmed, Jones orders everyone to get back there now, but Daryl opens fire before anyone can respond, killing Trooper 263. As Daryl and Carol take cover on the train, Jones and Trooper 192 each come down one side of the train, engaging in a gunfight with Daryl and Carol. Maggie emerges from the train cab and shoots Trooper 192 dead from behind. Daryl proceeds down the side, only to have Jones emerge with Connie as a hostage. Jones forces Daryl to disarm himself and, after Daryl admits that they had disabled the train's long-range antenna, Jones demands to know exactly what they did to it. While the soldier is distracted by Daryl, Connie breaks free and Jones takes off running through the train, chased by Daryl after he makes sure that Connie's alright. Jones takes one of the motorcycles being transported on the train and flees while Carol helps Connie to her feet. Leaving his friends to deal with the approaching herd, Daryl takes the other motorcycle and chases after Jones who crashes his motorcycle after going off-road with it in an attempt to avoid Daryl. Sliding his motorcycle under a fallen tree, Daryl hits Jones, sending him to the ground and knocking the man's helmet off. Daryl stabs Jones in the head, killing him.",
        "Death[]": "Killed By Daryl Dixon Daryl rams into Jones with a motorcycle and then stabs him in the head.",
        "Killed Victims[]": "This list shows the victims Jones has killed: Numerous counts of zombies and possibly unnamed people",
        "Appearances[]": "\" Outpost 22 \"",
        "Trivia[]": "In the Memoriam on Talking Dead for \" Outpost 22 \", he is credited as Bad Trip Trooper . He shares the same last name as Morgan Jones . Jones is the last named character directly killed by Daryl Dixon in the TV Series .",
        "Name": "Jones"
    }
]