[
    {
        "Jules Butler": "Jules Butler",
        "Overview[]": "Jules is a sweet, friendly, and charming girl. She takes a liking to Luke , with the two often flirting with each other. She is shown to be courageous, taking part in Luke's plan to diverge Alpha 's herd of walkers. At the end of the war, the two finally become a couple.",
        "Pre-Apocalypse[]": "Nothing is known about Jules' life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "At some point after the apocalypse, Jules joined a community called Oceanside . Jules talks to Luke after he brings some ropes to her table. She starts flirting with him and they share a moment together. Jules and her fellow residents capture Virgil after he is discovered to had been spying on them and messing with the security system. When walkers suddenly invade, she helps take out the threat and secure the community. Jules is among the Oceansiders to relocate to the abandoned hospital being referred to as \"the tower\". As the survivors mill about the halls, Jules checks in with Luke to see if he needs any assistance. With the Whisperers and their massive herd surrounding the Tower , Gabriel addresses the assembled Coalition members, stating that their plan to lead the herd away is still the same, only they will be leading them away from the Tower instead of Oceanside . Once the walkers are clear, they will evacuate to Rendezvous Point B. Gabriel asks if Luke is ready and sitting before his equipment, Luke states that he has the final pieces they need to connect to the wagon and gives Carol a thumbs up in thanks for obtaining them, \"but in order for it do the Pied Piper thing we need it to do over the cliff,\" they need to get from A to B and Luke has to \"plug and plug\" and then they will be good to go. However, Magna and Jerry point out that the wagon is on the other side of the horde and someone must go through it with Whisperers to deal with as well. Gabriel decides to send four groups with two in each, one carrying the cargo while the other protects. Gabriel reminds everyone that it is crucial that all of the equipment makes it through to the wagon. Lydia offers to help them make it through, but Beatrice and Rachel refuse out of distrust for Lydia. Instead, Gabriel assigns her to help the archers covering them from the inside. Daryl acknowledges that not everyone will make it, but points out that this is the only way and everyone agrees to the plan. Daryl, Carol, Beatrice, Kelly , Magna, Jerry, Luke and Jules smear each other in walker guts in order to blend in with the herd and make it through. As Luke helps Jules to disguise herself, the two flirt with each other. Once they are ready, the group allows part of the horde into the hospital and, unnoticed due to the walker guts, are able to exit and begin passing through the horde to the other side. As they walk, a visibly-afraid Luke and Jules hold hands with each other. Luke, Jules, Magna and Jerry manage to make into the woods on the other side, but with no sign of the others, Jules worries aloud to Luke that they might be the only ones to have made it. However, seconds later, they are joined by Daryl and Kelly and a few minutes later by Carol and Lydia, Beatrice having fallen to a Whisperer and the horde. Reaching the wagon, Luke puts together his makeshift sound system and the group, joined by Oscar and Marco , start loudly playing \"Burning Down the House,\" using the loud music and the wagon to pull the horde away from the Tower. Jules acts as one of the archers escorting the wagon on its journey. At nighttime, the Whisperers launch an attack on the wagon, using walkers as human shields as the Coalition archers try to take them out. Before being killed by Daryl, one of the Whisperers throws a chain that takes off the wagon's front left wheel and the group is forced to retreat into the woods as the Whisperers destroy the sound system. With the horde turning back towards the Tower, Daryl warns Gabriel that they have lost the wagon and the others have walkers coming right back at them. Luke points out that the others should've evacuated by now with Jerry stating that the others are unprotected and they need to turn the horde around. Daryl suggests going back into the horde and hunting down the Whisperers one by one while Lydia offers to lead the horde away, having been taught how to by Alpha . Daryl and Luke object to Lydia's plan with Luke pointing out that without the wagon to lead the walkers over the cliff, its a suicide mission. Deciding to deal with that later, Daryl leads Marco, Carol, Luke, Jules, Magna, Jerry, Kelly and Lydia into the horde where they stealthily assassinate all of the Whisperers while Daryl and Negan take out Beta , allowing Lydia to lead the horde away and complete Luke's plan. The next day, Luke and Jules are sitting together at the rendezvous point when Carol and Lydia return. The two women confirm that the horde has been destroyed and Luke thanks everyone and hugs Jules, stating that he can't believe that they pulled it off. Following the Whisperer war, Jules went back to Oceanside with Luke. Later however, a hostile group called the Commonwealth took over under Lance Hornsby 's orders. In the woods, Lydia puts down a walker with her knife against the objections of Elijah who is worried that it could've been one of the climber variants. Although Jerry makes a joke about it, Aaron warns the others that they all need to stay alert as they don't know if their encounter with a climber was a one-time thing or not and there might be more of them out here. Aaron notices footsteps nearby, but Lydia recognizes them as being human, not walker. Aaron's group readies themselves to defend against possible threats, but Luke and Jules emerge from the trees instead. The friends are happily reunited with each other while Aaron introduces Luke and Jules to Elijah whom they have yet to meet. Jerry invites the two to join them in journeying to Oceanside , but Luke explains that \"it's gone, man. It ain't ours anymore. These guys in white gear showed up and... said they were from the Commonwealth\" with Jules adding that they had just taken over. Aaron is surprised as they had made a deal with the Commonwealth, but Luke tells him that something must've changed as the Commonwealth Army is tracking him and Jules right now and they're dead if they're found. Luke suggests getting far away from Oceanside as humanly possible which Aaron agrees with. Shocked by the news, everyone begins moving out. Aaron's group puts down several walkers and Luke and Jules explain that they were out scavenging and thus they weren't present when Lance Hornsby 's men arrived at Oceanside. They were hiding behind the houses trying to figure out what the hell to do with Luke wanting to stay and fight. However, Rachel wasn't having it and she insisted that they had to go, warn everybody and tell them what was coming which is why Luke and Jules had left in the end. Luke and Jules haven't seen Rachel or any of the others since and Luke feels guilty that they didn't stay and fight. Jerry and Aaron reassure them that they've got the group and everyone else now who are heading for Alexandria right now. Luke asks if that includes his old group which Aaron confirms. Hearing the sound of engines nearby, everyone quickly hides behind the wagon. Lydia and Elijah realize that the soldiers are closing in and that they can't outrun them. Spotting a herd moving nearby, Lydia looks at one of the dead walkers and gets an idea. That night, Aaron's group, covered in walker guts , moves with the massive herd, Lydia whispering directions to the others to move east. Two Commonwealth jeeps drive up and begin leading the herd in another direction, forcing Aaron, Lydia, Elijah, Jerry, Luke, and Jules to follow them in order to maintain their cover. Lydia is bumped into by a walker, causing her to drop her knife which is then picked up by a variant walker that's amongst the herd. In the woods, a Commonwealth jeep leads a large herd , amongst them Aaron , Lydia , Elijah , Jerry , Luke , and Jules, covered in walker guts . Spotting a break ahead to the right, Aaron whispers the message that it's now their chance with the others planning to make a break for the trees. However, as the group begins to make their break for it, a soldier pulls up on a motorcycle, leading a second herd in from the side that joins up with the massive herd that the jeep is leading, trapping Aaron's group amongst the walkers once more. From the other side, a third herd is brought in by another motorcycle, resulting in a massive herd of thousands of walkers having been corralled together by two Commonwealth jeeps and two motorcycles. Having completed their mission, the soldiers drive off, leaving the herd heading towards the Commonwealth itself which is just miles away. As they continue, Aaron spots an abandoned RV up ahead and directs the others towards it. Putting down a walker in the RV, Aaron, Jerry and Lydia manage to get inside, but Jules gets swept away by the herd and Luke goes after his girlfriend. The Coalition races through the streets towards the hospital with Daryl carrying the unconscious Judith . Commonwealth vehicles drive up and block their path in multiple directions, forcing them to fall back. Carol realizes that the soldiers aren't following them as they begin to erect barricades in the streets. Loudly yelling and firing their guns in the air, Commonwealth soldiers lead the herd in their direction before closing the barricades, penning the herd and the Coalition in. As walkers close in from multiple directions, Luke and Jules emerge from the herd, causing Kelly to nearly shoot them before Connie stops her. Fleeing down a side street, Carol spots an alley near part of the herd and everyone attacks the walkers, clearing a path for Daryl to flee down the alley towards the hospital with Judith. Waking up for a moment, Judith calls out \" daddy ?\" and witnesses her friends and loved ones struggling to hold back the herd before passing out again. In the streets, the Coalition desperately fights off the herd as they try to escape from the walkers swarming around them, those armed with guns shooting the undead while the rest stab at them with knives, including Max . However, Jules misses the head of one walker, instead stabbing it in the shoulder. The walker bites Jules in the arm and Luke rushes to his girlfriend's aid, stabbing the walker in the head and yelling for help as he supports Jules. However, walkers swarm the couple from behind with one tackling Luke to the ground and biting him in the leg as Jules is dragged down and devoured. Seeing Luke's predicament, Connie shoots the walker in the head and Luke is dragged to safety by Kelly and Yumiko , yelling in desperation for his girlfriend as Jules is devoured, beyond the ability of any of her friends to try to save her. Shortly thereafter, Luke also dies after a failed attempt at saving his life via amputation . One year later, Jules' name is on a plaque beside Luke, Rosita , and Marissa Berot , as part of a memorial dedicated to those who lost their lives when the herd overran the city. Eugene visits the plaque while attending Ezekiel 's speech as the new governor of the Commonwealth.",
        "Death[]": "Killed By Pamela Milton (Caused) Livits (Caused, Accidental) Zombies Jules is caught and devoured by the herd brought to the Commonwealth by Pamela.",
        "Killed Victims[]": "This list shows the victims Jules has killed: 12 unnamed Whisperers (Alongside Daryl , Carol , Jerry , Magna , Luke , Kelly , Marco , and Lydia ) Numerous counts of zombies",
        "Appearances[]": "",
        "Trivia[]": "During an interview, Alex Sgambati states that she had auditioned for all ten previous seasons before landing the part of Jules. [1] She confirmed she had auditioned for Frances and possibly Mary . [1] Jules and Luke are the last characters to have their last names revealed in the TV Series . Jules is the last named Oceanside resident introduced. She is also the only named Oceanside resident introduced in Season 10 , whereas every other named resident was introduced in Season 7 .",
        "References[]": "",
        "Name": "Jules Butler"
    }
]