[
    {
        "Pre-Apocalypse[]": "Almost nothing is known about Julio's life prior to or as the outbreak began, except that he received mechanical skills at some point in his life.",
        "Post-Apocalypse[]": "Sometime after the Woodbury refugees were admitted to the prison, Julio was brought into the safe refuge and lived in Cell Block C. [1] Julio is quarantined in Cell Block A and witnesses a fellow survivor die. He stands next to Jeanette and is told by Hershel to return to his cell as he deals with the dead man. Later, he watches in horror as Hershel is attacked by a woman who died from the flu and reanimated into a zombie. As the situation unfolds, he closes and locks his cell. Julio runs out into the prison yard with the other survivors after the Governor destroyed one of the guard towers with his tank. As Rick negotiates with the Governor , Daryl hands Julio a sniper rifle to help defend the prison. When the gunfire begins, he flips a table for cover and shoots at the Governor's militia , killing at least one man. As the remaining residents evacuate from the prison, Julio turns to join them in the run for the bus. However, he was shot in the back and killed, just a few feet away from Maggie and Glenn, most likely saving their lives by being in the way and taking the bullet.",
        "Death[]": "Killed By Philip Blake (Caused) The Governor's Militia As Julio is shooting at the Governor's militia during the prison battle, he attempts to escape with Maggie and Glenn, but gets shot in the back by one of the soldiers. It is unknown if he reanimated or if he was put down.",
        "Killed Victims[]": "This list shows the victims Julio has killed: A few unnamed members of the Governor's militia Possibly numerous counts of zombies",
        "Appearances[]": "\" Internment \" (No Lines) \" Too Far Gone \" (No Lines)",
        "Trivia[]": "The name Julio is not used in any dialogue or credits, but it was the name given to Santiago Cirilo for his role. During the Talking Dead \"In Memoriam\", Julio is mistakenly shown dying under \"The Governor's Militia\". Julio has longer, curly hair and facial hair in \"Too Far Gone\" compared to his previous appearance in \"Internment\" where he has shorter hair and stubble. This is likely a costume oversight and attributed to the amount of time between the filming for both episodes.",
        "References[]": "",
        "Name": "Julio"
    }
]