[
    {
        "Overview[]": "Justin is brutish and lazy, often slacking off on his duties with little regard for how it might affect others. He is also shown to be greedy and a bully, shoving Henry to the ground when the boy tried to stop him drinking more than his fair share of water. He is described by Rick as a trouble maker that always blames other people for his actions. It is also revealed that Justin, while under Simon's leadership, was a cruel killer, as he is revealed to have murdered Beatrice's husband following the failed rebellion initiated by the Oceanside group. This action, however, would eventually cost Justin his life.",
        "Pre-Apocalypse[]": "Nothing is known about Justin's life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "At some point in the apocalypse, Justin somehow came into contact with a group called \"the Saviors\" which he subsequently joined. Justin aided his group in terrorizing other survivors and communities around the area into subjugating to Negan's will, where their victims would be forced to give half their supplies in exchange for not being murdered. At some unknown point later, Justin was among the Saviors that executed every male survivor above the age of 10 from the Oceanside community under Simon 's orders. He personally killed Beatrice 's husband. During the year and a half that passed since the end of the war , Justin was forced to work on the Sanctuary under Daryl 's orders. When several crows invade the crops, he and Arat try to use a walker as a scarecrow, like the Saviors used to do, but Daryl puts it down. Later that day, Rick and his group arrive to deliver supplies later that day when Michonne points out graffiti over the walls that proclaims \"We are still Negan.\" Daryl orders Justin to clean it up, to his annoyance. Having moved from the Sanctuary to the work camp along with several other residents, Justin is part of the team of laborers working to build a bridge connecting the communities' trade routes. One morning, Henry arrives at the bridge to give water to the workers when Justin shoves him down for not giving him extra water and starts drinking from the jug. Henry gets angry and knocks him down with his stick. Jed sees this and mocks Justin, before helping him get up. Before a furious Justin can retaliate, Daryl stops him, saying that the kid's just doing his job. They soon start fighting until Rick arrives and stops them, forcing everyone to return to work. When a herd of walkers approaches the construction site later that day, Justin forgets to sound off his alarm to divert the herd, which causes Aaron to lose his arm. Despite explaining to Carol that his radio wasn't charged, Daryl attacks Justin and punches him repeatedly with a saucepan. That night, a stitched up Justin talks to Rick and tells him he needs to keep his \"dog\" on a leash, in reference to Daryl. Rick approaches and tells him he knows his type, the one that likes to blame others for his problems. Rick tells Justin to takes his things and leave and if he sees him again, a couple of stitches won't fix what he would do to him. Justin retorts that he wouldn't stay if Rick begged him to and says he will not wait until morning to leave. While walking in the woods, Justin drinks the last of his hooch when he hears something rustling in the bushes. He takes out a machete, then lowers it as he recognizes the person approaching when suddenly he gets violently pulled aside and is taken to the former community of the Oceansiders where Beatrice executes him, finally avenging her husband's death. Justin's corpse is left on a field where he is fed upon by several walkers before they are drawn off by a nearby noise. Justin reanimates moments later and wanders off. The next morning, a zombified Justin is found by Maggie Rhee and Kal on their way to the Sanctuary and is put down. His body is brought to the camp, causing tension between the various communities. At night, Beatrice confesses to Daryl and Maggie that she killed Justin as he had murdered her husband.",
        "Death[]": "Killed By Simon (Indirectly Caused) Himself (Indirectly Caused) Maggie Rhee (Indirectly Caused) Following Maggie's execution of Gregory, the Oceanside community became inspired and went after the Saviors who on Simon's orders executed all of the men and children from their group, among them Justin. Beatrice (Alive) As Justin is walking in the woods, he is captured and is shot in the chest with a spear gun by Beatrice, as revenge for killing her husband. Maggie Rhee or Kal (Zombified) After being fed upon by several walkers on a field, Justin reanimates and makes his way to a road where he is found the next morning by Maggie and Kal, who proceed to put him down.",
        "Killed Victims[]": "This list shows the victims Justin has killed: Beatrice 's Husband Cyndie 's Mother (Alongside his fellow Saviors) Himself (Indirectly Caused) Numerous male Oceanside survivors above the age of ten (Alongside fellow Saviors) Numerous counts of zombies and unnamed people",
        "Quotes[]": "The following is a list of some of Justin's most memorable quotes.",
        "Appearances[]": "\" A New Beginning \" \" The Bridge \" \" Warning Signs \" (Zombified)",
        "Trivia[]": "Justin is the first named member of the Saviors to die following the timeskip. While Justin was not introduced until Season 9, his character was present for the All Out War and had been part of the Saviors since before Season 6, as it was revealed he was part of Simon's crew to attack Oceanside.",
        "Name": "Justin"
    }
]