[
    {
        "Karen": "",
        "Overview[]": "Karen is a caring and composed woman who is initially part of the Woodbury militia. However, after witnessing the Governor 's brutality, she along with many other residents refuse to fight anymore, prompting the Governor to kill many Woodburians. Karen is the only person who manages to survive the Governor's massacre since she hid under someone's corpse. Afterwards, she helps convince Tyreese , Sasha , and the remaining Woodburians to join the prison group. Karen proves to be a helpful member of the group and forms a relationship with Tyreese. Unfortunately, she shows symptoms of an unknown disease. Not wanting to have the disease spread any further, Carol kills Karen. Tyreese is shown to be horrified by her death.",
        "Pre-Apocalypse[]": "Nothing is known about Karen's life prior to or as the outbreak began, except that she was a teacher.",
        "Post-Apocalypse[]": "The morning after the arena infiltration, Karen is one of the residents demanding Martinez to let her and the other townspeople leave town. When fellow Woodburian Richard Foster is attacked by zombies, she watches in horror and pleads with Andrea Harrison to do something, as he is suffering from his wounds. She asks repeatedly while Andrea just stands there, watching. The Governor then walks out of his apartment, aims his gun, shoots Richard in the head, and then he walks back into his home like nothing happened. Later that day, Karen, along with Paul , Eileen , and other townspeople gather outside the Governor's apartment until Andrea comes out and calms them down. Karen listens as Andrea addresses the crowd and unites them as a community, prompting cheers and hugs from her neighbors. Karen is seen on the front wall, armed with a rifle, on watch duty with the other guards. When Andrea queries Karen on the Governor's whereabouts, she refuses to give her an answer, claiming that she doesn't know anything. Karen argues with Martinez about Noah being trained for combat. She watches the Governor evaluate the townspeople with Andrea. She is on guard duty when Andrea returns to Woodbury, but lowers her gun when she realizes it's Andrea. Karen is among the Woodbury militia assembled by the front gate. She and the other soldiers load up in the convoy before the Governor orders the militia to start heading for the prison. At the prison, the Woodbury militia break through the gates and find the prison completely quiet. Inside, Karen is split into one of two groups as they search the prison for Rick's group. Chaos soon breaks out as smoke grenades and loud strobe alarms broke out, followed by gunfire that killed many Woodburians. Karen and the surviving soldiers flee the prison and head home for Woodbury. On the road, the Governor forces the militia to stop and demands they return to the prison to finish the job. Karen screams at the Governor that the raid was a slaughter for them, and that while they will fight the undead, they refuse to fight against other communities of survivors. As she and the others turn to get back in their vehicles, the Governor begins massacring his own people, starting with shooting Paul in the back and ending with a gunshot at Allen . In the chaos, Karen was quickly able to get under the body of a dead man and pretend to be dead herself, as the Governor began putting a bullet in each deceased Woodburian's head. However, he ran out of bullets when reaching Karen and the dead man's bodies. He turned around and left the scene with Shumpert and Martinez, leaving Karen to breathe a sigh of relief. She eventually hid inside of the Army truck and was eventually found by Daryl , Rick , and Michonne . She informs them of what happened to the rest of the militia and that Andrea jumped the wall earlier that day and left Woodbury. She accompanies Rick and the others to Woodbury and takes cover when Tyreese and Sasha begin shooting from the wall. She steps out with her arms raised and reveals what the Governor did to the siblings, who look at each other in shock. The next morning, Karen arrives at the prison on a school bus with a couple dozen women, elderly, and children. She and the remaining Woodbury townspeople were welcomed into the prison community with open arms by Hershel, Beth, Carol, and the others. Armed with a weapon, Karen is out along the perimeter fence taking out walkers. Part of a group consisting of Henry , David , Chloe , and another man , they work methodically as a team to put down walkers and spread out any groups. Eventually, before leaving on the Big Spot supply run, Tyreese pays her a visit and kisses her. They discuss the supply run and he confesses to Karen that he never enjoyed killing the walkers outside of the fence. He only did it to spend time with her. Later that night, Karen and Tyreese are seen in their cell talking to one another before going to sleep. Karen is seen with Tyreese until she leaves for Cell Block D. She stops at the showers for some water when she hears a strange noise. She investigates, finds nothing, and returns to her cell. However, a zombified Patrick emerges and follows Karen back to D Block. He feeds upon, and thus turns, a man and the two launch an attack on the prison inhabitants. Karen manages to survive and is led to safety by Tyreese. She is later seen coughing (a symptom of a fatal unknown disease). The Council places her under quarantine in another cell block along with others who may have been exposed. When Tyreese goes to visit her, he finds a blood trail that leads outside. He discovers two seared corpses, one of them being Karen, as it is wearing her bracelet. Karen's charred corpse is seen again as Rick, Daryl, Tyreese, and Carol Peletier discover that she has been murdered. Later in the episode, Rick asks Carol if she killed Karen and David. After a long pause, Carol responds \"Yes\" and walks away. Karen is seen as Rick imagines Carol stabbing Karen and dragging her body out to be burned. She is later mentioned in conversations by Rick and Carol. Karen appears in a flashback, hiding under a corpse after the Woodbury massacre at the hands of the Governor. Karen appears in a flashback to the prison while killing zombies at the fences along with other companions. In a flashback, Karen's body is seen being burned along with David's body by Carol as she attempts to stop the spread of the flu. Karen appears briefly in a flashback when Rick reflects on memories with all of his friends while panicking over the possibility that his other friends could be killed by the Saviors .",
        "Death[]": "Killed By The Flu (Caused) After displaying symptoms of the unknown illness, Karen is separated from the healthy people in the prison. Carol Peletier Later, in an effort to prevent the infection from spreading within the prison, Karen is murdered and then burned by Carol.",
        "Killed Victims[]": "This list shows the victims Karen has killed: Nick (Possibly, Zombified) Numerous counts of zombies",
        "Appearances[]": "",
        "Trivia[]": "Laurie Holden ( Andrea ) and Melissa Ponzio have speculated that before the outbreak, Karen was a school teacher, which would also explain as to why she cared so much about Noah being in the Woodbury army. In this interview (with MTV), Ponzio and Holden also confirmed that Noah is not Karen's son (as was previously believed), and that he was killed by the Governor off-screen in \" Welcome to the Tombs \". [1] She is one of two characters to have faked their deaths in order to survive. The other character is Anne . Interestingly enough, both incidents occurred while their group was being exterminated. Karen and David are Carol Peletier 's first direct human kills. Karen appears in the final flashbacks of the last episode \" Rest in Peace \".",
        "References[]": ""
    }
]