[
    {
        "Overview[]": "Kathy is among the most trusted members of Oceanside . She also seems to be one of the most combat proficient. She and Beatrice are ordered by Natania to secretly execute Tara , though she manages to escape. Later, when Rick 's group takes Oceanside 's weapons, Kathy is among those who seem interested in joining fight against the Saviors to get revenge on those who wronged them. Though later she seems to lose interest after Enid kills Natania. Kathy even suggests to kill Enid and Aaron for what they did. However, later Kathy and the other Oceanside residents join the fight and save Hilltop . After peace is made among the communities, Kathy is inspired with her fellow Oceansiders to kill the Saviors who murdered all the men in their community. Though this gets her killed when the Saviors attack the camp to get revenge on them.",
        "Pre-Apocalypse[]": "Nothing is known about Kathy's life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "Kathy survived the early stages of the outbreak and eventually found herself as a member of a large group of survivors led by a woman named Natania . Unfortunately, her group would be discovered by a large, hostile organization of survivors led by Simon (who later became Negan 's ruthless and sadistic second-in-command) and under his orders, Kathy and her people were forced to gather and provide supplies for them under threat of death. Eventually, under Natania's orders, the group initiated a rebellion to fight back against their oppressors. However, due to being outgunned and outnumbered, their group was defeated. As punishment for their defiance and to deter any further resistance, Simon had his group murder every male survivor above the age of 10 in Kathy's group. It is unknown if any of Kathy's family were among the casualties of the rebellion or subsequent massacre. Following this and being unwilling to continue working for Simon and his group, Kathy and her group, consisting mainly of females now, fled their community and established a new home at a location called Oceanside and reestablished their community hidden from them. In order to prevent Simon and his group from finding them again, Natania ordered any survivor who happened upon the community to be immediately killed in order to maintain the secrecy of their new home.",
        "Death[]": "Killed By Jed (Alive) During the shootout between the rebelling Saviors and members of the Militia, Kathy is shot in the chest by Jed. Rick Grimes (Zombified) With the last of his strength, Rick manages to shoot a zombified Kathy in the head.",
        "Killed Victims[]": "This list shows the victims Kathy has killed: Wade (Possibly) Norris (Alive, alongside Carol , Jerry , and Beatrice ) Numerous unnamed Saviors (Alongside her fellow Oceansiders) Numerous counts of zombies and unnamed people",
        "Appearances[]": "",
        "Trivia[]": "Kathy is the last named person that Rick Grimes kills during his time on the TV Series , living or otherwise. In the Memoriam on Talking Dead for \" What Comes After \", she is credited along with Norris as Unhappy Camper Walkers .",
        "Name": "Kathy"
    }
]