[
    {
        "Katy": "Katy",
        "Pre-Apocalypse[]": "Nothing is known about Katy's life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "At some point in the apocalypse, Katy somehow came into contact with a group named \"the Saviors\" which she subsequently joined. Katy aided her group in terrorizing other survivors and communities around the area into subjugating to Negan Smith 's will, where their victims would be forced to give half their supplies in exchange for not being murdered. Katy is among the Saviors at the satellite outpost to surrender to the Militia. Katy is tied up and sorted into one of four chain gangs. She and the other prisoners of war are transported along a rural highway to the Hilltop when a swarm of walkers falls down a hill where they attack the Saviors and militia. In the chaos, a chain gang flees. Katy calls for the Saviors in her chain gang to follow them, and attempts to flee, but Alden subtly trips her, heeding the chain gang's escape. As a result, they are unable to flee and taken back into custody. After arriving at the Hilltop, they are let inside and corralled into two trailers in the back of the settlement. Katy is among the captured Saviors sitting outside the Hilltop as their fates are discussed by Maggie and the others. Ultimately, she is allowed to stay at the Hilltop in a makeshift prison that was built when Maggie chooses to side with Jesus over Gregory . However, she and the others are only being kept alive as bargaining chips and will be killed off if there are no prisoners to be released by the Saviors. Katy and the other Saviors remain in the prison when Maggie demands Dean to be let out. She watches as Alden attempts to dissuade Maggie from what she's about to do, but Maggie suddenly shoots Dean in the face, killing him. Katy and the others watch on as Maggie threatens Alden and Dean's body is taken away. When Simon confronts the survivors at the Hilltop, the survivors bring out Katy, Jared , Alden, and the other Saviors onto the balcony, to show that Maggie has bargaining power of her own. However, she and the others are abandoned by Simon before the Saviors launch their attack. She is among the people wounded with an arrow before bring evacuated inside the Barrington House. The next day, Katy is back in the makeshift prison with the other Saviors when she turns and attacks several Saviors. In the ensuing chaos, the rest of the Saviors escape the Hilltop. The zombified Katy is later found and put down by Siddiq when he checks on the prisoners.",
        "Death[]": "Killed By Negan Smith (Indirectly Caused) Simon (Caused) The Saviors (Alive, Caused) During the Saviors' attack on the Hilltop, as she is retreating back into the manor for protection, Katy is shot by one of the Saviors' tainted arrows. The following night, Katy succumbs to the infection and reanimates. Siddiq (Zombified) After finding a zombified Katy chasing the escape Saviors, Siddiq manages to stab her in the head.",
        "Killed Victims[]": "This list shows the victims Katy has killed: 2 unnamed Saviors (Infected) At least 1 unnamed Hilltop resident/refugee (Infected) Possibly numerous counts of zombies and unnamed people",
        "Appearances[]": "",
        "Trivia[]": "Katy is credited as Savior POW #1 in \" Monsters \" and as Katy in \" Do Not Send Us Astray \". She is named after the actress who portrays her, Katy O'Brian . This character is portrayed by a different actress, Bethany Kasulas , in \" The Damned \" and \" The King, the Widow, and Rick \". In Talking Dead's In Memoriam segment, Katy is dubbed as Cool Hair Walker .",
        "Name": "Katy"
    }
]