[
    {
        "Kenneth Sutton": "",
        "Fate": "",
        "Contents": "",
        "Overview[]": "Kenneth is a well-meaning, courteous, and brave young man. He takes part in the group's scavenging mission and gets along with all the members of the group. He shown to care greatly for the animals, as when walkers attack the wagon, Ken refuses to leave the horses to die and goes back to free them. However, this ends up getting him killed when he is bitten by a walker and the horse he had saved kicks him in the ribs. The group tries their best to save him but he dies of blood loss. The entire community is shown to be saddened by his loss, as they hold a funeral for him. Though he died shortly after his introduction, his death played a major role, as it led to Gregory attempting to use Ken's father, Earl , to kill Maggie , which then led to Gregory's execution, followed by the Oceanside residents taking vengeance on the Saviors .",
        "Pre-Apocalypse[]": "Nothing is known about Ken's life prior to or as the outbreak began, except that he had a father, Earl Sutton , and mother, Tammy Rose Sutton . When Ken was two, his father got into an argument with Ken's babysitter after getting drunk. He proceeded to drive off with Ken, but eventually pulled over and called Ken's mother to pick them up. Earl swore off drinking from that day on, staying sober for 20 years.",
        "Post-Apocalypse[]": "At some point in the apocalypse, Kenneth and his family joined a community called the Hilltop Colony . Over time, he became one of the supply runners as well as one of the horse handlers. When a group goes to the Smithsonian in Washington, D.C. , to search for a covered wagon and farming equipment for the Sanctuary, Kenneth takes part in the scavenging mission. Once inside, Rick tells everyone to be safe and the group separates, with Ken and Marco pairing up. Shortly after, the whole group reunites and gingerly uses ropes to drag an old covered wagon down the stairs and over the glass floor. The group then leaves D.C. and prepare to head back to their own communities. On the road, Alden talks to Ken and Marco about blacksmithing at the Hilltop. Ken says that his father is willing to teach Marco on becoming a blacksmith. Later, he is informed by Daryl and Rosita that the main bridge is out due to a storm. Being forced to continue their journey through an alternate route, Ken tries to free one of his horses when the wagon gets caught in mud as walkers approach. However, he is bitten in the arm by a walker and then kicked in the ribs by the horse. Siddiq and Enid try to save him but Ken succumbs to blood loss and dies from his injuries. A saddened Maggie sobs by his side before putting him down. At his funeral, Alden sings a song and Gregory gives a eulogy. Kal , Earl, Alden, and Jesus place the lid on the coffin and prepare to bury him.",
        "Death[]": "Killed By Zombies (Caused) Horse (Caused) Himself (Indirectly Caused) As Ken tries to release one of the horses from the wagon stuck in the mud, a walker comes from behind and bites him on the arm. Before he can defend himself, the horse panics and kicks him on his ribs. Blood Loss (Alive) Despite trying to help him, Ken succumbs to his injuries and dies from blood loss. Maggie Rhee (Before Reanimation) Later, a saddened Maggie stabs him in the back of the head, putting him down.",
        "Killed Victims[]": "This list shows the victims Kenneth has killed: Himself (Indirectly Caused) Possibly numerous counts of zombies",
        "Relationships[]": "",
        "Appearances[]": "\" A New Beginning \"",
        "Trivia[]": "Ken is the first character to die in Season 9 . Ken is briefly mentioned by Earl and Tammy long after his death, in \" Evolution \" and \" Bounty \", respectively. He was also referred to in \" Walk With Us \" prior to Earl's death. Ken is one of two character to have his ancestry changed from comic to show, as he is the son of Earl and Tammy Rose Sutton, as opposed to the comics where his parents were unknown. The other example of this is Shawn Greene ."
    }
]