[
    {
        "Keno": "",
        "Pre-Apocalypse[]": "Nothing is known about Keno's life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "At some point in the apocalypse, Keno somehow came into contact with a group named \"the Saviors\" which he subsequently joined upon where he was appointed as one of the Sanctuary guards. Keno aided his group in terrorizing other survivors and communities around the area into subjugating to Negan's will, where their victims would be forced to give half their supplies in exchange for not being murdered. Keno is one of the Saviors taunting Rick's group as they attempt to travel to the Hilltop. Once Rick's group is finally captured in the woods, Keno is among the Saviors to surround the survivors. Keno and the other Saviors witness Negan beat Glenn and Abraham to death. Afterwards, he and his fellow Saviors pack up and leave the scene. Keno is among the Saviors to raid Alexandria for supplies, weapons, and furniture. Keno is on patrol outside of the Sanctuary with Negan who is coming to see the goods he was offered. When Carl threatens Negan and is finally overpowered by Dwight, Keno and his fellow Saviors head back into the Sanctuary. Keno is on patrol at the Sanctuary when he finds Eugene outside with Frankie , Tanya , and Amber . Tanya dismisses Keno, saying that everything is fine as Eugene prepares to demonstrate some science tricks. Keno is among the Saviors at the Hilltop as they collect an early offering from its residents. He and his fellow Saviors then return to the Sanctuary as Negan speaks with Harlan and Eugene. Keno is among the Saviors to be killed by the Militia as they attack the Hilltop. Keno appears in Michonne's nightmare where she envisions herself as a Savior on the night they meet Negan.",
        "Death[]": "Killed By Morgan Jones During the Militia counter-attack on the Saviors after attacking the Hilltop, Keno is stabbed by Morgan.",
        "Killed Victims[]": "This list shows the victims Keno has killed: Possibly numerous counts of zombies and unnamed people",
        "Appearances[]": "",
        "Trivia[]": "Keno appears in the final flashbacks of the last episode \" Rest in Peace \"."
    }
]