[
    {
        "Kim": "Kim",
        "Pre-Apocalypse[]": "Nothing is known about Kim's life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "Several years into the outbreak, Kim joined a community called Meridian . A few years later, Meridian was attacked by a hostile group of raiders , forcing her and the remaining survivors to flee. After the Reapers destroyed her home village, Kim and several of her fellow survivors fled far enough until the point they had successfully escaped the Reapers. She and the majority of the survivors were staying at a rendezvous while Maggie , Cole , and Elijah went out to ensure Hilltop was safe despite the recent Whisperer threat. At some point, the rendezvous was attacked and Billy and Jen were killed while the rest of the group fled, including Kim. According to Maya , at some point while fleeing in the woods, the group was split up and Kim picked up Hershel to help get away from the unseen threat faster. When the attacker corners Maggie, Kim and another man are among the reinforcements to rush to save her. Following the attacker's demise, she arrives at the Alexandria Safe Zone where she's welcomed alongside the other Meridian refugees. Kim assists Aaron and three other Alexandrians in raising a section of the wall to repair the damage left behind by the Whisperers. The residents are successful in getting the wall in place, to which they congratulate each other after the job is done. One morning Kim is asleep on the floor in a house crowded with other residents and refugees. She is awoken by Jerry who alerts everyone that the undead have made it inside Alexandria. Kim quickly gets up and follows everyone outside, running down the street to the portion of the wall that fell. She helps other secure the portion of the wall once its raised into position. After returning home from the mission in Meridian , Kim and the other Wardens comfort a wounded and traumatized Elijah as he settles in. After a brief commotion at the gates of Alexandria, Kim sits on the porch of the meeting house with the other Alexandrians and listens as Lance Hornsby , a diplomat from the Commonwealth , presents the survivors with a decision regarding the future of their home and livelihoods. Kim helps her fellow Hilltoppers and the Commonwealth soldiers in putting down the undead wandering beyond Hilltop's walls and moving their bodies into piles to be burned. Kim and a few other residents rush to the main gate after an injured Jesse arrives on horseback. She witnesses Lydia and Elijah examine Jesse's body where they find a bloodied map with the location of Riverbend marked on it. Kim and Elijah reluctantly open a side gate for Lance Hornsby and his soldiers to search Hilltop for the missing Commonwealth weapons. One year later, Kim has not been seen. It is possible she is still living in Hilltop or moved to the Commonwealth after Milton's regime.",
        "Killed Victims[]": "This list shows the victims Kim has killed: The Attacker (Caused) Numerous counts of zombies and possibly unnamed people",
        "Appearances[]": "",
        "Trivia[]": "Gloria DeWeese also portrayed a separate character, an Oceanside resident in Seasons 7, 9, and 10. She also portrayed multiple walkers over various seasons. Kim is the only Meridian resident to have an unknown status. Kim appears in the final flashbacks of the last episode \" Rest in Peace \".",
        "Name": "Kim"
    }
]