[
    {
        "Kurt": "",
        "Fate": "",
        "Contents": "",
        "Pre-Apocalypse[]": "Nothing is known about Kurt's life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "At some point in the apocalypse, Kurt joined a community called the Kingdom where he became one of the medics. Following the Saviors ' attack on Hilltop , Kurt tends to the wounded alongside Siddiq and Dana . That night, he is on nurse duty as he watches over Tobin and Kevin , both recovering from their injuries from the attack. He is awakened by Kevin's groans in the middle of the night at 3:26 am and decides to go find Dana. Before Kurt can exit the trailer, he is attacked from behind by a reanimated Tobin and promptly killed. A short time later, a reanimated Kurt is along the zombified residents and refugees to attack the people sleeping inside the Barrington House. During the attack, Kurt is put down by Michonne 's katana as he is held against the wall by Jesus . The next morning, he is buried in the graveyard with the other casualties.",
        "Death[]": "Killed By Negan Smith (Indirectly Caused) Kevin (Indirectly Caused) Simon (Caused) Derek (Caused) Tobin (Infected, Alive) After turning into a walker due to the Saviors' tainted weapons, Tobin attacks Kurt, biting into the side of his neck. Paul Rovia (Caused) Michonne Hawthorne (Zombified) As a zombified Kurt advances on Jesus and Michonne, Jesus pins him to the wall and Michonne sticks her sword through his head, putting him down.",
        "Killed Victims[]": "This list shows the victims Kurt has killed: Possibly numerous counts of zombies",
        "Relationships[]": "",
        "Appearances[]": "\" Do Not Send Us Astray \"",
        "Trivia[]": "Since it is known that Tobin reanimated at 3:26 AM and bit him shortly thereafter, it is safe to assume that Kurt’s time of death would be between 3:26 AM and 3:27 AM. Kurt is the only named character who is killed by Paul Rovia on-screen in the TV Series , albeit zombified."
    }
]