[
    {
        "Kyle": "",
        "Pre-Apocalypse[]": "Nothing is known about Kyle's life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "At some point in the apocalypse, Kyle joined a community called the Alexandria Safe Zone . Kyle is one of the many Alexandrians present in helping construct walls out on the side of the road, which are designed to corral the horde of zombies along a route away from Alexandria. Kyle is on a walk with a woman as Carol follows Denise and Morgan around. A short time later, Kyle attends Father Gabriel 's prayer circle with Kent , Bob , Barbara , and several other Alexandrians. He also witnesses Enid and Glenn Rhee 's green balloons floating in the sky, just before the wall is brought down by the collapsing church steeple. Kyle is among Tobin, Bob, Anna and other townspeople taking shelter in Father Gabriel's church. He listens to Gabriel's speech about having courage to save Alexandria from the zombies and watches as he and other Alexandrians head out into the streets. Kyle is among the townspeople to witness Spencer and Negan play pool and the former's death at the hands of Negan. After Rosita attempts to shoot Negan but hits Lucille instead, he is horrified as Arat guns down Olivia on Negan's command to kill a resident. When Simon and his group of Saviors unexpectedly invade Alexandria in search of Daryl , Kyle and several other residents watch the ordeal from a safe distance. Kyle is present and listens to the speeches given by Ezekiel , Maggie , and Rick before their first attack. He travels with Rick and everyone to the Sanctuary to attack Negan and the Saviors . He is later seen with Rick and other members of Alexandria after the assault, regrouping. Kyle is among the group of Alexandrians to ambush a Savior outpost from their vehicles. As they continuously fire at the Saviors, they manage to kill off several Saviors in an effort to have them reanimate and overrun their comrades. At the conclusion of the ambush on the Savior outpost, Kyle is among the wounded Alexandrians loaded into a pick-up truck and driven back to Alexandria. After the attack on Alexandria, it is revealed Kyle is among the residents to escape into the sewers in time. Kyle appears in Carl 's dream sequence as Rick and Judith walk around Alexandria. In the present, Kyle remains in the sewers with the other Alexandrians as the Saviors' grenades continue to blow apart Alexandria above them. After the explosions subside and the remaining Saviors leave, he and the others prepare to head to the Hilltop for refuge. Kyle and the other Alexandrians evacuate through the woods towards the Hilltop. He, along with the majority of the group, rests in the woods while the swamp is cleared of zombies by Daryl, Scott , Rosita, and Siddiq . He successfully arrives at the Hilltop with the Alexandrians and is welcomed into the community with open arms. Kyle is among the Alexandrians, Hilltoppers, and Kingdommers seeking refuge in the crowded Barrington House. Residents and refugees are lined up sleeping on the floors and hallways on multiple levels of the house. When the Saviors attack the Hilltop, Kyle is safely inside the Barrington House with the other survivors. The next night, he sleeps inside the Barrington House when several reanimated residents begin attacking fellow survivors. Fortunately, Kyle is able to escape outside to safety. Kyle accompanies the Militia to fight the Saviors in the final battle. After most of the Saviors are wiped out due to Eugene 's faulty bullets, he helps the others fight the surviving Saviors until they surrender. He watches on as Negan is defeated and captured while Rick addresses the crowd, declaring peace among all communities. Afterwards, he returns home to Alexandria to re-establish the previously destroyed community. Having moved from Alexandria to the work camp along with several other residents, Kyle is part of the team of laborers working to build a bridge connecting the communities' trade routes. He walks around camp as Rick and Eugene discuss the missing Savior laborers and later works at the construction site with other people. Kyle walks around the work camp as Rick and Eugene discuss the progress of the bridge construction project. Sometime during the six years after the supposed death of Rick Grimes, Kyle was granted a role on the council that governs Alexandria. Part of his role as a councilmember, he records the minutes for each meeting as the stenographer, oversees the upkeep of the council chamber and the rest of the building, and tracks the production count of produce and other goods for trade, excluding firearms and medicine. He also handles the breakdown of the food supply in Alexandria, prioritizing the children and elderly, followed by those on recon and guard duty, and finally the general population. He is among the residents to gather at the front gate when Judith and the others return with the newcomers. Later, he joins the rest of the council as they interview Magna 's group before voting on whether or not they should be permitted to join the community. He and the other residents are shocked when Michonne reveals that Magna's hand tattoo means she was once in prison before the apocalypse. In Alexandria, Kyle, along with Nora and Laura , listens as Michonne, Siddiq , and Aaron discuss the new threat as well as the state of the Kingdom and their invitation to attend the fair. Kyle is disappointed to hear that Michonne refuses to let anyone attend the fair. However, she later changes her mind and allows to send a delegation to the Kingdom. Kyle is among the Alexandrians to take refuge in the meeting house from the storm alongside Eugene, Gabriel, Rosita, Siddiq, Judith, R.J. , and Negan. After the fireplace blows out, he and the other Alexandrians make the trek through the storm to take shelter in Aaron's house. Kyle is among the council members to enter the meeting house as the teacher is going over her lessons with Lydia , Gracie , and several other Alexandrian children. The council announces they need to cut class short as they need the space to hold an emergency meeting regarding the discovery of a Whisperer mask in Oceanside. After the meeting is over, he exits the meeting house with Rosita, Siddiq, Eugene, and Gabriel. Later, he is outside with Eugene, Laura, and several other Alexandrians when they witness a satellite falling from the sky. As endless waves of the undead surround Alexandria, Kyle attends an emergency council meeting later that day and listens as Michonne tells everyone instead of retaliating, she and a small group will meet with Alpha at the border to work things out. Kyle is at the dining hall enjoying a meal when Lydia makes a scene by gutting a dead squirrel, upsetting Gage , Margo , and Alfred . He watches as the three leave in disgust before returning to his meal. Later that night, Kyle and the council reunite in the meeting house to discuss Lydia's attack. They question Gage and Alfred, who lie and say they were attacked. Gabriel asks why Lydia's the one in the infirmary. They remind the council that their friends were beheaded by the Whisperers and now Margo is dead, and they are not happy with how they are being treated. The council then lets them go. While the council discusses their vote on Negan's fate, Kyle opposes to Negan being spared after explaining his own motives. Daryl arrives and says he believes Lydia, which ties the vote. Gabriel announces he'll take the night to make his decision by tomorrow. Kyle is waiting outside the infirmary with several other residents, all waiting to be seen by Dante after suddenly coming down with an illness. He is eventually admitted into the infirmary where he is cared for by Dante and Siddiq. Kyle attends the funeral service for Siddiq and listens to Gabriel's religious remarks. He silently pays his respects and then leaves the ceremony. The morning after Beta's attack on Alexandria, Kyle chats with a man and a woman as Aaron reunites with Gabriel and Scott in the town cemetery. Kyle is among the Alexandria residents to evacuate to the abandoned hospital referred to as the \" Tower \". As the survivors mill about the hospital, Kyle takes notes on a pad of paper as he chats with an Oceanside woman and a Hilltop woman . Though unseen, Kyle and dozens of others seek refuge on the upper floors of the hospital. As a group of survivors enact a plan to lure the herd away, others defend the hospital from the Whisperers and snipe as many as they can from the windows. When the Whisperers eventually break into the hospital, Kyle and the others are evacuated safely from the hospital via the elevator shafts and basement tunnels. After Beta and the Whisperers are wiped out, the remaining survivors congregate in the woods where the injured are treated and families are reunited. Several months after the storm in Alexandria, and following most of the group moving to the Commonwealth, Kyle has not been seen or mentioned in that timeframe. He is not shown living in the Commonwealth, nor is he seen in Alexandria, leaving his status unknown. [1]",
        "Killed Victims[]": "This list shows the victims Kyle has killed: Dino (Alongside his fellow Militia members) Mara (Caused, alongside his fellow Militia members) Many unnamed Saviors Numerous counts of zombies",
        "Appearances[]": "",
        "Trivia[]": "Originally, Kyle was meant to be killed off during \" Monsters \" but they used another core extra instead as the featured casualty. Due to being one of the recurring core extras, Kyle was named and was selected to play the role of a councilman for the Alexandria council. Deleted scenes from \" Guardians \" included Michonne calling out Kyle's name to get his attention before he could leave the meeting house. Kyle appears in the archival footage shown at the beginning of \" Variant \" as Judith narrates past events of the show to the audience before the episode's story begins. Kyle appears in the final flashbacks of the last episode \" Rest in Peace \".",
        "References[]": ""
    }
]