[
    {
        "Laura": "",
        "Fate": "",
        "Contents": "",
        "Overview[]": "Laura is shown to be an intelligent, cunning and initially cruel person who is a strong, determined survivor. She is described as having a wild and reckless side and enjoys having \"fun\" as seen when she plays table hockey with Dwight. She is shown to have a somewhat of a free-spirited side as seen when she flirted with Spencer and offered to take him back to her compound presumably in order to get together with him, although it seems this was more a result of him actually scavenging supplies and fulfilling Negan's orders rather than genuine interest in him. Laura demonstrated extreme loyalty to the Saviors and seemed to fully support their savage lifestyle and was shown to be cruel to the members of communities that her group extorted from. This was seen when she threatened Eugene and held Rick at gunpoint in order to prevent him from interfering with Aaron being brutally beaten. Her loyalty is further proven as she is easily angered at any disrespect towards her group, and being apathetic towards the extreme violence that Negan and the Saviors commonly engaged. Forcing Eugene to watch Negan burn Emmett Carson alive while he tried to look away in horror. She is likely a murderer herself and would've killed Dwight after he betrayed their group following the attack on Alexandria by making them fall in to ambush led by Daryl. Laura escaped the ambush and made it a personal mission to make it back to the Sanctuary despite being injured in order to gain revenge and expose him as the Militia 's spy. She has no remorse and will rat out anyone who falls out of line. In spite of her loyalty to Negan, she is not fundamentally a bad person who wishes for the extermination of the other communities. After suffering heavy losses, Laura leads the Saviors in surrendering to the Militia and fully embraces the peace with the other communities. When people from the other communities arrive at the Sanctuary, Laura, now working as a gardener, goes so far as to give Rosita Espinosa a friendly nod and shows no ill will towards her former enemies. A year and a half after Negan's defeat, Laura is shown to be fully reformed and often acts as a mediator between the Saviors and the rest of the communities, preferring to solve conflicts peacefully. During the bridge construction, she and Arat are the only Saviors to show no hostility towards the other survivors and, in fact, try to deescalate the conflict. She also doesn't join Jed and the other Saviors when they go back to the campsite to raid it. Six years later, she is fully integrated into and trusted by Alexandria and has become a member of its leadership council.",
        "Pre-Apocalypse[]": "Nothing is known about Laura's life prior to or as the outbreak began, except that she had a boyfriend and was adopted by Franklin .",
        "Post-Apocalypse[]": "At some point in the apocalypse after losing her boyfriend, Laura joined a group named \"the Saviors\" where she was appointed as one of Negan's personal lieutenants. She had previously met Negan, as well as giving him the baseball bat that became Lucille. Laura aided her group in terrorizing other survivors and communities around the area into subjugating to Negan's will, where their victims would be forced to give half their supplies in exchange for not being murdered.",
        "Death[]": "Killed By Herself (Caused) Beta (Alive) In an attempt to protect Mary as she runs to the streets for help, Laura attacks Beta by jumping on his back. Beta, however, manages to overpower her, picks her up, and swings her around so her head bounces off each cell bar before slamming her to the ground, breaking her neck and killing her instantly. Coalition member (Before Reanimation, Off-Screen) Laura is put down by a Coalition member after the attack like Beta's other victims.",
        "Killed Victims[]": "This list shows the victims Laura has killed: Simon (Possibly, Zombified) Alfred (Zombified, alongside her fellow Alexandrians) Alexandria Guard (Zombified, alongside her fellow Alexandrians) Panicked Woman (Zombified, alongside her fellow Alexandrians) Herself (Caused) 6 unnamed Alexandria residents (Zombified, alongside her fellow Alexandrians) Numerous counts of zombies and possibly unnamed people",
        "Relationships[]": "For a more in-depth look at Laura's relationships, read here: Laura (TV Series)/Relationships",
        "Appearances[]": "",
        "Gallery[]": "For more images of Laura, please visit Laura (TV Series)/Gallery .",
        "Trivia[]": "The casting call for this character used the name Diana . [1] [2] Originally, Laura was set to appear in two episodes only, but she was kept on as a recurring character. Laura is one of five Savior lieutenants to renounce her antagonistic ways, the others being Dwight , Eugene Porter , Arat , and D.J. Laura was the last known former Savior lieutenant to die. Laura is one of nine characters to die in the TV Series who does not die in the comics, the others being Sophia Peletier , Mikey , Carl Grimes , Paul Rovia , Siddiq , Earl Sutton , Sebastian Milton and Lance Hornsby . While not officially confirmed, Lindsley decided that Laura's neck tattoo is a meaningful symbol of her former boyfriend, who belonged to a Pacific Islander tribe. [3] Laura was in a number of deleted scenes including: [4] In \" Time for After \", after the herd breaks into the Sanctuary , Laura thinks she and everyone else are going to die, so she enters Eugene's room and tells him \"Don't think too highly of this – I'm only doing it because we're gonna die\" and they proceed to have sex. In a Season 10 episode, scenes were filmed involving Laura and Rosita killing zombies together and becoming friends, as well as a scene where Laura saves Rosita's life in \"Stalker\". She is the one who gave Negan his infamous baseball bat dubbed as Lucille . Aside from Negan himself, she is the first member of what would later become the Saviors. Originally, Dwight was set to appear in \" Here's Negan \", but due to conflict with the Fear the Walking Dead filming schedule, the actor was unable to film. As a result, Laura was brought back since she was the most sympathetic former Savior and her backstory as part of a mobile medical unit made the most sense with her character. Laura appears in the final flashbacks of the last episode \" Rest in Peace \"",
        "References[]": ""
    }
]