[
    {
        "Licari": "",
        "Overview[]": "Licari initially is shown to be an aggressive man and is one of the most physically imposing cops at the Hospital . He attempts to rescue his fellow cops, Bob and Amanda , from Rick 's group by firing at them and almost kills Daryl by holding him near walkers. However, the group manages to capture him. It's shown that Licari is actually a reasonable and honorable person, willing to go along with Rick's deal to help get Carol and Beth back. He also states that he doesn't support Dawn 's leadership. He even goes as far as be willing to lie about Bob's fate, saying he was killed by walkers when he was actually killed by Rick.",
        "Pre-Apocalypse[]": "Nothing is known about Licari's life prior to or as the outbreak began, except that he was an officer for the Atlanta Police Department .",
        "Post-Apocalypse[]": "After Officer Amanda Shepherd and Sergeant Bob Lamson are captured by survivors Rick Grimes , Daryl Dixon , Noah , Tyreese Williams , and Sasha Williams , Officer Licari shows up to the rescue in his car, firing at Rick's group, allowing Shepherd and Lamson to escape in the vehicle. However, Sasha is able to shoot out one of the tires, disabling the vehicle a short distance away. While Shepherd and Lamson flee, Licari retreats into a nearby trailer and attacks Daryl as he investigates the crash site. The two men get into a fight, with Licari choking Daryl until he receives a blow to the head with a skull Daryl rips off of a nearby zombie burnt to the ground. Before Licari can recuperate, Rick holds him at gunpoint. Licari, along with the re-captured Lamson and Shepherd, are brought inside a building overseeing the FEMA evacuation site. He and the other officers attempt to persuade Rick's group to let them go in exchange for Beth Greene and Carol Peletier , who are in the possession of the hospital and whom Rick's group are trying to rescue, but are unsuccessful. He is then tied to a post in the building, separated from Shepherd and Lamson. After Lamson, who attempted to escape back to the hospital, is killed by Rick, Licari agrees to support the group's exchange plan and claim Lamson was eaten by walkers. Licari remains in captivity until he is brought to the hospital to complete the trade. True to his word, Licari tells his lieutenant Dawn Lerner that walkers killed Lamson, and is turned over to the other officers. After he witnesses the deaths of Dawn and Beth, he remains behind at the hospital (which is now apparently under Shepherd's leadership) with Dr. Steven Edwards , the patients, and the other officers. With the multi-year time skip, the community of survivors at Grady Memorial eventually fell and everyone was killed, including Licari. [1]",
        "Death[]": "Killed By Unknown causes At some point, Licari and all the other Grady Memorial residents died due to unknown causes.",
        "Killed Victims[]": "This list shows the victims Officer Licari has killed: Numerous counts of zombies",
        "Appearances[]": "\" Crossed \" \" Coda \"",
        "Trivia[]": "",
        "References[]": ""
    }
]