[
    {
        "Rose": "",
        "Overview[]": "Rose is a brave and good-hearted soldier. After Mercer rebels against the Pamela , Rose is among those to remain loyal to him. He helps Mercer get Eugene to hiding and covers for them, despite the high risk. When faced with being arrested, Rose was shown to have no problems fighting back, despite Vickers stating anyone who who rebels will be given life in prison or death. He later helps Mercer and the group to fight back against Pamela, who had left thousands out to die to a large herd of walkers.",
        "Pre-Apocalypse[]": "Nothing is known about Rose's life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "At some point during the outbreak, Rose joined a community in Ohio. Yumiko and Max sit in an empty apartment when a knock sounds at the door. Much to their surprise and relief, Mercer is on the other side with Eugene . Eugene hugs Max, explaining that he's alright thanks to Mercer. Mercer explains that he didn't tell them his plans as it was safer for everyone. Eugene notes that Mercer has joined a long line of people who have saved Eugene's life through the years, and he promises to never forget it. Yumiko asks about their next move and if it's for them to try to leave. However, Mercer orders them to lay low instead and Max and Yumiko insist that they can help. Although they lost in court, they were heard, and the people are angry. They just need to push the Commonwealth residents past the tipping point to get them rise up against Pamela's corrupt regime. Mercer acknowledges this, stating that first he needs to gather enough troops willing to make a move on Pamela, but if Yumiko and Max can keep the public fired up, it may give them enough cover to put things in place. Eugene asks how he can help, but Mercer orders Eugene to stay in the apartment out of sight. As radio calls go out looking for Mercer, Lieutenant Rose knocks on the door with the warning that they are out of time. Rose blatantly lies over the radio that he doesn't see Mercer who is currently taking a statement from a potential witness, promising to send Mercer their way as soon as he comes back. With a reminder to Eugene to stay out of sight, Mercer leaves with Yumiko and Max to \"get this dog and pony show started.\" Once they leave, Eugene locks the door behind them. Later, as Mercer and Colonel Vickers interrogate Yumiko, a confused Rose interrupts with the news that someone named Aurora is trying to raise Mercer on the radio and he states that he will take it in his office, dismissing Yumiko and Vickers. As Mercer's forces prepare to fight an incoming herd , Rose is amongst the forces getting ready outside of the police station. Spotting a patrolling Vickers nearby, Mercer sends Rose to distract her so that he can talk to his sister . While the Coalition forces try to figure out a way past the guards on Tunnel H, Rose calls in with orders from Mercer for the guards to report to the East Gate immediately to deal with the incoming herd. Rose confirms that that includes Tunnel H and he reassures the soldiers that the tunnel is locked, and they've got it covered on the other end. Complying with his orders, the guards move out. As Mercer gives orders to his men, Vickers arrives with some of Pamela's private forces, announcing that Mercer is under arrest for treason. As Mercer's men move to defend their general, Vickers warns that any resistance will be met with life in prison or death. Mercer orders Rose and his men to lower their weapons and agrees to go, but he tells Vickers that she needs to fortify the city's defenses before the herd reaches the perimeter. Vickers tells Mercer that Pamela insists that the walls will hold, but Mercer tries to warn his former subordinate that there's something strange going on outside and she has to listen to him because this is bigger than Pamela's bullshit. Mercer is led away, calling to Vickers that she has to stop the dead before it's too late. Rose arrives at the Estates in a truck and informs Mercer that they're all set and Tomi is set up at a safe house so he can take care of Judith . Meanwhile, Pamela and her men are shooting anyone who tries to get into the Estates to escape the herd. Mercer, Rose, and the rest of his troopers arrive and enter into a standoff with Vickers and her men. Pamela orders for their arrest, right before the Coalition arrives. Vickers relents after realizing that Daryl is right that they're all on the same side. Vickers defers to Mercer who places Pamela under arrest for high crimes against the Commonwealth. He then helps with the plan to clear the large herd of walkers.",
        "Killed Victims[]": "This list shows the victims Rose has killed: Numerous counts of zombies",
        "Appearances[]": "\" Family \" \" Rest in Peace \""
    }
]