[
    {
        "Overview[]": "Of the kids in Jocelyn 's group , Linus appears to be one of the most brutal and aggressive among them. Due to being taught to be ruthless killer by Jocelyn, Linus shows no remorse for the pain he causes others. He burns Daryl by marking him and later is ordered to kill Michonne . In both fights against Michonne, Linus aims for her stomach, full-well knowing that Michonne is pregnant. In the end, Michonne is forced to kill Linus and the other kids, seeing that they are beyond redemption.",
        "Pre-Apocalypse[]": "Nothing is known about Linus' life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "In a flashback, Linus and the rest of his group are found hiding in a factory by Michonne and a group from Alexandria. They are then brought to the community. At night, Linus and the rest of Jocelyn's kid group enjoys a bonfire with the community kids. In the middle of the night, Jocelyn and her group kidnap Judith and other children, kill a resident, and leave with the food supply and guns. The next day, Michonne and Daryl spot one of Jocelyn's kids outside of an abandoned school. They chase him until they're met by all of the kids In a hallway. Daryl gets shot in the shoulder with an arrow while Linus knocks Michonne unconscious. Sometime later, they wake up bloodied and tied to a pipe. Linus painfully brands an iron X on Daryl and Jocelyn tells Michonne the kids can't be soft. Winnie then brands Michonne as she shrieks in pain. However, Michonne and Daryl manage to get free. Michonne finds an exit and is immediately beaten over and over with a wooden plank by Jocelyn. Michonne summons the strength to stab her in her leg and the chest, killing her. Michonne gets up and tells the kids they can all return to Alexandria, but Mitchell instructs the kids to kill the Alexandrians as he deals with her. She's forced to kill him as the other kids close in. Michonne begs the kids to stop but they all attack her and she's forced to kill them, including Linus.",
        "Death[]": "Killed By Michonne Grimes Linus tries to attack Michonne, but is stabbed by her in the process. Michonne Grimes or Daryl Dixon (Before Reanimation, Assumed) He is presumably put down before reanimation by either Michonne or Daryl once the fight is over and the Alexandria kids are safe.",
        "Killed Victims[]": "This list shows the victims Linus has killed: Russ (Alongside the rest of his group) Possibly numerous counts of zombies and unnamed people",
        "Appearances[]": "",
        "Trivia[]": "",
        "Name": "Linus"
    }
]