[
    {
        "Lisa": "",
        "Fate": "",
        "Contents": "",
        "Pre-Apocalypse[]": "Nothing is known about Lisa's life prior to or as the outbreak began, except that she was married to Virgil and presumably had two children, Jasmine and possibly Bobby .",
        "Post-Apocalypse[]": "At some point after the outbreak, Lisa and her family settled in a naval base on Bloodsworth Island in Tangier's Sound in Chesapeake Bay. Fortunately, the island began to thrive as a community for survivors, until their way of life was disrupted when an unknown group invaded and brought violence and sickness, which resulted in the deaths of many of the islanders including Lisa. After riots broke out, Virgil locked everyone inside the building in an attempt to stop the rioting. However, he unknowingly also locked his family in there, including Lisa. Seeing as there was no escaping, Lisa hung her children and then herself. Her walker self is later found by Michonne , who puts her down.",
        "Death[]": "Killed By Virgil (Caused, Accidental) Herself (Alive, Suicide) When a riot broke out at the research facility over the food rations, Virgil locked everyone inside, not knowing his wife and children were there. With no hope of escape, Lisa hanged herself alongside her children and many other survivors. Michonne Grimes (Zombified) At Virgil's request, a zombified Lisa is stabbed in the head by Michonne.",
        "Killed Victims[]": "This list shows the victims Lisa has killed: Herself (Alive, Suicide) Possibly numerous counts of zombies",
        "Relationships[]": "Bloodsworth Island Virgil - Husband and Accidental Caused Killer Jasmine †- Daughter Bobby † - Son",
        "Appearances[]": "\" What We Become \" (Zombified)",
        "Trivia[]": "Denisha Gillespie also serves as the main stunt double for Iris Bennett in World Beyond . She, along with Bobby and Jasmine , are the last named people that Michonne has killed, zombified or otherwise, in the TV series before her departure from the show."
    }
]