[
    {
        "Lizzie Samuels": "Lizzie Samuels",
        "Overview[]": "Lizzie is seen to be a disturbed young girl, unable to completely come to terms with the world around her. Though she tries her hardest to be polite and altruistic, Lizzie nonetheless is prone to acts such as lashing out at people and torturing animals. She is often pessimistic, frequently assuming absent people (such as Daryl Dixon and Sasha Williams ) to be dead. While Lizzie can also be seen exhibiting normal childlike happiness and playfulness, these moments quickly give way to her character's increasingly dark turn throughout the fourth season. Lizzie's most notable quality is her obsession with the 'walkers'; she sees them as being \"just different,\" and thus not a threat to humans. She shares an eerie connection with them, naming them, describing them as her \"friends,\" and saying that she can \"hear them\" talking to her. Lizzie most likely is mentally ill in some capacity, as evidenced by the fact that Carol is aware of her coping mechanism (looking at the flowers when she's feeling upset). Interestingly, she seems to \"flip-flop\" her position on walkers; sometimes she recognizes that they're dangerous and attempts to keep herself and others away from them without hurting them, and other times she sees them as friends at best, harmless presences at worst. (She leans strongly towards the latter policy after her father's death and the downfall of the Prison.) In \" Internment ,\" Lizzie appeared to be fascinated with a pool of congealed blood for some reason. This was also a case where she had attempted to help by leading the reanimated Henry away, but seemed stunned that he had tried to hurt her as she thought he was listening to her. In the end, Lizzie was a very disturbed girl, suffering from severe psychological problems. She showed no remorse or insight in killing Mika or the near killing of Judith. In another case, Lizzie appeared to consider suffocating Judith Grimes to stop her from crying and appeared to be in an almost trance-like state as she did it, not reacting at all to her sister's cries for help from directly behind her.",
        "Pre-Apocalypse[]": "Very little is known about Lizzie's life prior to or as the outbreak began, except that she had a father, Ryan , a mother, and a younger sister, Mika . Lizzie and her family lived in Jacksonville, Florida . At some point in her childhood, she was diagnosed with a form of psychosis. Her family learned to calm Lizzie during her psychotic episodes by directing her attention to something beautiful. Mika usually used flowers as a therapeutic tool for her sister.",
        "Post-Apocalypse[]": "Lizzie and her family survived the initial outbreak , though at some point Lizzie's mother died. The death of her mother, the stress of the apocalypse, and the lack of mental health services worsened Lizzie's illness. Following the outbreak, Lizzie and her family traveled north into West Georgia . Some time between August 2011 and January 2012, Lizzie and her family arrived at the West Georgia Correctional Facility , inhabited by a group of survivors from Atlanta and Woodbury . At the prison, Lizzie and Mika grew close to Carol Peletier , the childcare taker in the prison community. Lizzie is first seen in the prison courtyard, with other children, naming the walkers on the fence, when Carl Grimes and Patrick approach them and Carl says that they shouldn't name walkers because they are not people and because they kill people. Lizzie then argues that people also kill people and they still have names. She also brings up the fact that she herself has witnessed the turning process of her mother. Lizzie accompanied Mika, Patrick and the other children for storytime and Carol's lesson on knives and how to be safe with them. Lizzie is first seen running and shouting out of the prison, notifying others for help, as walkers have breached the cell block. She is later seen when Carol brings her and her sister, Mika, to speak with Ryan, their father, before he dies and he tells Lizzie to look after her sister, before passing away causing the two girls to be saddened by the loss. At first, Lizzie wants to make sure that Ryan doesn't reanimate, but Carol ends up doing it herself, while Mika tries to calm Lizzie down. Later, the two girls are at the fences, where Carol comes to talk with them and tells the two that Ryan asked her to look after them, before telling Lizzie that she is weak. Lizzie then runs off crying because Nick the walker has been killed. At some point after that, Carol comes to the two girls again and tells Lizzie how she has to be strong, before putting a flower in the girl's hair, while Lizzie takes Carol's knife and puts it in her belt. Lizzie comes over and tells Carol that she isn't feeling well. She asks if Carol can tuck her in, but Carol realizes that she might get infected herself. Heartbroken, Carol gives her a hug and sends her inside the cellblock to find Glenn Rhee , telling her that he can tuck her in instead. After closing the door, Carol tears off her mask and begins to cry. Lizzie appears briefly at the beginning of the episode, as Carol talks to her before departing on a run with Rick Grimes . Carol tells Lizzie that she has to be strong since she will be gone and Lizzie accidentally calls Carol \"mom\". Carol makes sure that Lizzie has her knife on her at easy reach. Carol tells her to do what she has to do if a tragedy occurs. Lizzie is quarantined in Cell Block A with Luke . She saves Glenn by distracting the newly reanimated Henry away from him by calling out to him and walking down the upper-level corridor. While luring Henry, Lizzie trips and the walker falls on her, attempting to bite her, but Hershel saves her. Lizzie tells Hershel she called Henry \"nice\" and he didn't scratch Glenn so she believed him harmless. Hershel locks Lizzie in Luke's cell and lures the walkers away before killing them. As Hershel and Maggie treat Glenn, Lizzie approaches and asks if its over to which Maggie responds \"I hope so.\" As Lizzie watches them, she purposefully rubs her boot in a pool of congealed blood. Lizzie is shown to have made an almost-full recovery from the flu. When the prison assault begins, Lizzie tries to convince Mika, Molly, and Luke to be strong like Carol told them to, and not to be scared and weak. Later, she and her sister, Mika, gun down Alisha and another soldier, saving Tyreese Williams ' life. They then run back to the prison at the sight of walkers, as the bus with the survivors left them behind, with Tyreese chasing after them telling them its the wrong way. Lizzie is shown to be traveling with Tyreese, Mika, and Judith. Mika laments that she misses Carol and that she's afraid, and Lizzie tries to reassure her. During the episode, Lizzie displays some psychopathic behavior as shown when she mutilates a group of rabbits. When Tyreese leaves Mika, Lizzie, and Judith alone, Lizzie covers Judith's mouth to stop her crying and appears to be trying to smother her to death. Lizzie is so focused on the smothering that she doesn't hear Mika asking for help. Carol finds the girls and they meet up with Tyreese. Lizzie is seen talking with Carol and keeping watch, while Tyreese sleeps on the rails. Lizzie and Carol talk about Sophia , Carol's daughter. Carol then orders Lizzie to rest with Tyreese and Lizzie hugs Carol and tells her that she loves her. Lizzie stops Tyreese from killing a mutilated walker that is immobilized on the train tracks, telling him that she understands that they have to be killed sometimes, but sometimes they don't. When the five of them stumble upon a pecan grove in the woods, Tyreese and Carol go inside to clear it out, and Lizzie sullenly realizes that they will kill any Walkers that are inside. Mika chastises her, stating that they aren't people, to which Lizzie disagrees. Just then, a walker falls over a railing and begins crawling rapidly towards Lizzie. Unable to kill it, Lizzie freezes in fear with Judith in her arms. Mika shoots the walker in the head, saving their lives. Carol and Tyreese race out to check on the girls. Lizzie cries at the death of the walker, and Carol tells her to look at some nearby flowers and count to three, just as she had before Carol killed Ryan to prevent his reanimation at the prison. The next day, Carol sees Lizzie playing with a walker in the yard, whom Lizzie names 'Griselda'. She runs outside, pushes Lizzie to the side and kills it with her knife. \"She's my friend and you killed her!\" Lizzie screams. Carol tells her the walker wanted to kill Lizzie, but Lizzie refuses to listen, even asking Carol, \"How would you like it if I killed you?\", to which a shocked Carol doesn't answer. Later, Lizzie runs back to the walker that's trapped in the tracks and opens a box that contains a mouse. She picks it up by its tail and feeds it to the walker. As Mika runs up to her, she says that 'you will understand' and raises the hand to the walkers mouth in an attempt to reanimate into one. Before she can do so, a group of burned walkers begins to chase them. Mika grabs Lizzie and they run away together. The two scream, attracting the attention of Carol and Tyreese. Lizzie reluctantly kills a few of the walkers alongside Mika, Carol and Tyreese, until all of them are dead. Later, she and Mika help Carol cook pecans. As Carol and Tyreese leave them, she stabs Mika in the chest in an attempt to show Carol and Tyreese that walkers aren't different. As Carol and Tyreese return, they see her with a bloody knife in her hand, Mika dead behind her and a guiltless look on her face. Lizzie explains that they will see that for themselves and Mika won't hurt them, and that she was just about to do the same to Judith. Fearing for Judith's life, Carol talks Lizzie into giving her gun to her and convinces her to allow Tyreese to take Mika away to reanimate, although her real intention is to prevent it. After deciding with Tyreese on how to handle the situation, Carol later takes Lizzie away from the house to the grove. Along the way, Lizzie notices that Carol is upset and starts crying. Lizzie asks if Carol is mad at her for pointing her gun at Carol and Tyreese, pleading for Carol to not be mad at her. As she is crying, Carol tells Lizzie to look at the flowers. While she is, Carol takes her gun out and shoots her in the head. Tyreese and Carol then bury her in the yard of the house they were staying in. Tyreese and Carol leave yellow flowers on the graves and Carol mourns the loss of both Lizzie and Mika. Lizzie appears as a corpse in a flashback, along with her sister, Mika, about to be buried in the graves Carol dug. Lizzie, along with her sister, appears during a hallucination of Tyreese assuring him that \"It's better now\". Lizzie reappears with Mika after Tyreese has been bitten, now with their wounds (Mika with stabbing wounds and Lizzie with a gunshot wound). Finally, during the car journey at the end of the episode, Lizzie along with Mika, Bob, and Beth appear smiling and reassuring him that everything is going to be okay. Carol looks at the cover of a textbook and hallucinates seeing herself at the head of a table with Lizzie, Sophia , Mika , Sam , and Henry with blood over their necks sitting around the table.",
        "Death[]": "Killed By Carol Peletier After realizing that no one is safe around Lizzie due to her inability to perceive the difference between the living and the dead, Carol takes Lizzie out under the ruse of picking flowers for her sister Mika. Lizzie begins to cry, believing Carol is mad at her for pointing a gun at her earlier. In order to calm her down, an emotional distraught Carol tells her to \"look at the flowers\", then lifts her gun and fires a fatal shot into the back of Lizzie's head, killing her.",
        "Killed Victims[]": "This list shows the victims Lizzie has killed: Alisha Mika Samuels (Alive) 1 unnamed member of the Governor's militia (Alive) Several animals (Caused and Direct) A few zombies",
        "Appearances[]": "",
        "Trivia[]": "Lizzie is the first child to become an antagonist in the TV series . Lizzie was shown to have mental instability and adjustment issues: She named and talked to the walkers at the fence, insisting that they are still people and that they just wanted a friend. She fed live rats to walkers. The feeder was unknown for a long time, but Tyreese confirmed that Lizzie confessed to it, who claimed to be 'just having fun'. A small dissected animal was found tied to a board in the prison, and it was later found that it was Lizzie's work. She seemingly tries to suffocate Judith by blocking her mouth and nose as she cried. She also tried to kill Judith again shortly after Mika's death, but Carol and Tyreese arrive in time to stop her. On both occasions, Carol stopped her from killing Judith. She admitted to Carol that she didn't mean to shoot Alisha in the head because she wanted her to be able to come back as a walker. She allowed a walker to chase her and flies into a rage when Carol killed it. She insists she was playing with it and that it wouldn't hurt her because it just wanted a friend, as with the walkers at the prison fences. She showed a symptom of psychosis when she admitted to her sister that she can \"hear them\" while looking at an incapacitated walker, explaining why she understands them. She then almost allowed herself to be bitten to \"change\". Her actions also indicated she may be a amoral sociopath who suffers from delusions which might be caused and influenced by the outbreak and the survivors she'd been around. She murdered her sister Mika to show Carol and Tyreese that when she came back she will be the same, similar to when Ben murdered Billy in Issue 61 of the comic series for the same reason. After murdering her sister, she assumed that the reason Carol wanted to talk to her in private is because she is mad that Lizzie pointed a gun at her, rather than because she murdered her own sister and was going to do the same to Judith. Her family seemed to be aware of her mental health instability. This is shown not only by Mika's conversations with Carol, but also by the fact that every time she had a breakdown, her sister told her to look at the flowers, to see something beautiful, which was a type of anesthesia for her anger and pain. Ironically, nearly every person that she indicated to want them to turn, either by mentioning it indirectly (Alisha) or indicating it in a breakdown (Ryan, Mika, Judith), ended up not turning, even the ones that were already undead (Nick, Griselda). Out of all those people, the only one that survived her murder attempts is Judith, the only one whom she tried to kill twice. The only person she intended to kill and did reanimate was the unnamed soldier . Lizzie's character mirrored many traits of the comic series character Ben . Lizzie had several qualities that make her distinctly different from her sister: Lizzie had no difficulty killing living things, including people, but was unable to kill the undead or people who will soon reanimate, while Mika would only kill the undead. While younger, Mika was more rational and mature than Lizzie. Lizzie often ran directly into danger, while Mika usually preferred to run away from it. This may not have been overseen as brave nor mature, while she was still as childish as her sister. Lizzie was often pedantic and irrational, especially in regards to the idea of killing walkers, while Mika was usually calm and level-headed until she and those around her were put in danger. It is unclear if she was truly sick with the flu. She may have faked her sickness so she could watch the other survivors turn. Lizzie's behavior and death is similar to that of Lennie from \" Of Mice and Men \" Lizzie was very mentally disturbed with difficulty understanding reality. Lennie had a learning disability, with a limited understanding of the world. Lizzie was responsible for the death of Mika, like Lennie being responsible for the death of Curley's wife (albeit Curley's wife's death was an accident). Carol made sure to comfort Lizzie before her death, telling her to \"Look at the flowers\", similar to how George retold the future of their farm with the rabbits being the thing Lennie talked of most frequently. Lizzie was also shot in the back of the head by Carol from behind whilst in some sort of comfort by their executioner, similar to how George shot Lenny in the back of the head whilst telling him the future of their farm. Lizzie is one of ten kids/teens in The Walking Dead franchise to later become an antagonist , the others being Ben , Gill , Ron Anderson , Christopher Manawa , Marlon , Minerva , Gage , Dakota , and Mason Beale . Lizzie's murder of her sister Mika in \" The Grove \" is an example of sororicide, and is one of the instances of someone killing a living family member in the TV Series , along with Mr. Siggard killing his wife (aftermath shown in \" Days Gone Bye \"), a mother killing her two infected children (aftermath shown in \" Claimed \"), Dee killing her husband (shown in a flashback in \" Omega \"), and Mays' brother killing his daughter and wife (confirmed in \" One More \"), and Pope killing his dog (mentioned in \" For Blood \"). Alpha also attempted to commit filicide by murdering her daughter in \" Walk With Us \". Lizzie appears in the final flashbacks of the last episode \" Rest in Peace \".",
        "Name": "Lizzie Samuels"
    }
]