[
    {
        "Louise Bush": "",
        "Pre-Apocalypse[]": "Louise Bush was a neighbor who knew the Greene family well. She owned a farm up the road from Hershel's farm, where she grew mostly sweet corn. She also worked at the nearby bar, The Carriage Bar , on the weekends. At some point during the outbreak, she became infected, died, reanimated as a walker, and wandered onto Hershel's farm.",
        "Post-Apocalypse[]": "Jimmy found Louise and another walker stuck in the mud of a creekbed, so he, Hershel , and Rick captured the pair with snare poles and brought them to just outside of the barn, where Hershel had kept numerous other walkers that had been captured in the same manner. However, the Atlanta survivors soon then shot and killed all of the walkers, including Louise, who was used as an example by Shane Walsh to prove to Hershel that the walkers are not living beings. Shane shot Louise eight times in the chest to prove his point before shooting her in the head. Louise's body was seen at the beginning of the episode lying dead on the ground. Later, her corpse was burned with all of the other walker remains in a big gasoline-soaked pile. While discussing the barn massacre with Rick, Hershel tells Rick that it was seeing Louise get shot so many times and keep coming that caused him to realize that walkers weren't sick as he had previously believed and were in fact reanimated corpses.",
        "Death[]": "Killed By Unknown Cause (Alive) It is unknown how she died. At some point, a zombified Louise is found stuck in a muddy creek bed and is captured by Jimmy, Rick, and Hershel to be placed inside the barn. Shane Walsh (Zombified) While Hershel holds her with the noose of a snare pole, Shane shots her in the chest multiple times as a demonstration that walkers are not living people and then shots her in the head.",
        "Killed Victims[]": "This list shows the victims Louise has killed: Possibly a few zombies",
        "Appearances[]": "\" Pretty Much Dead Already \" (Zombified) \" Nebraska \" (Corpse) \" Rest in Peace \" (Archive Footage)",
        "Trivia[]": "Louise appears in the final flashbacks of the last episode \" Rest in Peace \"."
    }
]