[
    {
        "Lucille Smith": "",
        "Overview[]": "Lucille is the caring, lighthearted wife of Negan . Before the apocalypse, Lucille and Negan had a very loving relationship. However, one day a man was being rude to her, prompting Negan to assault the man which would lead to him losing his job. Saddened by that, Negan would frequently stay at home and be a burden on Lucille, spending more money that they could afford, such as buying an expensive jacket. Lucille gradually begins to lose her patience with Negan but tries to give him a chance. However, she hits her breaking point when not only she finds out she has cancer, but also that Negan is cheating on her with her friend, Janine . When Negan arrives home, she contemplates killing him, but goes against it. Once Negan figures out she has cancer, he breaks up with Janine. Shortly after Lucille's diagnosis, the outbreak began, but her relationship with Negan is seemingly rekindled. Knowing her time is short, she tries to enjoy herself as much as she can with Negan, watching movies, reading books, and singing songs together. After the chemo for her cancer is ruined, Negan ventures out to go find some for her, despite her insistence not to. Seeing herself as a burden to Negan, she kills herself to set him free from responsibility. Years after her death, Negan still mourns her. He decided to name his bat after her and treat with care, even referring to it as \"her.\" When Negan is exiled from Alexandria, he reflects on his time with her and gives her a proper goodbye and burns Lucille.",
        "Pre-Apocalypse[]": "Lucille lived in Alexandria, Virginia prior to the outbreak and was best friends with Janine . When she was young, Lucille met Negan Smith , a local high school gym teacher. Despite his reckless and immature nature, she fell in love and later married him. They were both fans of the country musician Half Moon , heavy metal band Iron Maiden, and singer Joe Cocker; with \"You Are So Beautiful\" being their favorite song. Although they desired to have a child together, they never managed to start a family. [1] Lucille and Negan frequented at a local bar, which contained a jukebox that had Joe Cocker's \"You Are So Beautiful\". While playing one night, a drunken patron became loud and distracting. Lucille asked the man to be quiet and asked for fifty cents to play the song again. The man was rude to Lucille, causing Negan to assault and nearly beat the man to death. He then took $1 from the man's wallet and played their song twice until the police arrested him. The man was a father to a couple of students attending Negan's high school - and was thus fired from his position, charged with misdemeanor assault, sentenced to probation, and was sued by the man. Due to being unemployed, Lucille had to pay for the man's medical bills. Despite this ordeal, Lucille defended Negan's actions. Negan gradually became depressed with losing his job. In August 2010, Negan refused to go back to college and find another career, and instead went spree shopping on video games and other luxuries they couldn't afford. While playing Gears of War 2 in his basement with young kids online and being verbally obscene, Lucille discovered Negan had spent $600 on a leather jacket - causing a fight. Unable to return it because Negan threw the receipt away, Lucille hid it in the crawl space. At dinner, Lucille asked Negan to take her to the doctor for an MRI the following day. Negan claimed he was meeting with the probation officer and could not take her. Lucille went to the doctor alone and was diagnosed with pancreatic cancer. She attempted to call Negan and later Janine to drive her home due to being too emotionally unstable. Both went straight to voicemail. Lucille called Negan's probation officer and discovered their meeting wasn't for another two weeks. Looking at her call history, she realized Negan was having an affair with Janine. In her heartbreak, Lucille drove herself home. Before switching to Iron Maiden on the radio, Lucille heard reports of the Wildfire Virus spreading. That night, Lucille waited for Negan with a loaded gun. Instead of killing him, she gave him informational pamphlets and revealed she had cancer. Negan immediately broke it off with Janine and devoted his time to Lucille. The doctors revealed a chemotherapy treatment for Lucille that would hopefully clear her through the cancer.",
        "Post-Apocalypse[]": "Shortly after receiving her cancer diagnosis, the Wildfire Virus went global, causing the collapse of modern civilization. Negan and Lucille boarded up their home , installed an exterior generator, and relocated into the basement. Using the calendar the doctor gave them, Negan began to scavenge for chemo and taught himself how to administer it in Lucille. A caravan of marauding doctors occasionally came through to supply Negan with the chemo. Seven months into the outbreak, with only a few chemo treatments left, the generator attracted a Walker. He turned the generator off in order to make the Walker lose interest, forgoing him and Lucille watching a James Bond movie while she received her chemo. Negan attempted to read Pride and Prejudice to Lucille instead, but disliked the book - prompting Negan to deal with the Walker. With Negan unable to kill it, Lucille shot it with their last bullet. Negan went scavenging for gasoline and supplies, and found a stash of marijuana to help with her nausea. Lucille feared that living in isolation was too dangerous and that they needed to move and find people. Negan argued that the outside was too dangerous for them to travel in her condition, and that when her treatment was over they could go out. With the generator off, Negan cuddled Lucille at night to keep her warm while singing their song, \"You Are So Beautiful.\" The next day, they tried on Lucille's wigs and played darts while she received her chemo. That night, the generator attracted another walker. Lucille, preparing dinner, assured Negan that it was okay to kill them, but Negan feared that he would get used to it and instead turned off the generator. After eating cooked dog food for dinner, Lucille surprised Negan with the leather jacket they fought about before the apocalypse as an impromptu anniversary gift and apologized for fighting about it. Negan insisted that he was a bad husband, but Lucille assured him that she always saw the best of him and stuck around for that reason. They then smoked the pot and had sex that night. However, Negan forgot to turn the generator back on before falling asleep, causing the chemo to get ruined. While trying to figure out where to find more chemo, Lucille revealed to him that she knew about the affair with Janine, and that she forgives him because he made up for it in the past seven months. With Lucille accepting of her death, she asked Negan to just stay home with her in her last months. Negan refused and set out to find more supplies. Between having no hope of recovering from her cancer and wanting to save her husband by setting him free of his responsibilities, Lucille decided to kill herself. She wrote a note on the door asking Negan to not leave her as a walker. Lucille then ingested an overdose of medication, tied a plastic bag around her head, and cuffed her left hand to the bed. She died and later reanimated. Meanwhile, for six weeks, Negan searched for marauding doctors for supplies. During this time, he broke his hammer using it against a walker. He then used his empty gun for show. Low on energy, he finally found the marauding doctors, Franklin and his daughter, Laura and attempted to rob them. Laura, however, knocked him out with a wooden baseball bat . Franklin handcuffed him in the medical trailer and treated his fatigue, while Laura went to their warehouse to find the supplies on Negan's list. Franklin and Laura then supplied Negan with the chemo and sent him on his way, with Laura giving him her wooden baseball bat. Three days later, however, on his way back, he was captured by a gang calling themselves Valak's Vipers and taken to a roadhouse. Their leader, Craven , then tortured Negan looking for information on the source of the chemo. He tried to distract Craven with his life story while he unscrewed the screw on the chair he was tied to. Craven, however, got impatient and threatened to kill him, and by extension Lucille. Negan begrudgingly revealed the doctors' location. After acquiring Franklin, Laura, and their medical trailer Negan was released with his chemo. Negan returned home, but discovered that Lucille had killed herself. Grief-stricken, Negan was unable to put her down. Negan went outside and took the barbed-wire from his fence and wrapped it around the wooden baseball bat Laura gave him. He then doused Lucille and the house in gasoline and set the place on fire. Negan returned to the roadhouse and rescued Franklin and Laura, from the biker gang and eventually named his baseball bat \"Lucille\" in honor of his late wife. Negan Smith tells Gabriel Stokes about Lucille, calling her his one, true wife that existed before the outbreak. Negan admits his sins in cheating on Lucille and how he couldn't bring himself to kill her after she reanimated. With tears in his eyes, Negan calls his inability to kill the reanimated Lucille his one weakness. Negan tells Anne about how he named his bat after Lucille. Lucille gave him the strength to go on in the world when it fell apart, so the bat is a symbolic extension of her, as the bat gives Negan strength to carry on. Negan mentions Lucille when talking to Michonne , saying he's glad she doesn't have to see him in his cell and calling her an angel. Negan says that she deserved better than what she got. When asked by Michonne, Negan reveals that she died of cancer. Negan says that he and Lucille would have loved to have a child, one like Carl . He says that Lucille wasn't made for the apocalypse and calls her weak, and that part of him was relieved when she died, claiming it made him \"not weak\". Negan begs Maggie to kill him so that he can be with Lucille, though she refuses to do so. Negan tells Alpha about Lucille and her death from pancreatic cancer. Negan clearly still loves Lucille, stating that the cancer put a lot of things into perspective for him. After Lucille died, Negan stopped really feeling anything, but he recognizes that Alpha is only pretending not to feel. Alpha tells Negan that Lucille died of the cancer because it was what nature intended and that Lucille could not take Negan with her, but Negan lived every day wishing she could've. Negan reflects on his life before and during the outbreak when Lucille was still alive after recovering his bat. Her life and their relationship on the outset of the outbreak and months after is revealed through flashbacks. After his bat breaks, Negan finally says a proper goodbye to his wife and burns Lucille , apologizing for, amongst other things naming \"a stupid baseball bat\" after her.",
        "Death[]": "Killed By Pancreatic cancer (Caused) Negan Smith (Indirectly Caused) Herself (Suicide, Alive) Lucille developed pancreatic cancer shortly before the apocalypse. After losing the last of her chemo because Negan forgot to turn the generator back on, she accepted her death. Negan, however, vowed to find more. Lucille, between losing hope of beating her cancer and wanting to set Negan free of his responsibilities so that he could move on to find other people, chose to commit suicide the day he left. She ingested several bottles of pills before handcuffing one hand to the bed frame and tying a plastic bag around her head for her to suffocate. She had also written a message on the door begging Negan not to leave her in that state when he finds her.",
        "Killed Victims[]": "This list shows the victims Lucille has killed: Herself (Suicide, Alive) Numerous counts of zombies",
        "Quotes[]": "The following is a list of some of Lucille's most memorable quotes.",
        "Appearances[]": "\" Here's Negan \" (Flashback) \" Faith \" (Archive Footage)",
        "Trivia[]": "Lucille is one of six known cancer patients in the TV Series, along with Irma Horvath , Michael Coleman , David Chambler , Molly , and Ezekiel Sutton . Unlike her comic book counterpart who died at the very start of the apocalypse, this version of Lucille was able to survive for seven months into the apocalypse before committing suicide. When asked on the possibility of casting Lucille should the show adapt the Here's Negan special, Jeffrey Dean Morgan has said he would like for his wife and actress, Hilarie Burton Morgan , to play the role on the show. In November 2020, it was confirmed that his wife would be portraying Lucille in Season 10 - Part 3. [2] Lucille is one of the fourteen TV Series characters whose comic counterparts lack a known last name. The others being Amy Harrison , Andrea Harrison , Dale Horvath , Carol Peletier , Sophia Peletier , Tyreese Williams , Eric Raleigh , Negan Smith , Ezekiel Sutton , Yumiko Okumura , Luke Abrams , Maxxine Mercer , and Kayla Brand . She is also one of nine survivors classified as being undead, the other eight being Jim , Callaway , Pete Dolgen , Eric Raleigh , Winslow , Matias , Clara and her husband Eddie . While Duane Jones was also classified as undead at the end of the TV Series, he was finally put down in the episode \" King County \" of Fear the Walking Dead . On Talking Dead , Hilarie Burton Morgan stated that she believes that Lucille committed suicide the day Negan left to get her chemotherapy. Hilarie also reveals that she did the stunt where Negan finds Lucille with the plastic bag over her head herself and that Jeffrey Dean Morgan took a little too long removing it while shooting the scene. Lucille appears in the archive footage shown at the beginning of \" Faith \" as Judith narrates past events of the show to the audience before the episode's story begins. According to the prop medical letter used in \" Here's Negan \"; Lucille's middle name was Jane, she and Negan lived in Alexandria, and she was born on February 15, 1985. However, her birthdate is likely incorrect as Lucille does not appear to be 25 years old.",
        "References[]": ""
    }
]