[
    {
        "Mancea": "",
        "Overview[]": "Mancea is a calm and mysterious man. As the Reapers ' priest, he is very religious, often seen praying and reading the Bible. Compared to the rest of the Reapers, Mancea has been shown to be a pacifist, not once seen engaging in combat. While interacting with Gabriel Stokes , he reveals that he doesn't agree with the violence his group invokes but tries to justify it saying he doesn't question God's will. Mancea's trust in God is so great that he often doesn't fear for his life in situations where he is in danger. He has stated that he can hear God and that he guides his every step. At one point, while Gabriel is spying on the Reapers, Mancea approaches nearby and sees Gabriel. However, rather than attack him, Mancea asks God what he should do and is told that he has nothing to fear. Right before it seems Mancea might attack Gabriel, he instead thanks God before leaving the graveyard. It wouldn't be revealed that Mancea knew Gabriel was there until the next day where they confront each other. Mancea can be seen as a foil to Gabriel. Both men are priests, however, while Mancea still retains his faith in God, Gabriel is losing his. When the two meet, Mancea attempts to be peaceful with him, even putting away his weapon. When he figures out that Gabriel doesn't hear God anymore, he tries help him renew his faith. In the end, Gabriel stabs him in the stomach, going against Mancea's belief that anyone can be saved. It is ultimately unknown whether Mancea was being genuine or was trying to get Gabriel to lower his guard. However, seeing as he lowered his weapon, it may be possible that Mancea was trying to bridge the gap between Maggie 's group and the Reapers in an attempt to end the conflict with no more bloodshed. The encounter is seen to have a lasting impact on Gabriel who begins trying to regain his faith, later succeeding after joining the Commonwealth .",
        "Pre-Apocalypse[]": "Prior to the outbreak, Mancea was fighting in Afghanistan along with the rest of his squad which included a lot of members that would eventually become the Reapers . Upon returning from war, he struggled to find jobs or deal with trauma, but the relationship between him and his comrades remained strong. He then decided to become a mercenary.",
        "Post-Apocalypse[]": "During the beginning of the outbreak, as Operation Cobalt was put into action in an attempt to try and contain the undead threat, Pope and a group of his people managed to escape the bombings by running until they reached an abandoned church, where inside Pope was amazed to see none of them had been killed or injured, leading him to view him and his comrades as \"the chosen ones\". It is unknown if Mancea was present during this revelation. Regardless, he eventually joined the Reapers and became their priest. It is unknown if he took part in their attacks on those who were \"marked\" by Pope. At some point, Mancea and his group eventually attacked a group of survivors led by Maggie Rhee despite having no previous hostilities with her group and succeeded in destroying their camp and killing numerous members of her group, causing them to flee to Virginia. He and his group eventually followed them to finish them all off due to his leader, Pope marking Maggie's group. Mancea is seen praying and chanting over Michael 's body in tongues, Leah and the Reapers grieve their fallen brother; Pope demands his people to make Maggie's group feel his and God's wrath. Later he is seen reading the Bible at the bonfire. He listens to Pope's speech and witnesses him burning Bossie alive. Mancea is seen chatting with Pope as the Reapers return from their scouting mission. Mancea is seen wandering off alone in the woods, unknowingly being watched by Gabriel . He walks through a cemetery, tending to the graves of Michael Turner and Bossie. Mancea senses someone's presence and grabs his knife. Gabriel readies his machete, but Mancea leaves without incident. As Gabriel makes his way to the rooftop inside one of the Meridian 's buildings, Mancea confronts him and says that he won't let Gabriel harm any more of his flock. Gabriel is prepared to fight the priest, but Mancea reveals that he knew Gabriel was watching him at the cemetery the day before, so he is certain God will stay Gabriel's hand this time as well. He further reveals that he talks to God, and that the Lord guides his every step. Gabriel is disgusted that God would tell Mancea to protect the Reapers, whom he sees as monsters. Mancea states that, while he doesn't agree with violence, it isn't his role to question God's will. He deduces that Gabriel doesn't hear God anymore, and asks him to listen. As a show of peace, Mancea sheaths his weapon and invites Gabriel to renew his faith, and join him in his effort to create peace among their respective groups. Gabriel briefly considers this, but ultimately decides to stab Mancea in the stomach when the priest asserted no one is above saving, as Gabriel doesn't believe that anymore.",
        "Death[]": "Killed By Gabriel Stokes After discussing their different viewpoint on religion and being offered a chance to reconcile the events that have occurred, Gabriel refuses to agree with Mancea and stabs him to death with his machete. As his brain wasn't destroyed, he may have reanimated or been later put down by Maggie's group.",
        "Killed Victims[]": "This list shows the victims Mancea has killed: Ms. Adams (Possibly) Leo (Possibly) Teresa (Possibly) Numerous counts of enemy combatants (Pre-Apocalypse) Possibly unnamed Meridian residents Numerous counts of zombies and possibly unnamed people",
        "Quotes[]": "The following is a list of some of Mancea's most memorable quotes.",
        "Appearances[]": "",
        "Trivia[]": "In the Memoriam on Talking Dead for \" No Other Way \", he is credited as Reaper Preacher . Mancea is one of three Reapers to not be seen with a Reaper mask, the others being Pope and Montanio . Mancea is the oldest member of the Reapers shown on-screen."
    }
]