[
    {
        "Mara": "",
        "Fate": "",
        "Contents": "",
        "Overview[]": "Mara is a strict, irritable, and ruthless individual. She is shown to have no tolerance for those slacking off, telling Todd to pick up the pace and relieving him of duty when he talks back to her. Due to Regina being away, Mara is designated as the Acting Captain. When the Militia attacks, Mara attempts to lead the Saviors to victory. However, she ends up being outsmarted by the Militia when she starts to realize that they didn't push in on them and that they intended for the reanimated Saviors to finish the job. Mara becomes horrified at this revelation that she doesn't notice a reanimated Dino coming at her and she is bitten on the neck. Eventually the Militia is able to finish off the rest of Mara's soldiers.",
        "Pre-Apocalypse[]": "Nothing is known about Mara's life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "At some point in the apocalypse, Mara somehow came into contact with a group named \"the Saviors\" which she subsequently joined upon where she was appointed as one of Negan's personal lieutenants. Mara aided her group in terrorizing other survivors and communities around the area into subjugating to Negan's will, where their victims would be forced to give half their supplies in exchange for not being murdered. Mara is commanding a Savior outpost and orders Todd to quicken his pace while working. After talking back to her, he is dismissed and she calls over Huck to take his place at the gun maintenance station. She attempts to get in contact with some of her men and realizes something bad is happening. Suddenly, a group of Alexandrians arrive in their vehicles with improvised armor and open fire upon the Saviors. Hiding behind a car, Mara directs the Saviors defending the outpost and realizes that the militia is not advancing. Believing that the militia doesn't have the guts to come out of hiding, Mara orders her men to press the attack. As the fight continues, she notices dead Saviors reanimating and realizes that all along the militia intended for the walkers to finish the job and didn't need to press their attack. As a terrified Mara processes this, she is attacked by a zombified Dino that rips out her throat, killing her.",
        "Death[]": "Killed By The Militia (Caused; Before Reanimation or Zombified) Dino (Infected, Alive) As part of their attack on the Savior outpost commanded by Mara, the Militia kills several Saviors and allows them to reanimate to use as additional troops. Moments after Mara realizes this, one of her companions, Dino, bites her throat, before proceeding to devour her. Eventually she is put down by the Militia either before or after reanimation.",
        "Killed Victims[]": "This list shows the victims Mara has killed: Numerous counts of zombies and possibly unnamed people",
        "Relationships[]": "",
        "Appearances[]": "\" The Damned \"",
        "Trivia[]": "According to signage inside the outpost, Mara was designated as the Acting Captain while Regina was away at the Sanctuary ."
    }
]