[
    {
        "Marcus Powell": "Marcus Powell",
        "Overview[]": "Marcus is shown to be a loyal member of the Reapers , taking part in their attacks. He is a ruthless and brutal survivor who doesn't seem to have any problems with slaughtering innocent survivors. However, to his allies he appears to be a friendly and easy-going individual. He generally has a very mellow and laid-back persona, never seeming to lose his cool despite the Reapers' generally abrasive and violent nature. He befriends Daryl , with the two seen sharing cigarettes and joking around with each other, which is in contrast to Reapers like Brandon Carver , who are more aggressive and hostile towards Daryl. However, Marcus' trusting nature is ultimately misplaced since his friendship is just a ruse by Daryl since he is in charge of guarding the food shed. Eventually, Daryl catches Marcus on his own and offers him a cigarette. Daryl tricks Marcus by dropping the matches for Marcus to pick up, allowing Daryl to kill him while his guard is lowered.",
        "Pre-Apocalypse[]": "Prior to the outbreak, Marcus was fighting in Afghanistan along with the rest of his squad which included a lot of members that would eventually become the Reapers . Upon returning from war, he struggled to find jobs or deal with trauma, but the relationship between him and his comrades remained strong. He then decided to become a mercenary.",
        "Post-Apocalypse[]": "During the beginning of the outbreak, as Operation Cobalt was put into action in an attempt to try and contain the undead threat, Pope and a group of his people managed to escape the bombings by running until they reached an abandoned church, where inside Pope was amazed to see none of them had been killed or injured, leading him to view him and his comrades as \"the chosen ones\". It is unknown if Marcus was present during this revelation. Regardless, he eventually joined the Reapers, and either found or crafted his own mask with a wide-mouthed, jagged-toothed expression on it, and would use this mask as a scare tactic against those who were \"marked\" by Pope. At some point, Marcus and his group eventually attacked a group of survivors led by Maggie Rhee despite having no previous hostilities with her group and succeeded in destroying their camp and killing numerous members of her group, causing them to flee to Virginia. He and his group eventually followed them to finish them all off due to his leader, Pope marking Maggie's group. Powell and at least a dozen Reapers appear on a dark road adorned on both sides with bodies hanging from posts. Suddenly, the Reapers open fire on Maggie and her group, killing Roy and severely injuring Cole . As the Alexandrians flee into the woods, the Reapers chase after them. Chaos breaks out in the woods as Powell and the Reapers hunt down members of Maggie's group. The mayhem continues as either he or his comrades wind up injuring several others, including Duncan , Negan , Daryl , and Gabriel . Powell looks around an abandoned building while searching for the last survivors of the Reapers' ambush. Unbeknownst to him, Daryl throws a rock to distract Powell, allowing him to flee as Powell researches the area. As Daryl later on engages in a fight with Brandon Carver , Powell is among the Reapers to arrive as reinforcements, forcing Daryl to run off again. The next day, after Leah Shaw reunites with Dog and confronts Daryl, Powell, Carver, and several other Reapers surround him and take him captive. Brandon and Powell forcibly take Daryl back to Meridian for interrogation, and are both later seen retrieving a similarly captive Frost from his cell for similar inquisition. Powell is present at Daryl's initiation, waiting outside with all the other Reapers for the inductee to pass the test. As Pope declares Daryl \"forged by fire\", Powell and the rest of the Reapers welcome Daryl with a Latin mantra. Powell attends the fireside dinner talking with the others, where Daryl eats his first meal as a Reaper, and subsequently watches in silence as Pope burns Bossie alive, accusing him of turning his back on his brothers and letting Michael get killed. After Daryl successfully tortures Frost for information as another test by Pope, Powell is among the several Reapers who are sent out to check the house their prisoner had said Maggie and the others were hiding in. Paired up in a squad lead by Leah working alongside Daryl, Carver, Washington and Fisher , Powell is sent with the last two to breach the back entrance of the home, after which he and his squad-mates check every room in the house before declaring it \"clear\". Leah sends Washington, Powell, and Fisher to check the rest of the town, while she, Daryl, and Carver stay behind to give the building a once over. Powell returns back to Meridian at the end of the episode during nightfall, where Pope reveals he further tortured and subsequently killed a now undead Frost, claiming he \"got everything he needed out of him.\" Powell is seen exiting the food shed, as a smoking Daryl watches with Dog. In an attempt to build a deceitful connection to the person in charge of guarding Meridian's rations, Daryl asks Powell if he needs any help. Powell declines, putting a lock on the door. Daryl then offers Powell a cigarette, who accepts and thanks him for the offer. As Daryl lights it for him, the two hear the other Reapers talking in the distance, and Powell surmises that Washington and Ancheta have returned from patrol. Later that day, Powell is seen driving a truck inside Meridian. Powell is present when Pope and the rest of the Reapers are observing the herd. He later is present when Pope declares that Wells is dead. He is later seen guarding the sentry post, where Daryl joins him, claiming that Pope sent him, and offers him another cigarette. Powell accepts, and jokes about having to \"quit them again.\" Daryl then drops the matches on \"accident\", and stabs Powell through the throat when he reaches down to pick them up. His body is then immediately disposed of over the railing.",
        "Death[]": "Killed By Daryl Dixon After having \"accidentally\" dropped his matches when lighting up Powell's cigarette, Daryl stabs him in the throat.",
        "Killed Victims[]": "This list shows the victims Marcus has killed: Ms. Adams (Possibly) Leo (Possibly) Teresa (Possibly) Duncan (Possibly) Numerous counts of enemy combatants (Pre-Apocalypse) Possibly unnamed Meridian residents Numerous counts of zombies and unnamed people",
        "Appearances[]": "",
        "Trivia[]": "In the Memoriam on Talking Dead for \" For Blood \", Powell is credited as Smoking Kills Reaper . Before Powell died he mentioned how he used to be addicted to smoking cigarettes, likely before the apocalypse, and how he would need to re-quit it now that he's been smoking so much with Daryl. Although never mentioned in the show, Eric LeBlanc confirmed Powell's first name is Marcus. [1] He shares the same last name as Jake Powell from Fear the Walking Dead . In a behind the scenes exclusive, it is shown that when Daryl throws Powell over the Meridian wall, it is actually a human-sized dummy modeled after the actor. Due to dummies not falling the same way as humans, the dummy would often fall in strange ways, at one point landing in a sitting up position.",
        "References[]": "",
        "Name": "Marcus Powell"
    }
]