[
    {
        "Mariam": "Mariam",
        "Post-Apocalypse": "At some point after the end of the war , Jerry and Nabila had three children, with Mariam being the youngest. In the Kingdom, Nabila carries Mariam while she and Jerry spend time with their children. At night, Jerry carries his daughter from her crib to hold her as Nabila sleeps on their bed. Nabila carries Mariam as Ezekiel gives his speech and announces the start of the fair. In the fair, she is carried by Nabila as her parents walk around. At night, she is taken by her family to the theater to watch the movie. The next day, Mariam is carried by Nabila as Siddiq addresses the crowd about the missing attendees. Several months after the fair massacre, the Kingdommers are forced to abandon their fallen community due to an incoming blizzard and move to the Hilltop. When snow starts falling later that day, Mariam and the convoy is forced to take shelter inside the Sanctuary for the night where she and her family rest and stay warm. Later that night, the convoy leaves the factory and is forced to cross into Alpha's territory. When they encounter a frozen lake, members of the group kill walkers that emerge from the snowbanks before the whole convoy manages to escape safely across the ice where Mariam and her siblings are embraced by their parents, who are glad for their safety. The next morning, the convoy finally arrives at the Hilltop where Mariam spends time with her family in their new community. Inside the Barrington House, Mariam is held by her mother as she sits on the stairs along with Adam and a couple other caretakers. Later, Mariam is among the children and parents to be evacuated from Hilltop. However, the caravan is prevented from reaching Oceanside after reaching a roadblock consisting of a fallen tree, the doings of the Whisperers. The caravan turns back to Hilltop, along with the bodies of murdered scouts Felix and Penny . That night, she takes refuge inside Hilltop along with her mother and siblings as well as with the other children and civilians as the coalition soldiers fight against the Whisperers and their horde. Mariam is among a group of survivors consisting of Rosita, Daryl, Jerry, Nabila, Dianne, two Hilltop women, and two Alexandria soldiers trudging through the wilderness as they attempt to reach the rendezvous point to find Ezekiel, Earl, and the children, including Jerry and Nabila's kids. Due to Nabila being injured in the attack, a woman cares for Mariam and carries her as Jerry aids his injured wife. Mariam is at the rendezvous with the rest of her family recovering from the Hilltop battle and awaiting for more survivors to arrive. Mariam is among the Hilltop survivors to relocate to an abandoned hospital referred to as the \" Tower \" where she and her family, and dozens of others, seek refuge on the upper floors of the hospital. As a group of survivors enact a plan to lure the herd away, others defend the hospital from the Whisperers and snipe as many as they can from the windows. When the Whisperers eventually break into the hospital, Mariam and the others are evacuated safely from the hospital via the elevator shafts and basement tunnels. After Beta and the Whisperers are wiped out, the remaining survivors congregate in the woods where the injured are treated and families are reunited. Mariam is with her mother and siblings as Bertie greets them and chats with the family. Following the conclusion of the Whisperer War, Mariam is among the Hilltop refugees to move to Alexandria. Mariam is among the Alexandrians seeking refuge from the storm inside Aaron's house. She and the other children are watched over by Nabila when the storm begins to pick up. Later after it is revealed zombies have broken into Alexandria through fallen portions of the wall, it is decided that everyone needed to evacuate to the second floor. Mariam is grabbed by her mother and together, along with Barbara and baby Adam, they flee up the stairs to safety. Mariam sleeps soundly on her mother's shoulder as the rest of her family enjoy the Halloween festivities in the Commonwealth. Mariam and her family attend the Founders' Day celebrations in Union Square, with her being held by her mother as her siblings play at the petting zoo. Later, she and her family watch the wrestling match with Ezekiel and Carol until a zombie outbreak caused mass panic in the square. Mariam and her family follow Ezekiel through the crowd to safety. Mariam, Adam, and Socorro are found in an upside down crib, having been placed there for their safety, as the city and the Children's Home were overrun by the undead and the entire staff was killed. Fortunately Mariam and the other kids were rescued by Eugene, Rosita, and Gabriel. They are then escorted through the herd and evacuated to the Estates for safety. One year later, Mariam lives in Alexandria with her family.",
        "Relationships": "",
        "Appearances": "",
        "Gallery": "For more images of Mariam, please visit Mariam (TV Series)/Gallery .",
        "Trivia": "Mariam is the ninth known child in the TV Series born into the apocalypse, the first being Judith Grimes , the second and third being two unnamed infants living at the Kingdom, the fourth being Gracie , the fifth being Hershel Rhee , the sixth being R.J. Grimes , the seventh being her brother Ezra , the eighth being her sister Aliyah , the tenth being Adam Sutton , and the eleventh being Socorro Espinosa .",
        "Name": "Mariam"
    }
]