[
    {
        "Mark": "",
        "Overview[]": "A worker at the Sanctuary , Mark is seemingly a loyal member of the Saviors . However, he secretly defies the rules and is in a secret relationship with Amber , one of Negan 's wives. Because of this, Mark is made an example to others what happens when people break the rules and has his face burned by the iron. Mark is shown to fear Negan so much to the point of peeing his pants.",
        "Pre-Apocalypse[]": "Nothing is known about Mark's life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "At some point in the apocalypse, Mark somehow came into contact with a group named \"the Saviors\" which he subsequently joined upon where he was appointed as one of the Sanctuary guards, during where he developed a relationship with his fellow survivor Amber . Due to her mother needing medication and not being able to work, Amber volunteered to become one of Negan 's \"wives\" to get things for free to provide for her mother. However, Mark and Amber still had lingering feelings for each other. When Mark shifts his work duties to be with Amber, he is discovered by Negan and is punished for having broken the rules. He is tied to a chair near the furnace on the factory floor surrounded by the crowd of Saviors and workers. After Negan gives a speech of the rules, he presses a hot iron against Mark's face, burning the left side of it. Mark screams in agony, wets his pants, and passes out. Afterwards, Negan orders Dr. Carson to tend to Mark's injury. Having becoming trapped inside the Sanctuary, Mark helps Laura barricade a set of doors as the herd idles outside. Later as Mark and Dwight were on an upper level of the Sanctuary, Mark was pushed over the railing of a balcony and was killed. [1]",
        "Death[]": "Killed By Dwight Mark fell to his death after being pushed off a Sanctuary balcony by Dwight.",
        "Killed Victims[]": "This list shows the victims that Mark has killed: Numerous counts of zombies",
        "Appearances[]": "\" Sing Me a Song \" (No Lines) \" Time for After \" (No Lines)",
        "Trivia[]": "He is the second known victim of Negan's iron, the first one being Dwight .",
        "References[]": ""
    }
]