[
    {
        "Overview[]": "Martin is shown to be a cruel and dangerous man with a manipulative, sociopathic personality. He is shown to have the ability to talk himself out of trouble and appears to be highly intelligent. Martin appears to not be above committing cold blooded murder as shown when he nearly killed Judith in order to escape from Tyreese, and also suggesting they kill Bob after he taunted him and his group about his bite and also showed a desire to kill the members of Rick's group in the church. He is also shown to be brave to an extent as well as he shows no fear after being captured by Carol and Tyreese and before his demise, he was the only member of Gareth's group to not initially surrender to Rick and his people.",
        "Pre-Apocalypse[]": "Nothing is known about Martin's life prior to or as the outbreak began. It is possible he is from Michigan as evidence of wearing a Detroit Tiger's hat. Though he stated that he would often watch football on Sundays and attended church regularly.",
        "Post-Apocalypse[]": "At some point following the outbreak, Martin arrived at the safe haven known as Terminus and joined the survivors residing there. It is unknown if he arrived before the hostile group of bandits came and took over the sanctuary and accepted cannibalism as a means of survival after the group was able to reclaim their compound or arrived following these events and simply accepted cannibalism in order to become a member of the group and not be killed himself. After hiding, Carol Peletier and Tyreese Williams come across a shack and Martin, who mentions Carl Grimes and Michonne Hawthorne as he communicates with Cynthia (another member of Terminus ) while planting fireworks. Tyreese and Carol overhear this while they get the drop on Martin, binding his hands with a seat belt in the shack as she sets off to rescue the others. Martin tells Tyreese to take a car and Judith and get out of there alive. When Tyreese turns his back to Martin when a herd of walkers approach, Martin lunges towards Judith and puts his hands around her neck, threatening to break it and orders Tyreese to go outside and face the herd of walkers. Martin hears Tyreese shouting and loud thuds against the wall as he pulls out his knife and walks towards the door. Tyreese is revealed to be alive and tackles Martin to the floor, slamming his knife hand to the ground a couple of times to make him drop it. Tyreese then punches Martin several times, saying that he won't kill him. When Rick and the others show up, Tyreese tells Carol that he killed Martin because he was threatening to kill Judith. Although Tyreese told Carol that he had killed Martin, Martin survived Tyreese's beating and reappeared after the destruction of Terminus. While Bob Stookey weeps, wandering outside the church into the surrounding forest, Martin attacks Bob and knocks him out, bringing him to a nearby camp where the remaining survivors of Terminus live. Martin can be seen among the remaining Terminus survivors cannibalizing Bob's leg along with Gareth in the final scene of this episode. Martin continues to eat Bob's leg. As Bob starts to laugh hysterically, he stares down at him as the others get up. As Bob says that he's tainted meat, Martin doesn't react, and when Theresa asks why Gareth didn't check Bob first, Martin replies because he looked fine. Later, Martin travels along with the other Hunters to the church, after Rick leads the stronger survivors out to finish off the remaining Terminants. Martin pries open the church doors and starts searching it with the others. Gareth begins to list off the names of the hiding survivors and refers Tyreese as \"Martin's good friend\", while Martin grows impatient with Gareth and asks if he is done talking. As they are about to open the door where the remaining group members are hiding, Mike and Albert are shot in the head, and Gareth gets two of his fingers shot off by Rick Grimes hiding in the shadows. As Greg and Theresa surrender, Gareth tells him that he doesn't have a choice, but Martin tells him he does. Martin then notices Abraham Ford standing next to him with weapon drawn, in which he gives up and puts down his weapon. However, Rick does not let any of them go free, and as Martin tries to escape, he is pushed against the altar rail and stabbed multiple times by Sasha . Michonne retrieves her katana from Martin's backpack. Martin and the others are later put down and buried by Tyreese. Martin appears as a hallucination after Tyreese is bitten who taunts him about his impending fate, reminding him that he knew it would be him that would be killed. Martin then scolded Tyreese for not killing him, as this lead Gareth right to his group and could have saved Bob and Beth, but Bob appears and denies Martin's accusations, saying that the walker had killed him, not Martin. As Beth , Bob , Lizzie Samuels and Mika Samuels comfort Tyreese, Martin and The Governor taunt him about his fate.",
        "Death[]": "Killed By Sasha Williams After surrendering in the church, Gareth tries getting Rick to spare them, but Rick refuses and starts to hack at Gareth with his machete. Martin tries to escape only to be pushed against the altar rail by Sasha, who proceeds to brutally stab him several times in the chest and at least one time in the neck with a knife. Tyreese Williams (Before Reanimation) Tyreese puts down Martin before he can reanimate and then buries him and the other Terminus survivors.",
        "Killed Victims[]": "This list shows the victims Martin has killed: Numerous counts of zombies and possibly unnamed people",
        "Appearances[]": "",
        "Trivia[]": "Martin is the last Terminus resident to die in the TV Series . Martin is the first named character to be killed by Sasha Williams in the TV Series .",
        "Name": "Martin"
    }
]