[
    {
        "Mary": "",
        "Fate": "",
        "Contents": "",
        "Overview[]": "When the outbreak began, Mary along with her two sons had founded Terminus so it could become a sanctuary for other survivors. However, after a group of rapists attacked, Mary along with the rest of residents became ruthless cannibals who lured survivors in so they can kill them for food. When Rick 's group arrives, she puts on the façade of a kind and polite woman. However, soon the true nature of her and the community is revealed. She later gets into a fight with Carol and is shown to be a formidable foe, but Carol manages to get the upper hand and holds Mary at gunpoint. Mary attempts to justify the actions of her group by trying to tell Carol of their traumatic experiences. Though she does show a little remorse for the her group's actions, she seems to sees it as necessary to survive and even tells Carol that she could've joined their group. Mary is seemingly accepting of her inevitable demise, telling Carol to point the gun at her head. However, Carol decides to instead leave Mary to the walkers, ironically letting the cannibal be eaten.",
        "Pre-Apocalypse[]": "Nothing is known about Mary's life prior to or as the outbreak began, except that she had two sons named Gareth and Alex .",
        "Post-Apocalypse[]": "Sometime during the apocalypse, it is implied that Mary started Terminus with her sons, to which it was originally an actual sanctuary for survivors. However, she and the other Terminus residents were eventually attacked by a violent group of men who, for unspecified reasons, killed some of the residents while at the same time imprisoning the others and raping the women, including Mary. After weeks of imprisonment, however, Mary and the others somehow turned the tables on their attackers and overpowered them, reclaiming Terminus, but their trauma at the hands of the rapists dangerously twisted all of their minds. They killed all of the rapists (most likely after torturing them) except for the leader whom they mentally (and presumably physically) tortured into insanity by locking him in a train car permanently and leaving him to rot. However, the residents decided as a result of all this that there was no good left in the world and decided that by being good people, they were making themselves vulnerable. Hence their decision to begin cannibalizing survivors who arrived for sanctuary. After Glenn , Maggie , Bob , Tara , Sasha , Abraham , Eugene , and Rosita arrive in Terminus, they encounter Mary with her back turned to them as she tends to a grill with large slabs of (presumably human) meat. She welcomes them and offers them a meal. Mary and the others of the community offer Rick , Carl , Daryl , and Michonne a meal, which she is currently cooking. However, Rick realizes that the attire of some of the residents belonged to Maggie and Glenn. He is also seen to focus on Alex's pocket. Rick quickly reaches into his pocket to pull out Glenn's pocket watch, which was given to him by Hershel. Rick holds a gun to Alex's head, interrogating him on where they'd gotten the possessions. On Gareth 's cue, his men begin to fire upon them and one bullet accidentally hits and kills Alex . Mary runs away as the battle begins. In a flashback, Mary along with Gareth and Alex as they sit inside of a boxcar, revealing that the three were in a predicament similar to Rick's group until they took back Terminus from their attackers. In the present, Mary is at the fence killing walkers while a herd approaches. Mary and the others flee from the fence, seeing the herd, and Carol destroys the large propane tank, destroying part of the fence to allow the herd to infiltrate the facility. Mary finds Carol inside of the room with candles, ordering her to turn around and drop her weapons. Carol quickly counters, leaving Mary to duck her bullets. The two struggle, and Carol comes out on top. Carol holds Mary at gunpoint, demanding to know where the group is holding Rick and the others. Mary explains that Terminus originally was a sanctuary, but it became a place where they would lure people to take their possessions and ultimately, eat them. Carol asks Mary again where Rick and the others are, and when Mary doesn't cooperate, she shoots her in the leg. Mary then tells Carol that she could've been a resident of Terminus, to which Carol responds that she could never be like that. Instead of killing her, Carol opens up the door to the outside, allowing a group of walkers to come inside to devour the crippled Mary. In a second flashback, Mary is returned to the boxcar with Gareth and Alex. It is implied that Mary was raped by the men who had overtaken Terminus.",
        "Death[]": "Killed By Carol Peletier (Caused) Zombies Carol shoots Mary in the leg and then opens a door to let in walkers to devour her. It is likely that Mary was put down, due to Gareth mentioning her death, suggesting they found her body.",
        "Killed Victims[]": "This is a list of victims that Mary has killed: Numerous counts of zombies and possibly unnamed people",
        "Relationships[]": "For a more in-depth look at Mary's relationships, read here: Mary (Terminus)/Relationships",
        "Appearances[]": "",
        "Gallery[]": "For more images of Mary, please visit Mary (Terminus)/Gallery .",
        "Trivia[]": "In \" A \" Alex refers to Mary by her name rather than calling her mom. This could be to avoid letting any newcomers know of their relationship as it could be used against them. In the episode \" Claimed \", Michonne finds an ominous painting covered in blood that heavily resembles Mary. In the episode \" Coda \", Gabriel finds a Bible at the Termites' campsite which is inscribed to \" Mary B. \", likely belonging to Mary and brought from Terminus by Gareth. In the episode \" Not Tomorrow Yet \", in Carol's list of people that she killed, she lists Mary as Candle Woman . Mary appears in the archival footage shown at the beginning of \" What's Been Lost \" as Judith narrates past events of the show to the audience before the episode's story begins."
    }
]