[
    {
        "Overview[]": "Mary is initially shown to be a selfish, cruel, and sociopathic young woman who was dedicated to the Whisperer way of life and was completely loyal to her leader, Alpha. She was shown to be very cunning and a valuable member of the group due to her ability to sniff out key locations for the walkers in order to accumulate large hordes. Her dedication to the Whisperers was so strong that she put the well-being of her own family aside in order to focus on increasing and maintaining her standing in the group. Her selfishness was evident as she showed absolutely no concern or remorse for her younger sister, Frances', suffering over having to abandon her son and Mary's nephew to the walkers on Alpha's orders and even claimed she should have left Frances for dead when her remorse threatened their place in the group, showing she was willing to do anything to maintain her position in the group. She is shown to be very capable of cold-blooded murder as seen when she fed her own sister alive to a group of walkers in order to protect Alpha, showing Mary's decent into a primitive, hardened survivor completely loyalty to the animalistic way of life of the Whisperers. Her actions and cruelty earned her the praise of Alpha and as a reward is made the third-in-command of the Whisperers. Despite her claimed lack of remorse for her sister's death, Mary appears to show some amount of guilt and anger for her actions. She also seems unnerved by the sight of all the savage murders carried out by the Whisperers and appears to be increasingly fearful of Alpha, as seen in \" What It Always Is \". After discovering that Lydia was alive, discovering Alpha's lie, Mary suffered a temporarily mental breakdown, and broke down crying, before ultimately betraying the Whisperers by giving Aaron information in exchange for details about her nephew, Adam , whom Mary gained a newfound affection for. Mary was later able to soothe Adam and displayed an obvious affection for him that caused the previously-hostile Alden to soften his attitude towards Mary. Following her betrayal of the Whisperers she has displayed a kinder side, expressing genuine remorse for her actions and her killing of her sister and gradually shows that she is a deeply traumatized young woman as a result of Alpha's mental cruelty, but is truly not a heartless monster like a majority of the Whisperers. She has even shown herself to be brave and fearless as she refuses to go with Beta after he infiltrates Alexandria to retrieve her to be killed by Alpha for her betrayal and claims she is no longer afraid of him. She even willingly allows Beta to take her in order to save Rosita 's life after Beta overpowers her, despite Rosita's initial cold treatment and distrust of her and the cruel fate that would await her at Alpha's hand had Beta succeeded in taking her. At the end of her life, Mary displays a greatly different attitude, attempting to convince Lydia to run as Alpha wants her daughter and expressing great remorse for killing Frances. Kelly realizes that Frances had in fact meant everything to Mary who states that if she had the chance to do it all over again, she never would've killed her sister. When confronted by a herd, Mary chose to risk her own life to draw them away in order to protect Alden, Kelly and Adam. This selfless act cost Mary her life when Beta found and murdered her, leaving Alden and Kelly to mourn her loss. In her last moments, Mary was openly defiant towards Beta who intended to have a zombified Mary join the herd. With her last words, Mary told Beta that she would never walk with the Whisperers again.",
        "Pre-Apocalypse[]": "Nothing is known about Mary's life prior to or as the outbreak began, except that she had a younger sister named Frances and her parents' names were John and Alice . The family lived nearby a large lake in Santa Monica where the sisters as children would ride their bicycles around it together before sundown.",
        "Post-Apocalypse[]": "In the early days of the apocalypse, Mary and Frances were trying to survive together but kept making bad decisions by letting others misguide them. At some unknown point later, they found and joined a large group of primitive survivors known as the Whisperers . Mary and her sister became adept at sniffing out locations for the dead and assisted the group in accumulating their many herds. At least 8 years into the apocalypse, her sister gave birth to a baby boy though she would eventually be forced to abandon him on Alpha 's orders. Mary and Frances accompany Beta to collect more walkers for their herds under Alpha 's orders. While luring the walkers, Mary notices Frances looking at the sun and acting odd. She tells her sister to focus and not jeopardize their place among the Whisperers. When they are corralling the herd on a field, Frances starts crying and causes some walkers to try to attack her. Beta kills them and says she will pay for this. At their camp, Mary watches as Beta throws Frances to the ground and orders a Whisperer to kill her. As she starts screaming that her son is in a better place, Alpha demands they leave her alone. Later, Mary listens as her sister screams when she is forced to talk with Alpha. Then, as Frances goes back to her sister, a Whisperer questions whether they should go back to the other communities, but Mary pulls her sister away. At night, Frances tells her sister about Alpha showing mercy and how it felt to talk with her. Mary says she should forget about her son like how Alpha sacrificed her daughter for the pack. She also hopes Frances starts behaving better. The next day, Mary follows Alpha as she leads a group of Whisperers to a field to gather more walkers. Suddenly, a satellite crashes through the sky and the herd starts to scatter. When Mary witnesses Frances attacking Alpha, she runs to save Alpha and pushes her sister to the ground to be devoured. At their camp, Alpha questions Mary on whether or not she regrets letting her sister die. She confesses she will always be loyal to Alpha. She is then sent away. That night, Alpha anoints Mary as \"Gamma\" and the group praises her. The next day, Gamma questions Beta's feelings about her. They both claim to be empty as Alpha wants. Gamma is sent on Alpha's orders to Alexandria to inform Daryl and Michonne to go to the north border, lay down their weapons, and wait for Alpha that night. Michonne asks her to call off her walkers but Gamma swears they're not theirs. She then instructs them again to go wait for Alpha at the border that night and leaves. Gamma is instructed by Alpha to take a walker and use its guts to contaminate the river where the communities take their water from. While doing her task, Gamma senses someone is watching her and then leaves. Upon arriving back at their camp, Gamma tries to look at Beta but is ignored. She then asks Alpha for another guardian when suddenly a Whisperer defies Alpha on her strategies to confront the communities instead of using the herd. Gamma then watches as Alpha slashes the man with her knife and has Beta kill him. Later that day, Gamma walks with the reanimated Whisperer. She starts having flashbacks to when she killed her sister and starts to stab repeatedly the Whisperer on its head. She ends up cutting herself and dropping her knife in the water. Aaron appears and throws some bandages. He introduces himself and tries to get her to do the same, but she picks up the bandage and runs back to the camp. After returning, Gamma confesses to Alpha that Aaron gave her gauze for her wound. Alpha shushes her and instructs her to sit, before removing Gamma's mask. They discuss sacrifices and Gamma tells her that her sacrifice was much greater, in reference to Lydia. Alpha says Aaron might be useful for her plans and they might have to wear a new mask. Gamma and Aaron meet on a bridge at one of the borders. She questions how his community is full of supplies like bread. He offers her some but she turns him down. Gamma then notices a drawing in his bag and he reveals he has a daughter named Gracie . She is surprised to hear that they have children in the community and explains that children hold you back. When Aaron asks about siblings, Gamma lies and tells him she's an only child. Later that day, Aaron tells Gamma she can keep the drawing and tries to ask about her past. When she doesn't answer, he calls her out for digging for intel and thinks he should be doing the same. He then opens up about his younger brother and tries for her to the same. Before she can give in, Gamma leaves while repeating the Whisperer motto to herself. Gamma then weeps to herself in the woods. Suddenly, a walker attacks her and she manages to kill it. She is then shocked to see Alpha standing nearby waiting. Alpha questions her about Aaron and Gamma says she learned his name and that he has a daughter. Alpha wonders if she asked about her sister's child but Gamma swears she didn't. Alpha then tells her to remove her mask and proceeds to whip her arm so she can remain strong. She goes on to tell Gamma that Aaron is tempting her with lies and she shouldn't be seduced. That night, Gamma meets with Aaron again. She hands him back Gracie's drawing and when he reaches for it, she grabs him from behind and puts a knife to his neck to question him. Suddenly, Carol emerges from the woods with her arrow pointed as Lydia also arrives. Gamma panics to see Lydia alive and runs off into the woods where she later breaks into tears due to having believed in a lost cause based on a lie. Gamma meets Aaron at the border on the bridge again and asks if the baby that was left to die outside Hilltop is still alive. When she reveals he is her nephew, Aaron says he was rescued by a family and is named Adam . She offers him information in exchange for seeing Adam. Before accepting any type of deal, Aaron makes her take off her mask and to tell the truth. Gamma says her name used to be Mary and reveals to him the location of Alpha's horde. Gamma is informed by Alpha that their enemy has crossed the border and they were heading to the National Park where the horde was located. She remains nervous as her leader assumes the enemy has sent spies beyond the border and asks if she thinks they found the horde. Alpha then orders Gamma to carry a message to their spy in Alexandria to inform them they have failed their mission. However, Gamma heads to Alexandria with other intentions. Mary arrives at Alexandria and immediately gets surrounded at spear-point by the guards. She removes her mask and explains that the Coalition group is in a cave surrounded by Alpha's horde and that they may be still alive and needing help. Gabriel questions her intentions, pointing out the horde wasn't where she told Aaron it would be. Mary argues that Alpha had moved it and insists that she wants to help. Rosita questions her motives and Mary explains that the baby left at Hilltop is her nephew and she is willing to show them the location of the cave to see him again. Before she can be allowed inside the community, Mary is knocked out unconscious by Rosita and is placed in the cell. A while later, Mary wakes up in the cell and is confronted by Gabriel and Rosita about Dante's actions, but Mary claims she wasn't involved in that. They say she has to prove she's different from the other Whisperers or she'll get killed. When Gabriel insists she is hiding something and calls for a sincere confession, Mary tearfully reveals she killed her sister for Alpha, which makes Gabriel accept her help. She is then taken to the meeting hall and tells the group everything she knows about the cave and its entrances, explaining that most of Alpha's forces are situated around the cave, so the borders are defenseless. Gabriel looks at the map and orders her to be taken back to her cell. Sometime later that day, Mary is asked by Judith about her name and time before meeting the Whisperers. She recalls that she was born in Santa Monica and that her parents' names were John and Alice, but fails to recover more memories, blaming Alpha for brainwashing her. Judith thinks that had Mary stumbled across her parents first, she would have turned out better, and claims that she doesn't look like a monster to her. When Beta attacks the community that night, he enters the basement and opens the cell as Mary claims that Alpha lied about Alexandria. He ignores her and tells her to go with him without hesitation, so her death will be painless. She moves forward and states she's not afraid of him as Laura appears from behind and threatens Beta with an axe, telling Mary to get help. Mary runs outside and yells for help when Judith invites her inside her house for safety. They hide inside a room and she watches as Judith shoots through it, managing to hit Beta in the chest. Mary tells her and R.J. to run to another room as she checks on Beta. When she tries to follow them, Beta grabs her foot and knocks her down. She then wakes up and stops Beta from killing Rosita by threatening to kill herself, saying she knows Alpha wants her alive. Having allowed herself to be captured, Mary is then escorted by Beta back to the camp when they are ambushed by the Alexandrians, forcing him to flee into the woods. She falls to her knees and eventually convinces Gabriel she hasn't betrayed them. The next day, Mary reunites with Aaron and is introduced to Gracie. Afterwards, she hops in one of the wagons towards Hilltop to see her nephew, and she and Rosita introduce themselves and shake hands. Alden and Earl are constructing defenses on the Hilltop's walls, when they spot a group of Alexandrians approaching, although neither recognize Mary. When Earl asks Aaron about this, the latter reveals Mary to be a former Whisperer that has defected, and that she wishes to see her nephew, Adam. Earl promptly shoots down this notion, not trusting Mary and being the child's adopted father. Alden agrees with Earl and assures him that they will only allow the Alexandrians to see Adam. Later, Mary spots Adam and attempts to talk to him, but is intercepted by Alden, who prevents her from doing so. Despite Mary's pleas and Aaron's attempts to reason with him, Alden remains adamant about keeping Adam separate from Mary. With the Whisperers nearing with their horde, everyone is gathered on the front lines, including Mary. Kelly puts her palms on the ground and confirms that the horde is close. Indeed, the horde soon emerges from the bushes and approaches the Hilltop. While they are momentarily halted by the electric fence, the walkers soon break through it and approach the second line of defense. Aaron orders the survivors to split ranks. The shield-wielding survivors reinforce the makeshift barbed wire fence, while the melee weapon-wielding survivors start taking out the walkers. The archers, meanwhile, stay in the back and rain arrows on the herd. Behind the herd, Beta commands the Whisperers to launch the sap they collected earlier using makeshift catapults into the front lines, drenching most of the defenders as well as the Hilltop's walls. This is followed by the Whisperers launching fire-arrows into the front lines, setting one unfortunate Hilltop resident ablaze. With no choice, the defenders begin to retreat towards the Hilltop, but are trapped when the Whisperers launch another volley of fire-arrows into the Hilltop's walls, setting the community ablaze. Mary fights alongside the Coalition to defend the Hilltop, armed with a spear. Spotting Lydia fighting, Mary tries to get her to flee, knowing that Alpha wants Lydia. However, Lydia refuses to run and hide and continues on fighting. Mary ultimately escapes the Hilltop's destruction with Alden , Kelly , and Adam . Alden, who only reluctantly allowed Mary to join them, refuses Mary's advice or help with Adam, still angry at her for her role in the Whisperers. However, Alden ultimately allows Mary to take her nephew when he can't soothe the baby. Witnessing Mary's obvious affection for Adam, Alden softens his attitude towards her and asked about Frances while the group is resting. Mary explains how Adam had meant everything to Frances while Kelly realizes that Frances meant everything to Mary. Mary expresses remorse for killing her sister, stating that if she had to do it again she wouldn't have made the same choices. As the group relaxes, Mary realizes that a herd is approaching and leads the others in running away. As Alden, Kelly and a crying Adam hide in an abandoned van, Mary refuses to get in and instead draws the walkers towards her and away from the others with a scream. Mary is able to lead the walkers to a riverside where she kills them. However, while Mary is relaxing in the aftermath of her victory, Beta suddenly stabs her in the stomach. Mary coughs and pounds against Beta without success, refusing to join the Whisperers again as part of their horde. After Mary rips off half of his walker mask, Beta brutally drags his knife upwards, disemboweling Mary and killing her. After Mary dies, Beta drags her corpse and lays her against a tree. Mary lays there dead with her eyes open while Beta waits for her to reanimate in order to lead her back to the Whisperers. After rising as a walker, Mary heads towards Beta, only to be put down by Alden with an arrow to the head. As Beta flees, Alden and Kelly are left mourning the loss of Mary. After being mortally wounded by Daryl , Beta flashes back on his life as a Whisperer, including killing Mary.",
        "Death[]": "Killed By Beta (Alive) Beta finds a distracted Mary and stabs her in the stomach. As she struggles for her life and partially rips his mask, he guts her, resulting in her death. He then drags her dead body and props her up against a tree so that she can reanimate. Alden (Zombified) Shortly after Mary reanimates, she is shot in the head with an arrow by Alden.",
        "Killed Victims[]": "This list shows the victims Mary has killed: Frances (Caused) Cheryl (Indirectly Caused) 4 unnamed campers (Possibly, Caused or Direct) At least 1 unnamed Whisperer (Zombified) 1 unnamed Alexandria resident (Possibly, Directly or Indirectly Caused) 2 horses (Possibly, Caused or Direct) Numerous counts of zombies and unnamed people",
        "Appearances[]": "",
        "Trivia[]": "The term \"Gamma\" denotes the third most dominant role or position in a particular sphere or group. Mary is the first of the three dominant Whisperers to be named. According to a deleted scene, Mary is from California as correctly guessed by Aaron due to her accent. This is later revealed to be canon as a kept scene in \" Stalker \" confirms she is from Santa Monica, California. Like Lydia , Mary suffers from gaslighting, and doesn't remember much of her former life as a result of Alpha 's manipulation. She is one of eleven known characters to have seen Beta 's face. The other ten characters being Alpha, Lydia, Daryl , Negan Smith , Beta's best friend , a Whisperer , Daniel Salazar , Grace , Dennis Graham and Silas Plaskett with the latter four being unknowingly. Mary is mentioned by Lydia in \" Out of the Ashes \" when she reminds Aaron that he knew of at least one good Whisperer, referring to Mary. Mary is the first named character killed by Alden , albeit zombified. Mary appears in the archival footage shown at the beginning of \" A New Deal \" as Judith narrates past events of the show to the audience before the episode's story begins.",
        "Name": "Mary"
    }
]