[
    {
        "Matias": "",
        "Fate": "",
        "Contents": "",
        "Overview[]": "Matias proves to be unable to handle the stress of the apocalypse. In the basement, he begins to panic and yells loudly for someone to help them, which most likely would've attracted walkers. Matias' panicking leads to his own demise when Alpha kills him due to putting everyone at risk. However, due to no one knowing that everyone is infected, Matias reanimates and ends up killing everyone in the basement.",
        "Pre-Apocalypse[]": "Nothing is known about Matias' life prior to or as the outbreak began. It's possible he lived in the Mid-Atlantic states within the United States.",
        "Post-Apocalypse[]": "Sometime in the early days of the outbreak, Matias took shelter in an abandoned warehouse within or near Baltimore. Matias is among the survivors inside a shelter, alongside Dee and her family. After 23 days of surviving the initial outbreak, Matias plans with other survivors about sending a group to leave the shelter to look for supplies. Dee is eager to leave with the group, but her husband maintains that they stay put. After 43 days, the undead begin to overrun the outside of the building. Matias starts to have a panic attack and wants to leave the basement. Dee, knowing noise could draw them in, suffocates Matias to death by pressing down on his windpipe with her forearm, believing that he was too weak to survive this world. Later that night, unknown to the group about the virus infecting the living, a reanimated Matias begins to attack Lydia and the sleeping survivors. A bearded man intervenes after waking up to Lydia's screams, but the undead Matias bites the man's neck. Another survivor tries to throw Matias off the bearded man but instead is struck in the back with an axe by a woman, believing he was a zombie. Amidst the chaos, Matias continues to attack the survivors until everyone is dead. It is unknown if Matias was ever put down.",
        "Death[]": "Killed By Dee (Alive) In order to protect her group, Dee suffocates Matias.",
        "Killed Victims[]": "This list shows the victims Matias has killed: Rose (Infected, Caused or Direct) At least 2 unnamed survivors (Infected) Possibly a few zombies",
        "Relationships[]": "",
        "Appearances[]": "\" Omega \" (Flashback)",
        "Trivia[]": "When Matias is first seen in the opening of the episode (when he carries the camping lamp to a table), his hair is significantly shorter than his hair at the time of his death, showing how much time had passed in the warehouse, which was several weeks. Matias is one of nine survivors classified as being undead, the other eight being Jim , Callaway , Pete Dolgen , Eric Raleigh , Winslow , Lucille , Clara , and her husband Eddie . While Duane Jones was also classified as undead at the end of the TV Series, he was finally put down in the episode \" King County \" of Fear the Walking Dead . Chronologically, Matias is Alpha 's first named human kill."
    }
]