[
    {
        "Mays": "",
        "Fate": "",
        "Contents": "",
        "Overview[]": "Mays is initially shown to be a cruel and ruthless man. After he caught his brother stealing food from him, he forced him and his family to play Russian roulette in a twisted act of revenge. When given the choice between shooting himself or his family, his brother chose to kill his wife and his niece . As punishment, Mays locked his brother in the attic with his family's corpses. After this, Mays became extremely cynical and pessimistic, believing all humans to be selfish and evil. After encountering, Gabriel and Aaron , he attempts to prove his point by forcing them to also play Russian roulette. However, he finds that the two are good people who don't turn on each other. It appears Mays may be redeemable, as after some convincing he lets Gabriel and Aaron go. However, he is immediately killed by Gabriel, being seen as too dangerous to bring in to Alexandria , making it unknown if Mays would've changed his ways.",
        "Pre-Apocalypse[]": "Nothing is known about Mays' life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "Mays watches Gabriel from across the room and asks for some boar. Gabriel sits across from Mays as he eats boar. Mays tells Gabriel that he lives at the warehouse and that Gabriel and Aaron stole his boar. He reveals that he has Aaron's mace arm, then shoots at a room where he's holding Aaron. Gabriel tries to appeal to the man's faith in God, but Mays says he was merely using the Bibles for toilet paper. Mays drags Aaron out of the room and forces them to play Russian roulette. Gabriel and Aaron take turns shooting at their own heads. The chamber is empty each time. Mays explains that he killed his brother and his brother's fam ily after catching his brother stealing his food. Gabriel invites Mays to join their community. Mays agrees and cuts Aaron loose. Gabriel kills Mays with the mace attachment on Aaron's prosthetic arm and tells Aaron that they couldn't take a man who killed his brother's family. Aaron has a nightmare of being killed by members of all past antagonistic groups they'd fought against. Right before he wakes up, the moment where Mays almost made him shoot himself appears in his nightmare.",
        "Death[]": "Killed By Gabriel Stokes When he unties Aaron and introduces himself, his head is smashed in by Gabriel.",
        "Killed Victims[]": "This list shows the victims Mays has killed: His Sister-in-Law (Caused) His Niece (Caused) His Brother (Indirectly Caused) Numerous counts of zombies and unnamed people",
        "Relationships[]": "For a more in-depth look at Mays' relationships, read here: Mays (TV Series)/Relationships His Brother † - Brother, Former Ally, and Indirect Victim His Sister-in-Law † - Sister-in-Law, Former Ally, and Caused Victim His Niece † - Niece, Former Ally, and Caused Victim The Coalition Gabriel Stokes - Attempted Victim and Killer Aaron - Attempted Victim",
        "Quotes[]": "The following is a list of some of Mays' most memorable quotes.",
        "Appearances[]": "\" One More \" \" Out of the Ashes \" (Dream)",
        "Trivia[]": "He and his brother are the second set of identical twins encountered in the TV Series, the first being Hilda and Midge . He is also chronologically the last named character classified as being of miscellaneous origin to die. Chronologically, Mays is the last named character to die in Season 10 ."
    }
]