[
    {
        "Pre-Apocalypse[]": "A group of bank robbers are being pursued by cruisers containing the Linden County Sheriff's Department and King County Sheriff's Department officers. The car, with the suspects inside, speeds over the spike strip, shredding the tires. The driver loses control of the wheel and the vehicle flips off the road, rolling several times before coming to a rough stop upside down in a field. \"Holy shit,\" mutters Shane Walsh , cocking his shotgun as the officers descend on the vehicle. Rick Grimes carefully approaches the overturned car. A man emerges from the vehicle. McCoy notices that the criminal has a gun and shouts \"Gun! Gun! Gun!\". Rick yells at him to drop his pistol , but the man shoots directly at Rick and hits him in the chest. Shane shoots the gunman, killing him as Rick falls to the ground. A second man emerges from the vehicle brandishing a shotgun, but is also shot to death. \"I'm alright!\" Rick shouts, the gunman having shot his Kevlar bulletproof vest. Shane approaches Rick as he pulls himself off the ground. \"Shane, you do not tell Lori that happened! Ever!\" Rick commands Shane as he looks at his vest. Meanwhile, a third gunman unnoticed by everyone crawls out of the car and through the grass. The man fires his gun and hits Rick in the side, where his vest does not protect him. He falls to the ground bleeding as Shane shoots and kills the third man before rushing to Rick's aid. He begs for Rick to stay with him, barking at Leon Basset to call an ambulance, but Rick remains motionless. McCoy approaches Rick alongside his colleagues to make sure he is alright.",
        "Post-Apocalypse[]": "Nothing is known about McCoy life since the outbreak began. He was most likely, at the time, attempting to aid FEMA and the military in evacuating civilians, although his status is unknown.",
        "Killed Victims[]": "This list shows the victims McCoy has killed: 1 unnamed criminal (Alongside his fellow officers, Pre-Apocalypse) Possibly numerous unnamed criminals (Pre-Apocalypse) Possibly numerous counts of zombies",
        "Appearances[]": "\" Days Gone Bye \"",
        "Trivia[]": "Despite having lines, this character remains uncredited. While his name was never mentioned on-screen, his surname can be seen on his badge. McCoy one of three named characters in the TV Series whose appearance is entirely before the Trials . The other characters with this distinction are Lambert Kendal and Paula .",
        "Name": "McCoy"
    }
]