[
    {
        "Meghan Chambler": "",
        "Overview[]": "Meghan is a sweet and quiet girl. She is quite young and still retains a youthful innocence. However, she becomes traumatized after the death of her grandfather, David . She is afraid of the Governor at first, however she starts to warm up to him after he saves her life. Meghan is very playful and seems to bring out the best in the Governor, who is usually a very psychopathic and brutal man. Meghan is a very defenseless girl who is unfit to survive the apocalypse, due to never being properly taught. On multiple occasions she has had to be saved by someone and almost dies. One day, while Meghan is playing the mud, a walker emerges and her mother, Lilly , is too slow to save her. Lilly holds a dead Meghan in her arms as she shows the Governor. It's Meghan's death that turns the Governor back into his full tyrannical self and ordered the deaths of everyone in the Prison .",
        "Pre-Apocalypse[]": "Little is known about Meghan's life prior to or as the outbreak began, except that she had a grandfather, David , and that her father left the family three and a half years before the outbreak.",
        "Post-Apocalypse[]": "Meghan is living with her mother, aunt, and terminally-ill grandfather in an apartment holed up from walkers. She spends most of her time playing backgammon with her grandfather. Meghan was first seen watching the Governor from a window of an apartment building. The Governor entered the building and attempted to search for her before he was held at gunpoint by her aunt, Tara , who was revealed to have been hiding with Meghan's grandfather, David , mother, Lilly , and Tara. After being formally introduced to the Governor, Meghan began playing with David. When the Governor was receiving first aid from Lily, Meghan asked the Governor why he uses an eye-patch. He jokingly replies he's a pirate, but soon explains that he was hurt protecting someone . When the Governor returned from scavenging oxygen tanks for David, he began to teach Meghan how to play chess. She drew on an eye-patch on one of the kings, saying that it looks like the Governor. After David's death from lung cancer, Meghan was taken to his room where he soon reanimates and nearly bites her before being stopped due to the Governor's intervention. Meghan, evidently traumatized by this, grew to fear the Governor and ran from him whenever they were in the same room. When the four left to find a safer place, they made a stop to camp. When Lily asked Meghan to join them while they were eating, she instead stayed where she was, simply looking at her mother in silence. After leaving the truck, the four soon saw a group of walkers. Everyone began to flee while Meghan hesitated. The Governor was able to convince her to run into his arms, where he began to lead the others out of the woods. The Governor along with Meghan soon fell into a dugout pit with several walkers which the Governor single handedly killed. He reassured Meghan that nothing would harm her. Meghan was first seen playing chess with the Governor, and she struggled to figure out her next move. She asked him why he never lets her win. The Governor explained that, \"that wouldn't be winning.\" She asked him if she was bad and the Governor reassured her that she is not. She was seen eating dinner with her family, Brian (the Governor), and Martinez , the leader of their new camp. She later was bearing witness with the rest of the camp at the news of Martinez's death and the temporary election of Pete as the new leader. Later that night, Brian attempted to leave the camp with her, Lilly, Tara, and Alisha but their way was blocked by some walkers stuck in the mud, so they returned to camp. Meghan was later seen playing tag with Tara. She chased Tara, but eventually lost her. Meghan then saw a pair of feet behind a sheet that was being hung up to dry and she assumed it was her aunt. She pulled the sheet aside to reveal that the feet belonged to a walker, which chased her and grabbed her foot. Tara attempted to pull the walker off, but eventually The Governor shot the walker before it could grab Meghan. She runs to Lilly and cuddles with her. Before going out to barter for the prison , the Governor visited Meghan while she was playing in the mud. He talked with her a while before promising to return later that day. He embraced her fondly, and they shared a laugh at the mud she transferred onto his jacket. Sometime later while she was still playing in the mud, Meghan called for her mother, saying that an object she was digging up was too heavy. When Meghan finally pulled out the object (a sign), a walker emerged out of the mud and bit her on the shoulder before she had time to get away. Lilly shot the walker, but the damage was already done. Meghan subsequently died in her mother's arms and a devastated Lilly proceeded to take her daughter to the prison. Lilly arrived at the prison, having just witnessed Brian beheading Hershel and carried a deceased Meghan to him. The Governor and Lilly stared at each other in grief and shock before he took Meghan in his arms and then with little remorse, shot her in the head to prevent her from reanimating. It is with the death of Meghan that the Governor returned to his full tyrannical self and gave the order that brings about the end of the prison, \"KILL THEM ALL!\". Her remains were presumably devoured by walkers.",
        "Death[]": "Killed By Zombies (Alive) After Meghan finishes digging up a warning sign in the mud, a walker emerges and bites her on the shoulder. Philip Blake (Before Reanimation) Lilly carries Meghan to the prison, where the Governor unceremoniously pulls out his gun and shoots her in the head to prevent reanimation.",
        "Appearances[]": "",
        "Trivia[]": ""
    }
]