[
    {
        "Mel": "",
        "Contents": "",
        "Pre-Apocalypse[]": "Nothing is known about Mel's life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "At some point in the apocalypse, Mel somehow came into contact with a group named \"the Saviors\" which she subsequently joined. Mel aided her group in terrorizing other survivors and communities around the area into subjugating to Negan's will, where their victims would be forced to give half their supplies in exchange for not being murdered. While searching for the missing Alexandrians, Mel stands at the edge of a bridge using a set of binoculars to scope out the wooded terrain when she and her fellow Saviors get a call on the radio that Gabriel and Carson have gone missing from the Sanctuary along with Jeremy 's green Jaguar. They quickly get in their truck and drive away in search of the two missing prisoners. Later that day, the group finds the escapees in a garage and takes them into custody. When they arrive at the bullet factory outpost , Mel and Derek drop off Gabriel at the outpost as Eugene's newest worker. During the year and a half that passed since the end of the war , Mel was forced to work on the Sanctuary under Daryl 's orders. She is working in the motorcycle hangar when Laura approaches Daryl to speak with him. Later, when Rick and his Group arrive at the Sanctuary to deliver farming equipment, Mel announces Rick's arrival and then she surrounds Rick with the other residents, all pleased to see Rick Grimes visiting their community. At some point following Rick's assumed death, the Sanctuary eventually falls as a community, with most of its residents integrating into Alexandria, Hilltop, and the Kingdom, though some chose not to join any of the communities. Since then, Mel has not been seen among the communities after the Sanctuary fell, leaving her with an unknown fate.",
        "Killed Victims[]": "This list shows the victims Mel has killed: Simon (Possibly, Zombified) Possibly numerous counts of zombies and unnamed people",
        "Relationships[]": "",
        "Appearances[]": "\" Dead or Alive Or \" \" A New Beginning \"",
        "Gallery[]": "For more images of Mel, please visit Mel (TV Series)/Gallery .",
        "Trivia[]": ""
    }
]