[
    {
        "Overview[]": "Michael is a stoic, stern, stalwart, and level-headed man, who takes his job seriously as the General of the Commonwealth Army . Though he is admired and deeply respected the people of the Commonwealth , he is shown to be very humble. At the masquerade ball, he is very awkward, admitting that it's not his thing. He has a soft side to him, shown with his interactions with Princess, with the two eventually hooking up. Michael is shown to be very protective of those that he cares about, berating Max for her rogue radio, but also protecting her from discovery, having only been angry out of a concern for his sister. Michael believes in strength in numbers, shown in the team building exercise when he berates Daryl for not working as a unit with Jake Daniels . He later tells Daryl that he wants him to succeed, and it's important for them to set each other up to win. Michael is well-aware of the corruption within the Commonwealth. He kills Alves and Castle after confessing to sending 30-40 residents to their deaths for Sebastian 's money. However, due to Sebastian's high status, he is unable to report him since he could get moved for insubordination. Due to the increasing corruption, Michael has become somewhat less rigid, relying more on those that he can trust such as Daryl and Rosita over his own men that are less trustworthy. Acknowledging that the whole situation is upside down, Michael tells Rosita that he needs people like her that he can trust, but he respects that her family comes first to the point that Michael promises that if she ever wants to flee, he'll help her to do it. When Daryl sends Negan in, he is able to gain Michael's trust by revealing that Daryl had sent him and convince Michael to break the rules so that Negan can warn his friends of Lance Hornsby 's actions and the danger that they're in. Although Michael proudly states that protecting them is his job, Negan points out that he's there anyways and that if everyone else is breaking the rules, then Michael can too in this case. After Sebastian's death, Michael more or less betrays his friends in the Coalition out of a desire to protect his sister, although they are shown to be understanding of his motives and still try to get him to help. However, Michael is shown to be very conflicted in his actions, particularly after being confronted by Max and Juanita, the two people that he cares about most in the world. When asked to help in Eugene's court case, Michael refuses out of a belief that it's useless. However, possibly inspired by Eugene's speech about how one man can make a difference, Michael breaks him out of jail and joins the growing revolution. Michael subsequently reveals that he had been intending to act for at least some of the time, but had kept it a secret from Eugene and his friends so as to not risk it getting out. After being contacted by Juanita, Mercer fully revolts, helping Coalition forces sneak into the city and plotting to remove Pamela from power using the testimony of the liberated labor camp prisoners which gives Mercer the legal authority to act against her.",
        "Pre-Apocalypse[]": "Nothing is known about Michael's life prior to or as the outbreak began, except that he was from Strasburg, Pennsylvania and raised by his mother, Stephanie Mercer . Later, he had a younger sister named Maxxine . As an adult, Michael attended and graduated from the United States Military Academy at West Point and served in the Marines.",
        "Post-Apocalypse[]": "At some point during the outbreak, Michael, alongside his sister Max, joined a community in Ohio. He eventually became the general of the community's army , presumably due to his time in the Marines. Michael is present at the detainment center and attends the interviews for Ezekiel , Yumiko , Eugene , and Juanita . Ezekiel lashes out at Michael, but the Commonwealth military officer remains calm and informs Ezekiel he graduated from West Point. Michael remains at the detainment center and once all four survivors in Eugene's group passed the assessment, they were gathered in a train car and officially welcomed to the Commonwealth by Michael. He then gave the survivors instructions on what to expect regarding orientation as the train eventually made its way to the capital city. Michael is seen suspiciously watching Eugene and Stephanie from afar. He approaches the train station and Princess flirts with him as a distraction. Michael briefly engages with her, but turns stoic the more she talks. Michael busts in on Eugene and Stephanie and arrests them for unauthorized use of government property. Michael is seen escorting Sebastian and Kayla through the area Eugene's group is clearing walkers . He comments on the 'putrid' smell of the area. Later, Michael, Lance Hornsby and a group of Commonwealth soldiers quickly arrive at the scene where Sebastian and Kayla were under attack by walkers and Eugene's group saved them. Sebastian berates Michael for being absent during the situation, and accuses Eugene of attacking him and Michael questions if Eugene hit him. He does not deny it and Lance scolds him for this and they take Eugene away. Michael is seen heading a training exercise with new trainees, including Daryl and Rosita , who have signed up for the Commonwealth Army. He explains that they must work in teams of two to clear a walker-laden obstacle course. Despite Daryl's insistence that he and Rosita are a good team, Michael pairs him with fellow trainee Daniels and Rosita with fellow trainee Green . Whereas Rosita and her teammate are able to make it through the training course quickly and effectively while working together, Daryl prioritizes finishing the course swiftly over working in tandem with his partner, which results in Daniels nearly being bitten. As Daryl is about to come to his aid, Michael intervenes and shoots the walker attacking Daniels, saving his life. Daryl annoyedly protests that he was about to do so himself, to which Michael reminds him that the point of the exercise was to move fast and work as a unit. He asks Daryl to follow him for a special assignment. Michael, Daryl, and Rosita head into the woods for a training session with Sebastian. Michael releases a group of walkers for Sebastian to kill. Sebastian struggles with a walker, prompting Daryl to kill it with his crossbow. Sebastian angrily tells Daryl that he could have handled it. Pamela passes by and looks at Sebastian with disappointment. Michael advises Daryl that it's sometimes important to set each other up to win. A crowd mobs the red carpet outside the masquerade ball, including Princess and several Alexandrians and Hilltoppers, who watch as dressed up guests arrive for the ball, including Lance Hornsby and Sebastian Milton. Everyone claps and cheers as Mercer arrives. Michael chats with Princess in the crowd and invites her to join him as his party guest. Initially, the doorman refuses entry to Princess due to her name not being on the list, but Michael remains firm in his decision to bring her along. As the festivities progress, the party is interrupted when Tyler Davis begins accosting Pamela's leadership, declaring that the Commonwealth elites do not actually care for the welfare of its citizens. Michael watches in silence as Tyler supports this claim by telling the room he tried endlessly to talk with Pamela one on one, only to be routinely ignored, and that he lost his job as a trooper and place of residence after making one \"mistake\": being overpowered and beaten by a prisoner . After Tyler manages to escape the party, Sebastian furiously orders Mercer to go after him. Daryl corners Tyler inside the Haunted Maze and convinces him not to commit suicide. Sebastian follows them inside. Daryl instructs Sebastian to bring Tyler to Pamela, allowing him to take credit. Sebastian takes Tyler back to the masquerade and receives credit for Tyler's capture. \"Resist the Commonwealth! Visibility for workers! Equality for all!\" Tyler screams as he's escorted out of the room, adding that there are thousands more like him. Michael orders Rosita to interrogate Magna about Tyler. When Connie and Kelly visit the Commonwealth's hospital in an attempt to get an interview with Tyler, who is supposedly being treated for psychological issues, but are kept from entering his room by Commonwealth soldiers. Michael looks at them through the door before shutting it. Michael catches up with Connie and Kelly, and asks if Connie got everything she needed for her ride along story. Connie goes off script and demands to know what Tyler has been charged with. She also asks if Tyler is being punished for the fact that his hostage at the masquerade, Max , was Michael's sister. Mercer refuses to answer her question, and warns her not to dig any further. Later that day, when Michael returns to the hospital, he finds that Tyler is no longer in his room, his bed vacant. When he is informed by the nurse that Tyler was moved to an undisclosed location without his authorization, Michael angrily punches the wall and leaves. In a flashback, Michael discovers Max's radio while investigating a massive communications breach, the Commonwealth having learned that someone was talking to a rogue community outside of their walls and Lance Hornsby is all over it. Michael realizes that it was Max talking to Eugene and that she was planning to sneak out \" to meet some stranger at a rail yard.\" Michael warns Max that it's dangerous for everyone at the Commonwealth, but especially for the two of them. Michael leaves, telling Max that she had better pray that Lance doesn't realize that it was her voice. Michael joins Pamela's convoy as they arrive at Alexandria . Aaron gives Pamela a brief history of Alexandria. Michael asks how they keep Alexandria safe. Daryl says they fought many battles to protect it. Commonwealth troopers deliver supplies to the community. Michael notes that Daryl is starting to appreciate the Commonwealth but warns that it isn't perfect. Walkers breach the Hilltop perimeter. Maggie , Elijah , Lydia , and other Hilltop residents fight the walkers. Michael joins them with his troopers, who swiftly gun down all the walkers. Afterwards, Michael lines up his troopers. Michael reminds Daryl that he's always being watched. Daryl falls in line with the troopers. Michael and Carol rescue Daryl, Rosita, and April from the overrun mansion. After losing April to the undead, he and the rest of his group make it out alive and regroup with Troopers Alves and Castle . After the men reveal that they've sent as many as 30 to 40 people to the house to retrieve the cash, Michael shoots both of them in the head without a word. He then orders Daryl and Rosita to deliver the cash to Sebastian as planned and that he will take the cash through security as he wouldn't be searched. At the police headquarters, the three soldiers sit around when Sebastian arrives and picks up the cash. When he asks what happened to Alves and Castle, Michael nonchalantly reveals that they didn't make it back alive. Michael is shown laying in bed with Princess, who wakes up next to him and sees that he is already awake. She asks if he's okay. Michael insists he's fine. Later, while he's working out, Max confronts Michael about Sebastian's heist and asks why he's letting Sebastian get away with it. Michael points out that he could get removed for subordination if he reports Sebastian, which would leave the Commonwealth citizens vulnerable. Max says Michael has the power to change the Commonwealth . Michael doesn't listen. Outside Princess' apartment, Michael apologizes to Princess for stonewalling her. He reveals that he killed two of his men and covered it up. He says it keeps him up at night but that he would do it again. He wonders if he's part of the problem at the Commonwealth. Princess offers to figure it out together. Mercer approaches Rosita, and asks her to get into her trooper uniform, despite it being a personal day for her. He tells her that with the protests, he needs as many people as he can on duty to control the crowds. Rosita plainly tells him the protests aren't her problem, and that they shouldn't be his, either. Just then, over his radio, Mercer receives a call about a new arrival in processing that requires his immediate attention. Before leaving, Mercer tells Rosita that he and the people of the Commonwealth need her, and that she needs to \"suit up\". Mercer enters the interrogation room, meeting Negan and asks if he knows him, to which he answers that word gets around. Negan says his friend told him to ask for Mercer to find out about April. Mercer sits down and asks if he knows what happened to her. Negan says that him asking him that means it can't be good. Mercer wants to know why Negan is really there and he tells him about the trouble he's had with Hornsby and his soldiers. Mercer gets the soldier in the room to leave by asking him to get Negan water. Once he leaves, Mercer asks who sent him, and Negan answers it was Daryl. Negan says they have people to protect in the walls, which Mercer says is his job, but Negan states that he was sent anyway. Mercer brings up that there are rules and he can't just let Negan in. Negan points out that if no one else is playing by the rules why should Mercer. At the Commonwealth station , Rosita is geared up and ready to deal with the herd. Mercer comments that she made it and she sarcastically states that she couldn't resist killing walkers. They load up in the truck and drive along with three other vehicles. Mercer, Rosita, and the other Commonwealth soldiers arrive at the open field of walkers. The two trucks drive over to separate the walker herd. Rosita asks how the walkers got so close, to which Mercer says someone wasn't doing their job. Rosita says that seems to happen a lot at the Commonwealth. Mercer and Rosita have a heart to heart, in which he tells her he needs people like her on the force, people he can trust. She assures him that if he needs help outside the walls, taking on walkers, she will, but anything that goes on inside, she doesn’t want any part of it, as her daughter and family come first. Mercer says he respects that and assures her that if she ever needs help getting her family out, he will. The other troopers begin rolling out, when one of the vehicles flip, causing Rosita and Mercer to intervene. Mercer and Rosita manage to pick up one of the soldiers, however the other one gets caught by the walkers. Mercer grabs his hand and tries to break him free from the walkers' grasp. However, the walkers begin to brutally tear the soldier apart as he screams in pain, before he is completely ripped in half. A visibly traumatized Mercer looks at the walkers devouring the soldiers' remains in shock before they drive away and split the herd in two. Daryl's group is surrounded by Commonwealth soldiers , as he holds Lance hostage. Suddenly, Mercer yells for everyone to put their weapons down, as he, Pamela, Carol, and Negan arrive at the scene. Daryl pins Hornsby to a wall with his knife at his throat. Pamela orders him to lower the weapon since she needs Hornsby alive, but he refuses. Mercer also tells Daryl to lower the knife and that he's on Daryl's side. Carol steps forward and says she made a deal for them, but they need Hornsby alive. Daryl finally obliges and lets Lance go. but not without stabbing Lance's hand with his knife. Meanwhile, Mercer and Lance are out on an open field, with Lance tied up and sat down on the ground. He complains that he thinks he is sitting on an ant hill and requests to be moved. Mercer walks over to him and stand condescendingly over him. Mercer bitterly tells Lance to get used to his discomfort. Lance states that he thought they got along, but Mercer asks him how many of his men he got killed. Lance smiles as he smugly tells Mercer that they weren't actually his men. Mercer angrily grabs Lance as walkers approach. Lance tells Mercer to hop to it. Mercer goes to kill the walkers and walks away, leaving Pamela and Lance alone to talk. At the Founders Day, Mercer watches as Sebastian prepares to deliver a recorded speech to the people but Max and Eugene play Max's recording instead. The crowd turns on the Miltons and begin throwing things and trying to get onto the stage. The Commonwealth soldiers hold soldiers back, even having to resort to physical violence. Mercer tries to deescalate the situation and makes sure no one fires their weapon. Sebastian barges through the crowd going after Max as the chaos ensues. The angry crowd continues to be difficult. As Max is running away, she then sees the previously killed cleaning crew members now reanimated, causing panic amongst the citizens as they flee the scene. The walkers kill many civilians along the way. Mercer radios all units to the square and order six soldiers to come with him. Pamela protests that Mercer is supposed to protect her, but he answers that he's supposed to protect the Commonwealth. Mercer walks through the crowd and kills the walkers, with Daryl and Judith doing the same. A vengeful Sebastian attempts to murder Max by pushing her on top of one of the walkers but Eugene saves her by throwing the walker on Sebastian who is severely bitten. The walker is put down by Judith but Sebastian dies of his wounds as Mercer and the crowd looks on. Mercer is seen as Sebastian's corpse is strapped to a table in the Commonwealth morgue and, reaching for one of his blades, Mercer suggests that they should put him down. However, Pamela refuses, ordering that no one is to touch Sebastian until she says so. Addressing her son's corpse, Pamela tells Sebastian that she wasn't blind to what he was and, that despite what he thought, she was trying to help him, but she may have been too late. While they had their issues, family is a complicated thing. Pamela orders Mercer to find and arrest Eugene, intending to put him on trial for Sebastian's murder and to have him stand as an example to all of the Commonwealth. Under her orders, Mercer has his Commonwealth soldiers take in any associates of Eugene for questioning, including Rosita , Ezekiel , and Princess . Rosita sits in the interrogation room awaiting questioning. Mercer enters and reads her file and asks if the information is true. Rosita asks Mercer if he's really doing this, but Mercer doesn't answer and continues to try to follow protocol, acting as if they don't know each other, much to Rosita's disbelief. Rosita finally answers that the information is true. Mercer asks what she was doing during the riot and what she was doing with Eugene. Rosita says that she and Eugene were talking about Max, who wants to change things for the better at the Commonwealth. Mercer asks if she has seen Eugene since, which she answers she hasn't. Mercer breaks character and tells Rosita that he respects her even if she currently doesn't respect him, but he tells Rosita to tell Eugene to turn himself in to make it easier for everyone. If Rosita and her people don't cooperate, no one will be going anywhere and things will get worse. Rosita merely chuckles and leaves. At the Commonwealth police station , Mercer enters and finds Princess sitting at a table and tells her she shouldn't be there. She confronts Mercer about his men taking and questioning her for three hours. Mercer apologizes and states that he can't be seen treating her differently from everyone else. He then goes on saying that Pamela wants Eugene for Sebastian's death. Princess tries to argue but Mercer shuts her down. Princess then bluntly states they are going to kill Eugene and asks how he can be good with that since Eugene is a good person. Mercer remains firm that they have to catch Eugene and she can't change that. He says Eugene will get a trail, but Princess questions if it'll be a fair one. Mercer says nothing and Princess asks him what's the point of the Commonwealth if a good man is put to death. A soldier enters and says there was a sighting of Max. Mercer immediately takes actions and heads out to find her. Before he leaves, he tells Princess he's got to go. She then says \"Me too\" , without him hearing. Max is taken to the interrogation room where she reads a pardon. Max objects to this, but Mercer tells her she has to read it. The paper then says Max has been dealing with mental health issues which was the main cause of her actions. She gets progressively more frustrated reading through and reads it more and more aggressive until Mercer tells her to stop and sign it. Max continues to be difficult despite Mercer's insistence to take the pardon. Max declares that she did what she did because she couldn't handle being part of something so rotten. She points out that Eugene had saved her from being killed by Sebastian and refuses to let him die. Mercer reasons that he is trying to save her from being executed, but Max says she is trying to save the entire place. She then tells Mercer to speak truth no matter the cost, something their dad once said and to never forget their duty as a citizen. She then says that he would have liked Eugene and been proud of what they did, and be ashamed of Mercer. He walks away without saying a word. Mercer walks up to Princess' apartment and asks if they can talk. Princess reluctantly agrees, and invites him inside. Mercer admits he doesn't want her to leave, but Princess says that she has no choice. Mercer asks if he's the reason, which Princess is not certain about. She reassures Mercer that he's \"great\", but she does not feel comfortable staying in a place where her friend is going to be unfairly executed. Mercer explains he's doing everything in his power to make sure Eugene is not killed, but Princess voices her doubts about him doing \"everything\" to prevent it. Princess declares the Commonwealth and its politics a \"shit-show\", and while Mercer agrees neither it nor he are not perfect, compared to the world outside the walls, \"it could be a lot worse.\" Princess cuts him off angrily, and tells him her life has never been easy, even before the apocalypse. She tells Mercer that, after her father left her when she was nine, her mother remarried half a year later. Her stepfather and stepbrother were authoritative and cruel to her, yelling at and hitting her frequently, with her mother letting it happen so that they wouldn't leave. In response, Princess would act out daily to try and get them to leave and make the abuse end. Instead, her stepfather and stepbrother would tie her up, put her in a closet, and leave her there for hours at a time. This would lead to Princess soiling herself, which resulted in further beatings. And in spite of all this, Princess' mother would laud the roof over their heads and the paid bills, insisting \"it could be worse.\" \"Fuck that thinking. It could be better, too,\" Princess laments. \"It should be.\" She tells Mercer that the Commonwealth's treatment of its people reminds her of her stepfather, and that if she is made to sit around and do nothing, she is no different than her mother. And, unable to stop Pamela from giving the order, her only other option is to not be around when Eugene is killed. Mercer silently attempts to console Princess as she readies to leave once more. Princess admits that, due to the way she was traumatized, she often saw men as monsters. But she knows Mercer is not that kind of a person. Later, Eugene walks into the Commonwealth police station to turn himself in. He complies when ordered to get down on the ground, and is detained by troopers as Mercer walks up to him. Eugene stats his intention to confess the following: he secretly recorded Sebastian's rant about the Commonwealth and its true nature, he unintentionally caused Sebastian's death in the ensuing chaos, and he acted alone; Max was not involved in any of her charges. Mercer silently looks at Eugene before ordering the troopers to take Eugene into custody. In the Commonwealth, Pamela testifies at Eugene 's trial about Sebastian 's death and the impact that it had on her. Over Yumiko 's objections, Pamela calls Eugene a murderer that needs to pay, but her objections are overruled by the judge. Eugene worries about how nothing seems to be getting through to the judge, but Yumiko tells him that it's not the judge that they need to get through, but the people of the Commonwealth who are observing the trial, many of whom appear to be displeased with the proceedings and the treatment of Eugene. As Eugene looks around at the crowd, Max gives him a reassuring look. Yumiko questions Pamela about the lottery and Pamela tells her that it's about opportunity and hope for a better future, drawing angry murmurings from the watching crowd. Yumiko calls Pamela out on this as Sebastian had said that the lottery was a lie and rigged by the Governor herself. Despite the prosecutor's objections and orders to desist from the judge, Yumiko presses for an answer, reminding everyone that they all heard Sebastian on tape calling the lottery a lie. Pamela lies that it wasn't her son on the tape and that the tape was altered, causing the crowd to grow even angrier, not believing Pamela's claims. Yumiko demands to know if Pamela really wants them to believe that someone altered Sebastian's voice on the tape and Pamela places the blame on Eugene, calling him an enemy of the state who had admitted to playing the tape and causing chaos on Founder's Day, but no one in the crowd believes the governor's lies with one woman even calling for Eugene to be freed as Yumiko looks to Mercer before staring at Pamela incredulously. In the police station , Mercer issues orders for five more troops to be placed on the south perimeter. Finding Yumiko in his office, Mercer tells her that Yumiko shouldn't be here. Yumiko has come to convince Mercer to do the right thing, but Mercer simply tells her to leave, citing the fact that the judge wouldn't like Yumiko to get back late. However, Yumiko knows that it doesn't matter as they're going to lose. Yumiko's friend, the man that Mercer's sister loves, is going to die and so might Yumiko's other friends for all that she knows. Yumiko reveals that Pamela's men had taken her other friends, including Princess, to God knows where, but Mercer admits that he already knows, shocking Yumiko. Yumiko doesn't believe that Mercer doesn't care and neither does Max and they need him to testify against Pamela in public in order to save their friends and loved ones. Mercer refuses, telling Yumiko that it won't change a thing and brushes off her attempts to convince him otherwise. Furious, Yumiko storms out of Mercer's office. At the trial, the prosecution rests its case and Yumiko prepares to as well after glancing at Mercer. However, Eugene asks for permission to address the court on his own behalf over Yumiko's objections. \"The way I see it, I've been living on borrowed time for well past a decade now. And by all rights, someone like me should've met my maker on the very first day that things started to fall apart. But the thing is, I would've, were it not for the aid of friends. Friends who have not only changed me, but changed the hearts and minds of so many others. I am beyond certain that my fate will not discourage them from keeping that going, from helping others to find the courage to do what's right. I was not always a good man. Some time ago, I fell in with a posse who thrived doing some downright unseemly acts on the reg. I looked the other way. I placed value on order and safety above all other things, but I soon realized that I wasn't the one swinging the bat , I nevertheless had blood on my hands. I knew what was happening. My inaction made me culpable and I hated myself for that. So, I did something . In my own little way, I changed the world. And I learned that one person can do that, and sometimes all it takes is one person to do that,\" states Eugene with most of the court looking affected by his words. Yumiko rests her case and Eugene is found guilty of first-degree murder and sentenced to public execution in one hour, leading to outcry from the crowd watching the trial. As the soldiers and the judge struggle to restore order, Pamela leaves with a victorious smirk on her face. Eugene is led out as Max exchanges a look with her brother and Yumiko lowers her head in grief. A hooded Eugene is led from his cell by a few soldiers, presumably to face his execution. However, Eugene is brought before Mercer and released from his handcuffs. \"Time to fuck shit up,\" Mercer declares, siding with the growing rebellion against Pamela's rule over the Commonwealth. Yumiko and Max sit in an empty apartment when a knock sounds at the door. Much to their surprise and relief, Mercer is on the other side with Eugene . Eugene hugs Max, explaining that he's alright thanks to Mercer. Mercer explains that he didn't tell them his plans as it was safer for everyone. Eugene notes that Mercer has joined a long line of people who have saved Eugene's life through the years, and he promises to never forget it. Yumiko asks about their next move and if it's for them to try to leave. However, Mercer orders them to lay low instead and Max and Yumiko insist that they can help. Although they lost in court, they were heard, and the people are angry. They just need to push the Commonwealth residents past the tipping point to get them rise up against Pamela's corrupt regime. Mercer acknowledges this, stating that first he needs to gather enough troops willing to make a move on Pamela, but if Yumiko and Max can keep the public fired up, it may give them enough cover to put things in place. Eugene asks how he can help, but Mercer orders Eugene to stay in the apartment out of sight. As radio calls go out looking for Mercer, Lieutenant Rose knocks on the door with the warning that they are out of time. Rose blatantly lies over the radio that he doesn't see Mercer who is currently taking a statement from a potential witness, promising to send Mercer their way as soon as he comes back. With a reminder to Eugene to stay out of sight, Mercer leaves with Yumiko and Max to \"get this dog and pony show started.\" Once they leave, Eugene locks the door behind them. An angry crowd gathers outside of Union Station , demanding answers from the government. In her office, Pamela is furious that Mercer has no idea how Eugene got away and Mercer simply states that Eugene clearly had help. Looking towards the window, Mercer notes that a lot of people are unhappy about the guilty verdict, leaving a large possible suspect list that will take some time to narrow down. Mercer pointedly tells Pamela that there have been reports of people going missing in the Commonwealth for awhile which they don't have many answers for, but maybe they'll get lucky this time. Pamela orders Mercer to just do his job before more people get hurt and he departs without another word. Left alone, Pamela orders Colonel Vickers to keep an eye on Mercer and to begin a door-to-door search for Eugene. If Eugene is found, he is to be shot on sight. Vickers asks if Pamela wants the army to try to disperse the crowd, but Pamela refuses, stating that they'll find some bones to throw them instead and options are in place to deal with it if things escalate. Once Vickers is gone, Pamela grabs a radio and simply orders \"B17.\" In Mercer's office at the Police Department of the Commonwealth Army , Yumiko is interrogated by Mercer and Vickers about Eugene's escape. Yumiko plays along with Mercer's questions while defiantly telling Vickers that if she knew where Eugene was, she'd be with him rather than being interrogated by the two. A confused Lieutenant Rose interrupts with the news that someone named Aurora is trying to raise Mercer on the radio and he states that he will take it in his office, dismissing Yumiko and Vickers. Mercer answers the radio and is greeted by Princess. Mercer has Princess switch to another channel based off of her old apartment number. Princess reassures Mercer that she's alright while Mercer promises her that Eugene is safe for now. To Mercer's surprise, Princess reveals that she's on a train heading back to the Commonwealth and that they're bringing back prisoners that Lance Hornsby and Pamela had made disappear. Mercer asks what they're planning to do and Princess states that they are going to change things and take Pamela down, asking if Mercer would be alright with that. Without hesitation, Mercer confirms that he's with them, telling Princess that if they can get the prisoners back to him, the prisoners will be witnesses, giving Mercer legal grounds to remove Pamela from power. As alarms go off in the police station, Princess states that the train will take them to a depot a ways out, asking if Mercer can get them in if they make their way to the city. Mercer directs Princess to an old access tunnel under the west wall that leads up into Union Station, promising to meet the Coalition forces there. Mercer tells Princess that it was good to hear her voice before cutting off contact as Vickers enters with the news that a herd is approaching from the east. Outside of the police station, the Commonwealth Army gears up while an announcement plays over the PA system of lockdown procedures being initiated. Max approaches her brother who explains that a herd is approaching the city and they are being sent out to divert it. Max reminds Mercer that this is exactly what Pamela did before : she used a herd as an excuse to clear the streets during a period of civil unrest. Max wonders how Pamela is doing it, but while Mercer doesn't know, it doesn't change the goal. Looking at the soldiers close by, Mercer loudly states that everyone has to report home, including Max, and they don't need to give hotheads an excuse to start trouble. Max asks if they're just supposed to wait for Mercer and his men to deal with the herd and end the lockdown. Mercer whispers to Max that his girlfriend's coming back with her friends, but cuts himself off before he can go into too many details after noticing Vickers patrolling close by. Sending Rose to distract Vickers, Mercer tells Max that he was supposed to go meet them himself, but if Mercer can get them in, Max and Yumiko have to go meet them in Union Station. Anton brings the news that the vehicles are ready to roll and asks if this is everyone which Mercer confirms it is for now. Hugging his sister, Mercer orders her to keep the others hidden until he gets back and drives off with his men. Staying behind, Vickers looks between Mercer and Max suspiciously. Unable to greet the Coalition forces personally, Mercer uses the herd as an excuse to have Lieutenant Rose divert the guards on the tunnel entrance to help fight the walkers, clearing the way for them to enter. However, Vickers reports on his actions to Pamela who quickly deduces Mercer's true intentions and sets a trap in Union Station. At the gate, Mercer studies a map and issues orders to his men outside to split up the herd and draw it away. As one of the jeeps begins leading the herd away, a variant walker grabs onto the back and climbs into the jeep, unnoticed by the soldiers inside. Mercer receives a panicked report from the other jeep that Echo team had just swerved into the horde and are out of control. As Mercer tries to figure out what happened, Theta team's report devolves into panicked cries and gunfire. Through a pair of binoculars, Mercer spots an overturned jeep amongst the still approaching herd and begins issuing orders to his men to fall back and regroup for an attack on the herd with heavy ammo to knock the hell out of it before the herd can reach the Commonwealth. As Mercer gives orders to his men, Vickers arrives with some of Pamela's private forces, announcing that Mercer is under arrest for treason. As Mercer's men move to defend their general, Vickers warns that any resistance will be met with life in prison or death. Mercer orders Lieutenant Rose and his men to lower their weapons and agrees to go, but he tells Vickers that she needs to fortify the city's defenses before the herd reaches the perimeter. Vickers tells Mercer that Pamela insists that the walls will hold, but Mercer tries to warn his former subordinate that there's something strange going on outside and she has to listen to him because this is bigger than Pamela's bullshit. Mercer is led away, calling to Vickers that she has to stop the dead before it's too late. At the Commonwealth Jail , which has been overrun by walkers, Mercer paces in his cell, safe but trapped due to the thick door blocking his exit. Suddenly, gunfire echoes through the hallways as all of the walkers are shot down. Princess yells for Mercer to get back and cover his head and, once Mercer is clear, the door is blown off of its hinges. Princess and Max enter, and Mercer embraces his sister and his girlfriend. At the police station , Mercer, Ezekiel, Max, Princess and Dianne load supplies onto a truck while Maggie loads a sniper rifle . Negan asks if Maggie intends to use it on Pamela and states that his offer to her still stands, but Maggie refuses. The herd begins to approach the police station and Maggie tells the others that they have to go. Mercer raises his gun to shoot at the walkers, but Ezekiel stops him, recognizing Aaron and Lydia walking amongst the herd, covered in walker guts . Ezekiel runs to help the injured Lydia, asking about Jerry and Elijah , but Aaron tells him that they're still out there. As the herd overruns the police station, the group loads up onto the truck with Aaron promising to fill everyone else in on the way. The group drives off to meet up with the others at the hospital. Ezekiel later radios in that they've got Mercer and asks for any updates on the kids. Gabriel reports the good news and Ezekiel promises to see them at the hospital. At night, outside of a loading dock, Mercer observes a crowd of desperate Commonwealth residents demanding to be let into the Estates. Mercer reassures Maggie that they will be able to move soon while Aaron tells Ezekiel that he saw people on the higher floors and rooftops begging for help, but he wanted to make sure that Lydia was safe first. Ezekiel reassures his friend that he did the right thing. Hearing screams in the distance, both men are determined to do more, but they need to take care of Judith first. Lieutenant Rose arrives in another truck and reports to Mercer that they're all set: everyone is in the back and there's no one to check. The doctors have set up a safe house, but they have to hurry. Mercer calls for everyone to go, stating that they need to get Judith to Tomi . Everyone boards the truck with Princess, Max and Dianne pushing Judith's stretcher. At the safe house, suddenly, there's shouts outside and two gunshots. Looking outside, Mercer sees a man trying to climb the wall, only to be shot by Commonwealth soldiers on Pamela's orders. Mercer tells the others that the soldiers are shooting anyone that climbs the gates and grabs a gun, unwilling to just stand by as people are dying. Mercer informs the Coalition members that the truck is gassed up with enough reserves in the rear to get them home. Mercer and his men can sneak them out the back as Mercer believes that this isn't their fight or their people. \"Yes, they are. And so are you,\" states Ezekiel. Addressing the others, Ezekiel tells them that \"you may not think this place is worth saving, and I get that, given how they treated us. But it's worth it to me. The people are worth it, and I'm not gonna allow them to fall without a fight. Not today. I'm with you. Who else?\" Aaron immediately agrees, stating that they can do more than just save themselves and they need to. Following Ezekiel's lead, everyone agrees to fight to save the Commonwealth. At the gates of the Estates, the crowd desperately begs Pamela to be let in, amongst them Mr. Martens , Mrs. Martens and Mei . On a balcony, Maggie lines up her shot on Pamela, but Negan tells her to hold on as Mercer and his loyalist forces move in, ordering Colonel Vickers and her men to lower their weapons. Pamela orders Vickers to arrest them, but the Coalition forces join Mercer's troops from another angle, creating a standoff. Pamela accuses Mercer of being a traitor, but Mercer states that she's the true traitor and lists Pamela's crimes: disappearing hundreds of citizens, leading the dead to their doorstep, shooting a child and now leaving thousands to die. The banging on the gates grows more frantic as the herd begins to approach the Estates, meaning that the people will die if they're not let inside. Gabriel moves towards the gates despite Vickers orders to stop. Gabriel announces that they're opening the gate and letting everyone inside, threatening to kill anyone who tries to stop him. Vickers threatens to shoot him, but Carol warns her that they will fire back if she does. Pamela orders her men to shoot Gabriel as he reaches the gates and one of them points a gun at his head. Suddenly, Daryl yells for them to stop. \"What the hell you doing?\" Daryl demands. \"We all deserve better than this. You built this place to be like the old world. That was the fuckin' problem.\" Pamela states that if she opens the gates, the dead will get in too, not just the living. Daryl tells her that if she doesn't, Pamela will lose everything anyway. \"We got one enemy. We ain't the walking dead.\" Realizing that Daryl is right, Vickers orders everyone to lower their weapons and give Gabriel the key to the gates. Everyone stands down and Vickers defers to Mercer's command who places Pamela under arrest for high crimes against the people of the Commonwealth. As everyone rushes to help let the people in, Maggie informs Negan that Pamela is getting arrested and Negan tells her that prison is a fate worse than death for someone like Pamela, causing Maggie to relent in shooting her. The crowd rushes in just in the nick of time, amongst them Jerry and Elijah, before the gates are closed, keeping out the herd. Elijah reunites with a relieved Lydia while Jerry desperately looks for his family before Ezekiel reassures his friend that they're safe back in Alexandria and that they will get back out there to help the people that still need their help. Approaching the gates, Pamela notices a zombified Lance Hornsby , Carol's arrow still in his neck, at the front of the herd, reaching through the gates. Pamela approaches Lance, baring her neck and intending to have Lance bite her as a form of suicide . Judith begs Pamela not to go through with it as it's never too late and they have to help everyone still out there. Before Lance can bite Pamela, Maggie shoots him in the head with her sniper rife, putting Lance down. Maggie states that it's time to take the Commonwealth back. With the variants being too dangerous to just lead away, Mercer outlines a new plan as everyone rushes to carry out his orders. As they need to get a vehicle out of the Estates, a mixture of Coalition forces, Commonwealth soldiers and Commonwealth residents, led by Aaron, rush out of the Estates, armed with melee weapons and riot shields with the aim of drawing the herd away and clearing a path, although Mercer warns them not to engage the walkers more than absolutely necessary. Working together, the group holds the line against the herd while Mercer calls in that the vehicle is out of the back gate and on its way to the town square, asking them to let him know when they're clear. Magna reports that they've diverted the walkers and its clear as it's going to get, ordering them to move out. As the combined group continues to fight the walkers, the truck by through the cleared path to the fuel depot where Vickers, Ezekiel, Jerry, Dianne and several Commonwealth soldiers collect the fuel. Max reports in that they've got fuses running to the private sewers under the Estates and they'll finish wiring the rest once they get the fuel back while Princess goes to start the PA system to draw all of the walkers to the Estates. Using Pamela's record player, the song \"Cult of Personality\" is blasted throughout the Commonwealth from the Estates, drawing all of the walkers overrunning the Commonwealth towards it. Elijah helps set up speakers throughout the Estates as Jerry, Ezekiel and Lydia pour fuel down into the sewers and the walkers fighting the forces outside of the Estates begin moving towards it as well. Mercer brings out some dynamite which Eugene and Yumiko help to wire up to drums of fuel placed throughout the Estates and Connie helps to wire up more speakers, unharmed by the loud music due to her deafness. As Max helps to coordinate the efforts, Mercer calls in that they're prepared to open the gates and to let him know when they're ready. Max calls in that they're good to go before she joins the others in retreating to the rendezvous point, the two women acknowledging that they're dead if this plan fails. The gates are opened and the herd floods into the Estates. Once the song ends, the fuses connected to explosives inside of Pamela's house are ignited, detonating the fuel in a chain reaction that obliterates the Estates and the entire herd, saving the Commonwealth. Sitting in a jail cell, Pamela tells Daryl and Carol that it's not easy to have so many lives in your hands. You will have to make ugly decisions such as picking who will do the jobs that no one wants and who gets the nicer house. Carol tells Pamela that they've already had to make an ugly decision by keeping Pamela alive even after everything that she's done because they've all done things. Carol promises Pamela that they will figure it out and Carol will make sure of it. Pausing on her way out, Carol quips that \"at least we don't have to worry about who gets your house.\" Daryl and Carol leave and Mercer locks the cell, leaving Pamela facing a lifetime in prison for her crimes. In Alexandria, everyone enjoys a celebration and feast, joined by Mercer, Max and Tomi. Judith gives Dog some of her food and Yumiko raises a toast to Luke. Looking out the window, Daryl sees Negan walking away and the two men exchange a smile and a nod, parting on good terms. Yumiko turns to Magna, telling her \"same\" and Magna kisses her, the two women resuming their romantic relationship. Sitting down, Rosita smiles as she watches the celebration before becoming somber. Noticing Rosita's somber mood, Gabriel joins her, and Rosita tells him that she just wants to remember this perfect moment. In a whisper, Rosita reveals her bite and impending death to Gabriel. Noticing Rosita's behavior and crying, Judith realizes that something's wrong with her and becomes upset, apparently deducing the truth. A year later, Eugene visits a memorial plaque for those lost in the walker invasion bearing Luke, Jules, Rosita, and Marissa Berot 's names and lays down flowers for his lost friends before pressing a kiss to Rosita's name. Eugene joins Max, who is now his wife, and takes their daughter Rosie from her and puts Rosie in her stroller. Ezekiel, now the governor of the Commonwealth with Mercer as his deputy governor, gives a speech attended by Eugene, Max, Princess, Daryl Judith, Kelly, Connie, Magna and Yumiko amongst many others, the latter two now happily married to each other. When Ezekiel introduces Mercer as his deputy governor, Princess loudly cheers for her boyfriend, much to the amusement of Ezekiel, Mercer and the crowd.",
        "Killed Victims[]": "This list shows the victims Michael has killed: Alves Castle Numerous counts of enemy combatants (Pre-Apocalypse) 7 unnamed Commonwealth residents (Zombified, 5 alongside Daryl and Judith ) Numerous counts of zombies and possibly unnamed people",
        "Appearances[]": "",
        "Trivia[]": "Showrunner Angela Kang said the following about Michael: \"Mercer is a really great character from the books who is the head of the Commonwealth army . I'll say that Michael James Shaw is an absolute pleasure to have as part of the cast. I love the work he's doing. There's a real sense of toughness, but also a tenderness there too. He can play so many different colors, and it's a lot of fun to watch him do his work.\" [1] Michael James Shaw refers to Michael's red armor as \"Mr. Sherbet\". [2] In \" Trust \", it is revealed that Mercer's first name is Michael. The actor, Michael James Shaw , shares the same first name as his character. Mercer is one of twelve characters to survive the TV Series who also survive in the Comic Series , the others being Maggie Rhee , Michonne Grimes , Eugene Porter , Aaron , Hershel Rhee , Negan Smith , Magna , Yumiko Okumura , Lydia , Juanita Sanchez , and Pamela Milton . Excluding the original main cast, Mercer is one of seven main characters who is listed as a main character upon his first appearance, the others being Bob Stookey , Philip Blake , Gabriel Stokes , Pamela Milton , Alpha , and Lance Hornsby .",
        "References[]": "",
        "Name": "Michael Mercer"
    }
]