[
    {
        "Michael Coleman": "",
        "Pre-Apocalypse[]": "Before the outbreak, Michael lived with his wife Betty , his son Michael Jr. , and his daughter Emily . He was a member and resident of Woodbury. At some point, he was diagnosed with prostate cancer.",
        "Post-Apocalypse[]": "Coleman is first seen bedridden in a room for Milton 's experiment with Andrea . Milton proceeds to begin a process to instill a certain procedure into his subconscious. When the procedure ends, Milton explains to Andrea that he is dying of prostate cancer and that Woodbury doesn't have the supplies to treat him, and that they are waiting for him to pass away, so they can carry on the experiment to discover if walkers can still recognize things from the person they once were. This procedure Milton had repeated several times on Coleman in his last days. Once he begins to reanimate, Milton and Andrea restrain him. Milton begins the procedure with no results. Milton refuses to quit and wants to undo the latch on Michael's right arm to show that he can still do the procedure. Milton undoes the restraint, but Coleman attempts to bite him, and Andrea stabs Michael in the head.",
        "Death[]": "Killed By Milton Mamet (Indirectly Caused) Prostate Cancer (Alive) While being kept in the Woodbury lab by Milton for an experiment, Michael passes away from his prostate cancer. Andrea Harrison (Zombified) After being unlatched from his restraints, a zombified Michael tries to attack Milton, but Andrea quickly stabs him in the head.",
        "Killed Victims[]": "This list shows the victims Michael has killed: Possibly a few zombies",
        "Appearances[]": "\" When the Dead Come Knocking \" (No Lines)",
        "Trivia[]": "Michael is one of the oldest characters to die in the TV Series, the others being Dale , Bob Miller , and Hershel Greene . Michael was supposed to have lines, but they were cut prior to filming. [1] Michael is one of five known cancer patients in the TV Series, with David Chambler , Molly , Lucille Smith , and Ezekiel Sutton being the other four.",
        "References[]": ""
    }
]