[
    {
        "Overview[]": "Michelle is shown to be a cold, reserved, and hardened survivor. While interrogating Maggie , she speaks in a very calm manner while revealing the hardships she went through before and after the outbreak. The death of her father , boyfriend, and unborn baby seemingly have desensitized her. Despite this, she doesn't take any sympathy from Maggie and tells her that her people are not the good guys. Though Michelle is shown to be ruthless, she does seem to retain some morality, as when she slices Maggie's stomach she realizes she almost killed Maggie's baby which causes her to freeze up. However, this allows Carol to shoot Michelle in the head.",
        "Pre-Apocalypse[]": "Almost nothing is known about Michelle's life prior to or as the outbreak began, other than she had a father who died and an unborn baby who died in a miscarriage.",
        "Post-Apocalypse[]": "At some point in the apocalypse, Michelle somehow came into contact with a group named \"the Saviors\" which she subsequently joined. Michelle aided her group in terrorizing other survivors and communities around the area into subjugating to Negan's will, where their victims would be forced to give half their supplies in exchange for not being murdered. One day after noticing that her boyfriend had not returned from a run, Michelle stole gas and went searching for him only to find his burned remains on the road. She was then punished for the robbery and had one of her fingers amputated. Having escaped the Satellite outpost with Donnie , Paula , and Molly , Michelle is among the Saviors to capture Maggie and Carol in the woods. The next morning, they bring the women to a safehouse and tie them up, waiting for reinforcements to arrive in order to prepare for a potential exchange to save Primo from Rick. At one point, Michelle is ordered by Paula to take Maggie to another room and interrogate her. When a fight breaks out later that day, Maggie and Carol get the upper hand against Paula, Michelle fights Maggie with a small knife, eventually slashing a slight cut over her abdomen. Startled, Michelle realizes she almost hurt Maggie's baby as Carol sneaks up on her and executes her with a gunshot to the head as punishment.",
        "Death[]": "Killed By Maggie Rhee (Caused) Carol Peletier During their escape, Michelle and Maggie get into a fight. This allows Carol to sneak up on her and shoot her in the temple while Michelle is distracted.",
        "Killed Victims[]": "This list shows the victims Michelle has killed: Numerous counts of zombies and possibly unnamed people",
        "Appearances[]": "\" The Same Boat \"",
        "Trivia[]": "Michelle is the one who found the remains of Bud and his gang as she was searching for her boyfriend; one of the Saviors blown up by Daryl's RPG in \" No Way Out \". Jeananne Goossen was so afraid of walkers that prior to shooting any scenes with walkers, she met and greeted each of the extras portraying walkers for a reminder that they were just \"people in costume\".",
        "Name": "Michelle"
    }
]