[
    {
        "Michael Turner": "Michael Turner",
        "Overview[]": "Michael is a relentless and brutal survivor. After the Reapers attack the group at night, he and Bossie track Maggie for miles. Michael is shown to be quite durable. He gets slashed in the leg by a knife and falls down a flight of stairs but is later still able to tackle Maggie and almost kill her. Maggie manages to stab him with a broken glass bottle and Negan finishes him with a crowbar. Though to Maggie's group Michael is just another enemy, to the Reapers they saw Michael as their brother and was seemingly very well-liked among them. After his death, the Reapers are shown to be mourning his death. When Michael is badly wounded in the fight with Maggie and Negan, Bossie refuses to leave Michael behind, carrying him for 10 miles and is later seen bawling over his death. Michael had a very close relationship with Leah Shaw who described him as \"the little brother I never had.\" According to her, he was similar to herself since he didn't have much family. Leah compares the closeness with him to her relationship with Daryl Dixon .",
        "Pre-Apocalypse[]": "Michael joined the group that would eventually become the Reapers right after Pope founded his private military company. During his time with the group, Michael would develop a close relationship with Leah , as neither of them had real families. Leah came to view Michael as the little brother she never had.",
        "Post-Apocalypse[]": "During the beginning of the outbreak, as Operation Cobalt was put into action in an attempt to try and contain the undead threat, Pope and a group of his people managed to escape the bombings by running until they reached an abandoned church, where inside Pope was amazed to see none of them had been killed or injured, leading him to view him and his comrades as \"the chosen ones\". It is unknown if Michael was present during this revelation. Regardless, he eventually joined the Reapers, and either found or crafted his own mask with a large-toothed skeletal expression on it, and would use this mask as a scare tactic against those who were \"marked\" by Pope. At some point, Michael and his group eventually attacked a group of survivors led by Maggie Rhee despite having no previous hostilities with her group and succeeded in destroying their camp and killing numerous members of her group, causing them to flee to Virginia. He and his group eventually followed them to finish them all off due to his leader, Pope marking Maggie's group. While not part of the Reapers ' initial attack on Maggie's group, Michael, along with Leah Shaw , Jenson , and Brandon Carver , remained hidden near the forest. Michael and his fellow Reapers attack the members of Maggie's group, managing to kill Cole and injuring several others. Michael and Bossie proceed to stalk Maggie for miles, tracking her through the night to a mall where they eventually ambush her and Alden , who also sought refuge at the mall. While Michael initially overpowers Maggie and tries to kill her with Elijah 's stolen kama, he is stabbed in the head by her with a broken bottle, followed by a swing to the back of the head with a crowbar by Negan . Bossie, who was attacking Alden, notices Michael severely injured after being struck in the back with a throwing knife by Maggie. Bossie throws a flash bang grenade, allowing him to rescue his wounded friend and flee undetected from the disoriented Maggie and Negan and incapacitated Alden. Michael is brought back to Meridian by Bossie, who had carried him ten miles from the mall. However, Michael at some point had succumbed to his wounds, upsetting everyone, especially Leah, whom Michael was particularly close with. Leah and Brandon are brought to see Michael's body where Mancea is performing a prayer and chanting over Michael's body. Nearby, Bossie cries as he explains to Pope what happened. As the Reapers grieve over the loss of their friend, Pope declares that they must make Maggie's group feel his and God's wrath. At the campfire that night, Pope states that Turner will get a proper burial and accuses Bossie of abandoning Turner to die due to Bossie's wounds being in his back. As a result, Pope burns Bossie to death as a punishment . Mancea walks over to the Meridian graveyard and tends to the graves of Michael and Bossie, unknowingly being watched by Gabriel .",
        "Death[]": "Killed By Maggie Rhee Negan Smith When Michael attacks Maggie, she manages to stab him with a broken bottle before Negan comes up behind him and bashes him over the head. He later dies of these injuries.",
        "Killed Victims[]": "This list shows the victims Michael has killed: Ms. Adams (Possibly) Leo (Possibly) Teresa (Possibly) Duncan (Possibly) Numerous counts of enemy combatants (Pre-Apocalypse) Possibly unnamed Meridian residents Numerous counts of zombies and unnamed people",
        "Appearances[]": "\" Hunted \" (No Lines) \" Rendition \" (Corpse)",
        "Trivia[]": "While his death wasn't confirmed on screen until \"Hunted\", Talking Dead confirmed during its In Memoriam segment that Michael had died. While Michael was not named in the In Memoriam segment, he was referred to as the Creeper Reaper . Along with Daryl, Turner is also the only member of the Reapers to join after Pope built his private military company. Therefore it is not confirmed whether or not he served in Afghanistan like the rest of his group.",
        "Name": "Michael Turner"
    }
]