[
    {
        "Pre-Apocalypse[]": "Nothing is known about Midge's life prior to or as the outbreak began, except that she had a twin sister named Hilda .",
        "Post-Apocalypse[]": "Midge and Hilda survived the early stages of the outbreak and eventually they found themselves as members of a large group of survivors led by a woman named Georgie . Eventually, they became trusted confidants of their leader and they would serve as her escort during her mission of seeking communities to negotiate with them. Midge and Hilda stand outside their van in the middle of the road, waiting for the Hilltoppers to respond to their offer of trading phonograph records for food and knowledge. When Maggie and her companions arrive at the meeting point, Georgie exits the vehicle and introduces herself. However, Midge and Hilda are stripped of their weapons under Maggie's order and the group is taken to the Hilltop as prisoners until further notice. Later that day, Maggie finally allows them to leave before reaching an agreement with Georgie on improving their community through Georgie's knowledge gained for her next visit in the future. After some parting words by Georgie, Midge and the others drive off. Though not mentioned it's implied that she and Hilda are alive due to Jesus mentioning Georgie's invitation to the group after the time skip. When talking to Tara , Jesus mentions that Midge and Hilda dropped off another one of Maggie's letters that morning. Maggie reveals that a couple of years before her return, Georgie left with the twins to go help another city while Maggie stayed with the community they had been working on. Shortly thereafter, the community where Maggie was fell and she hasn't seen Midge since. As a result, Maggie doesn't know if she's still alive or not.",
        "Killed Victims[]": "This list shows the victims Midge has killed: Possibly numerous counts of zombies and unnamed people",
        "Appearances[]": "\" The Key \"",
        "Trivia[]": "Hilda and Midge are the first set of identical twins encountered in the TV Series, the second being Mays , and his brother .",
        "Name": "Midge"
    }
]