[
    {
        "Mikey": "",
        "Overview": "Mikey is friendly and kind young man. He is very welcoming to Carl Grimes when he first meets him, trying to be as respectful as possible seeing as he came from the outside. Mikey is shown to be well-liked amongst his friend group.",
        "Pre-Apocalypse": "Nothing is known about Mikey's life prior to or as the outbreak began, except that he had a father.",
        "Post-Apocalypse": "At some point in the apocalypse, Mikey and his father joined a community called the Alexandria Safe Zone . Mikey is hanging out with Ron and Enid when he meets newcomer Carl . He apologizes on behalf of his friends for leaving their comics in Carl's house, stating that they would just listen to music and read comics when hanging out at the unfinished room and didn't realize people were moving in. He offers to play video games with Carl to help him adjust to his new life. Ron suggests to Carl that they head to Mikey's house and play with the pool table but warns that Mikey's father is very strict about it. Mikey replies to Ron that his father works during the day and wouldn't be home if they choose to head over. When Mikey and Ron realize how overwhelmed Carl is, they apologize and Mikey states that they can just hang out and not talk. Instead, Carl replies that he's down to play video games and joins Mikey and Ron as Enid watches from the bed. Mikey attends Deanna 's welcoming party where he hangs out with Carl and Ron. They joke about Mikey losing a bet, for which he hands over some cards to Carl. Mikey is among the several Alexandrians killed during the Saviors ' grenade attack on Alexandria, having been unable to evacuate safely into the sewers in time with the other residents. [1]",
        "Death": "Killed By Negan Smith (Caused) The Saviors Mikey is among the residents killed when Alexandria is attacked by the Saviors with grenades as he wasn't able to safely evacuate into the sewers in time.",
        "Killed Victims": "This list shows the victims Mikey has killed: Possibly a few zombies",
        "Relationships": "",
        "Appearances": "\" Remember \" \" Forget \"",
        "Trivia": "Mikey is one of nine characters to die in the TV Series who does not die in the comics, the others being Sophia Peletier , Carl Grimes , Paul Rovia , Siddiq , Laura , Earl , Sebastian Milton , and Lance Hornsby .",
        "References": ""
    }
]