[
    {
        "Mike": "",
        "Fate": "",
        "Contents": "",
        "Overview[]": "Though Mike's true personality is unknown, through Michonne 's dream sequence he seems to be a friendly, humorous, and caring man. He and Michonne had a very close relationship and he is shown to greatly care for his son's safety. However, it's revealed that Mike is quite careless. He and Terry had gotten high and were unable to save Andre or themselves. Michonne harbored resent towards Mike for this and kept him as a walker as punishment. Her disdain for him is so great that she states that he and Terry, \"weren't human to begin with.\" However, later Michonne does state that she missed Mike very much.",
        "Pre-Apocalypse[]": "Little is known about Mike's life prior to or as the outbreak began, except that he was Michonne's boyfriend and had a son named Andre , and they lived in an apartment building in Atlanta. He was also friends with Terry .",
        "Post-Apocalypse[]": "Shortly after the outbreak , Mike joined a refugee camp with Michonne, Andre, and Terry. Michonne became a prominent supply runner and defender of the camp, using a katana she had found. However, Mike and Terry became hopeless about their situation, especially as conditions at the camp worsened. Terry suggested they leave the camp, but Mike rejects this idea as he sees it as suicide. Unable to cope with this new world, Mike and Terry get high on drugs. Meanwhile, the camp was attacked and overrun by walkers - with Andre getting devoured and Mike and Terry bitten. Michonne returned from her supply run and saw what became of her family. Out of both anger and unwillingness to let go of her loved ones, Michonne let Mike and Terry turn. She then cut off their arms and jaws so they were unable to attack her, and she used them as both pet mules and camouflage against the other undead.",
        "Death[]": "Killed By Himself (Caused, Alive) Zombies (Alive) When walkers attack the camp he is staying at, Mike is unable to fight them off due to being high on drugs and is bitten by multiple walkers. Later, he succumbs to the infection and reanimates. Andrea Harrison (Zombified) Mike's zombified head was presumably put down by Andrea following the Governor's fight with Michonne, as it is never seen again afterwards.",
        "Killed Victims[]": "This list shows the victims Mike has killed: Andre Anthony (Caused) Himself (Caused, Alive) Possibly numerous counts of zombies",
        "Relationships[]": "Michonne's Group Michonne Hawthorne - Girlfriend Andre Anthony † - Son Terry † - Friend",
        "Appearances[]": "",
        "Trivia[]": ""
    }
]