[
    {
        "Milo": "Milo",
        "Overview[]": "Milo is shown to be a rather shy boy. Due to his young age, he never got to experience much before the outbreak, such as riding on an airplane. He makes a friendship with Negan , who describes what it's like to be on a plane. Negan offers Milo and his mother a chance to go to Hilltop, seeing as they are struggling on their own, which Milo accepts. Unfortunately, he is killed by Brandon before this can happen.",
        "Pre-Apocalypse[]": "Nothing is known about Milo's life prior to or as the outbreak began, although given his young age, it's possible he hadn't been born yet at this time.",
        "Post-Apocalypse[]": "Milo and Amelia survived together until they joined a group of survivors living in a camp. At some point, the camp was overrun by walkers, separating them from the group. They later discovered the campgrounds in ruins and continued on the road in search of a new safe haven. Milo and his mother Amelia try to seek refuge inside an abandoned bus when they are surrounded by several walkers. Before they can be killed, they are rescued by Negan Smith while Brandon arrives shortly after. Following their rescue, Amelia shares with them her story on how they have been trying to survive on their own and then takes Milo outside for a walk. Later that day, Milo sits to play with a toy airplane as his mother pack their bags. Negan joins him and they bond over his tales of the feel of traveling on a plane and the joys of nut-tapping. He then promises to take him and his mom to Hilltop . While waiting for Negan to bring back wood for a fire, Milo and his mother are caught off guard by Brandon and have their head bashed in with a tire iron due to him believing to be accomplishing a test by Negan.",
        "Death[]": "Killed By Brandon Milo and his mother are both killed by Brandon, who delusionally believes Negan wanted him to kill them in a sort of test to prove himself.",
        "Killed Victims[]": "This list shows the victims Milo has killed: Possibly a few zombies",
        "Appearances[]": "\" What It Always Is \"",
        "Name": "Milo"
    }
]