[
    {
        "Milton Mamet": "Milton Mamet",
        "Overview[]": "Milton is the intelligent, inquisitive, and humble scientist of Woodbury . Milton often does experiments with walkers, such as when he tried to see if a zombified Michael Coleman would recognize his family. He initially starts as a loyal ally to the Governor . However, he is shown to disapprove of his ways, such as being disgusted when he and his men killed the National Guard soldiers. He starts to rebel against him and warns Andrea about him. After the Governor finds out Milton betrayed him, he is savagely beaten. Milton is forced to kill Andrea if he wants to live. Not wanting to hurt his friend, Milton instead tries to kill the Governor but fails, leading to his death. In his last moments, he expresses hope that the residents of Woodbury can be saved.",
        "Pre-Apocalypse[]": "Before the outbreak, Milton was an only child and lost both of his parents at a very young age. He had a job that he telecommuted to and was possibly in some area of science, suggested by his being able to perform experiments on the zombies. He was also a bit of a loner before the outbreak as he has admitted that he has never had a relationship.",
        "Post-Apocalypse[]": "At some point following the outbreak, Milton arrived at the fortified town of Woodbury and joined the group of survivors residing there. He developed a close relationship with the group's leader, Philip Blake and assisted him in protecting the town and turning it into a thriving safe haven. He also regularly performed experiments on the walkers in order to develop behavioral patterns and equipment to better combat them and use them. Despite this Milton never personally killed a walker in the early days or witnessed an actual reanimation. At some point however, Philip's daughter Penny died and Milton witnessed Philip's decent into a more savage and barbaric survivor who began attacking other survivor settlements and killing innocent survivors in order to steal valuable weapons and resources. These atrocities were kept hidden from the rest of the Woodbury survivors though Milton was aware and despite disagreeing with Philip's ways of survival, he maintained his loyalty to him anyway out of fear. Milton is given Michonne Hawthorne 's two pet walkers to perform experiments on soon after her and Andrea Harrison 's capture. He reports his collected data to the Governor when the man comes to visit him in his apartment-based lab. Milton requests to talk to the two women, believing they might have answers to the genealogy of the walkers, having been out in the wild for the last several months. The Governor grants his request and allows him to subtly interrogate them at breakfast the following morning. His attempt ultimately fails, however. When the Governor, Merle Dixon , and their men return to the community after killing the National Guard soldiers, Milton is presumably told by the Governor about what transpired, and walks away with a disgusted look on his face. As Woodbury prepares for a day of celebrating, Milton is seen bringing a cold drink to Andrea. He says that they are using the town's generators in order to keep the drinks cool. When Andrea asks what is in store for the night, Milton says that mere words cannot describe what they have planned. Later, Milton accompanies the Governor and Merle to retrieve more drinks from the Governor's house. Milton complains that they should postpone the night, for he needs the generator's power for his experiment the next day. The Governor tells him to take a break for the night and get back to it in the morning. Milton reluctantly agrees. Milton is seen visiting the generator outside of Woodbury along with Merle and a few others. The generator appears to be wind-powered. Two walkers have also been caught in a netted trap. Merle tells Milton to get his hands dirty for once, giving him a harness to grab hold of a female walker. It manages to bite his arm, but the duct tape that's wrapped around the sleeves of his jacket protect him, causing Merle to take back every bad thing he said about the jacket. Although Milton says she looks like an interesting specimen, Merle kills her. Instead of killing the next one, Merle holds it down and begins pulling out its teeth. That night, Milton joins the Governor, Andrea, and all of Woodbury to watch a wrestling match between Merle and Martinez . The two fighters are in an arena surrounded by walkers kept on chains. Milton is visibly disgusted by this sport, as is Andrea, even though the zombies are toothless. He was first seen informing the Governor that his experiment was ready. Later, he's seen conducting the experiment on Michael Coleman , along with Andrea. Andrea questions if he had ever seen reanimation, which he denies and explains he was an only child and his parents both passed away while he was young. He later witnesses Michael reanimating and repeats the experiment. The walker grips the bed and Milton believes that it was a positive response. Andrea states that it was just a common reanimation reaction. Milton undoes Michael's restraints and repeats the experiment once more. Michael attempts to bite Milton, but before he can, Andrea stabs him in the head. A disheveled Milton then quietly states that he will study his work, and walks off. He is later present outside the interrogation room where Glenn Rhee is being tortured. Milton is present at the Woodbury army meeting before the firefight between them and Rick Grimes ' group. He initially does not agree on the Governor's approach towards the intruders in Woodbury but recants after he finds out about the murder of Warren , which Merle lied about. Milton is later present with Merle and Haley at the clinic after the Governor is injured. Apart from Andrea, he appears to be the only one bothered by the Governor when it is decided that Woodbury would attack the prison. Milton appears not to enjoy what would go down between Merle and his brother Daryl in the arena. Milton is seen in the crowd of Woodbury residents that are chanting for the execution of Daryl and Merle. Milton does not chant, but attempts to hold back Andrea. After the attack, he is talking with Andrea to find out how many people were injured. Later on, he visits Philip's apartment to inform him of the chaos the residents were making, and later is in the streets with Andrea, attempting to control the situation. Milton is first seen sitting in his apartment, focusing on something. The Governor walks into the room and slams his pistol down on Milton's desk, startling him. He asks if Milton ever thought about departing Woodbury, and Milton reveals that he hasn't. The Governor informs Milton that he questions where Andrea's loyalties lie, and orders him to keep tabs on her. Later that day, Andrea asks where the Governor is, but Milton refuses to answer the question, claiming that he was on a supply run. Milton keeps tabs on Andrea, as requested by the Governor. Andrea informs Milton that she wants to sneak out and visit her friends at the prison to stop the upcoming war. Milton opposes but to no avail. He informs the Governor about this, and is ordered to help her \"escape\" and follow her to the prison. Armored in duct tape, he and Andrea tackle a walker in the woods, in which she chops off the limbs and jaw of the zombie to keep other walkers away. After the gruesome task is done, Tyreese and his group find Milton and Andrea in the woods. Milton volunteers to take Tyreese and his group back to Woodbury. He resides with them in Dr. Stevens' clinic and is just as surprised as the Governor is, when Tyreese reveals they came from the prison. Milton asks if he can remember how he got inside and any of the prison layout. When the Governor takes Milton with him to meet Rick , Milton begins taking notes of what's happening. Milton tells Hershel Greene that they need to keep records of the apocalypse's history, and Hershel agrees with him. The two talk, and Milton starts to take interest in Hershel's amputated leg. Milton asks if he could see Hershel's leg, and Hershel jokingly says, \"At least buy me a drink first.\" They both start to laugh. After they return to Woodbury, Milton sees the Governor tell Martinez to post men around the feed store and to kill them all except Michonne. When asked about the truce, the Governor simply says that sooner or later, Rick would have become a problem. Soon after, Andrea asks Milton why there are so many guns being loaded into a truck. Milton tries to convince her by saying that it's 'probably just a precaution.' He then leads her to an alleyway and tells her the truth: The Governor will kill everyone at the prison regardless of whether or not he gets Michonne. He takes Andrea to the second level of the interrogation building and shows her the Governor's torture chamber through a grate in the wall. When Andrea tries to kill him, Milton wrenches her gun away. When confronted, he says that he \"knew Philip before he became the Governor. That man still exists.\" Andrea declares she's leaving to warn Rick and asks if he'll come along too; Milton declines, saying that he doesn't know anyone at the prison and that he belongs here. After Andrea says that he \"can't look the other way\", Milton decides to burn the walkers in the pit that the Governor was planning to use on Rick's group at the meeting. He is later confronted by the Governor and the latter realizes that Milton told Andrea his plans for the prison survivors, sending the Governor off to track down and bring back Andrea before she reaches the prison. Milton is first seen being savagely beaten by the Governor for his betrayal. Milton asks if Andrea is alive, and is then dragged into the torture chamber in which she was kept in. The Governor asks Milton to take the various tools of torment he had left for Andrea to another room where Milton secretly leaves a pair of pliers to assist in Andrea's escape. However, before Milton could leave, the Governor stops him and tells Milton that the only way he was going to leave the room is if he killed Andrea. The Governor hands Milton a knife but instead of killing Andrea, Milton tries to kill the Governor. The Governor easily disarms Milton and stabs him several times in the abdomen. The Governor leaves Milton in the room with Andrea to reanimate and kill her. Before he dies, Milton informs Andrea of the pliers he left. Andrea also tells her reasons for choosing to stay in Woodbury in hope of saving its residents from the wrath of the conflict with the prison. Milton reanimates moments before Andrea can remove her bindings. Before she could break away, she was bitten close to the neck by Milton, before stabbing him with the pliers and killing him. His body is later seen on the ground next to a bitten Andrea.",
        "Death[]": "Killed By Himself (Indirectly Caused) Philip Blake (Alive) The Governor decides to force Milton to be the one to kill Andrea. Rather than kill her, Milton takes the opportunity to attempt to kill the Governor. The Governor fends off the attack and stabs Milton four times in the stomach, leaving him to turn, knowing that he will attack Andrea after his death. Andrea Harrison (Zombified) Andrea, using pliers that Milton had deliberately dropped for her, manages to free herself from her binds just as Milton turns. She manages to kill him with the pliers, but is still bitten on the neck by him.",
        "Killed Victims[]": "This list shows the victims Milton has killed: Himself (Indirectly Caused) Andrea Harrison (Infected, Caused) Numerous counts of zombies",
        "Appearances[]": "",
        "Trivia[]": "The casting call for this character used the name Harold . Milton was described as \"40s to 50s. A studious and fastidious man trying to carve out a post-apocalyptic niche for himself.\" Milton reveals his last name to be Mamet during his memory experiment on Michael Coleman . Dallas Roberts stated in response to an interviewer's question that he intended to portray Milton as having some sort of autism spectrum disorder. During a conference with Chad Coleman , it was revealed that initially, Tyreese and Sasha would find Andrea in the interrogation room at the end of Season 3, with Tyreese killing the reanimated Milton with his hammer. Though for story-telling reasons, the scene was cut. [1] Oddly enough, Milton is not credited in \" Welcome to the Tombs \" despite having multiple scenes throughout the episode. Milton was meant to come into Season 4 along with Andrea , but Glen Mazzara disagreed and killed both of them off in the season finale of Season 3. A zombified Milton appears alongside Andrea Harrison , Gareth , and Rodney in a series of special commercials created by Ryan Reynolds, advertising products such as DoorDash, Autodesk, Ring, and Deloitte, that all aired the night of the series finale . Milton is the last named character killed by Andrea, albeit zombified.",
        "References[]": "",
        "Name": "Milton Mamet"
    }
]