[
    {
        "Miranda Morales": "",
        "Fate": "",
        "Contents": "",
        "Overview[]": "Miranda is a kind, caring, and helpful woman. She is shown to get along with the rest of the Atlanta Camp survivors. She is a loving wife to Morales and mother to Louis and Eliza . She puts her family's safety before all else. After a walker attack, Miranda and her family make the decision to go their own way Birmingham to find the rest of their family. However, this choice would prove to be fatal, as on the way it's revealed that Miranda and her kids were killed, leaving Morales as the sole survivor. Miranda's death would be a huge contributing factor to Morales' loss of sanity and turn into a cruel and ruthless Savior .",
        "Pre-Apocalypse[]": "Nothing is known about Miranda's life prior to or as the outbreak began, except that she was married to Morales and had two children, Louis and Eliza.",
        "Post-Apocalypse[]": "Miranda separates her rowdy children, Eliza and Louis, as they play together. At the camp with her children, she awaits her husband 's return from Atlanta and gives him a big embrace when he does. While enjoying the fish feast with her family and the other survivors, walkers attack the camp, prompting Miranda to grab her children and flee to the RV while the others defend the women and children. Having survived the attack, Miranda attends the funeral for the fallen survivors. While the group decides to head for the CDC , she and Morales speak up, saying that they have decided they are going to take their chances and head for Birmingham, saying that they have family there. She tearfully hugs her former companions goodbye and part ways with her family when everyone leaves the camp. While attacking a Savior outpost, Rick finds a picture of Miranda shortly before being confronted by Morales, now a Savior. After encountering Rick Grimes again, Morales states that his family never made it to Birmingham and Miranda, Eliza, and Louis all died.",
        "Death[]": "Killed By Unknown Cause It's mentioned that Morales' whole family was killed. It's not known how Miranda died.",
        "Killed Victims[]": "This list shows the victims Miranda has killed: Possibly numerous counts of zombies",
        "Relationships[]": "",
        "Appearances[]": "",
        "Trivia[]": ""
    }
]