[
    {
        "Mitch Dolgen": "Mitch Dolgen",
        "Overview[]": "Although he only appeared in two episodes, Mitch was shown to be a selfish, greedy and docile person. Unlike his brother Pete , Mitch was a hardened survivor who was willing to do anything to survive and was more than willing to rob and kill other survivors for their supplies as seen when he showed a desire to raid a camp filled with supplies that he wanted and was visibly angered upon discovering that another group raided the camp and took the supplies. Mitch was shown to be very capable of cold blooded murder as seen when he mercilessly stabbed a survivor of the camp in the head and showed no remorse as a result. Mitch did not appear to care very much for his brother as following his death at the Governor 's hands he was remorseful only for a short time before focusing his loyalty to the Governor completely, becoming his right hand man. During the prison attack, Mitch's desire to raid the prison was evident during a comment to Rick and his strong loyalty to the Governor was evident as he followed his orders without question to drive his tank through the Prison's fences and kill every survivor and destroy the complex, showing that Mitch was indeed a remorseless murderer. He was possibly a bit of a coward to as before his demise he surrendered to Daryl who quickly shot him through the heart with an arrow.",
        "Pre-Apocalypse[]": "Before the outbreak, Mitch was an ice cream truck driver and later became a tank operator for the U.S. Army.",
        "Post-Apocalypse[]": "At some point after the outbreak started, he joined with his brother, Pete, and eventually found Martinez's group. Mitch, along with a few others at his camp, find Philip Blake and Meghan Chambler and invite them to the camp. He later goes on a supply run with his brother and the Governor in which they find a cabin and raid it. The next day, Mitch reveals to the rest of the camp that Martinez's remains were found and that he must have gotten drunk and fell into the pit. Later on, Mitch, Pete and the Governor are again out in the woods and stumble across a camp of about 10 survivors. Impressed by the supply load, Mitch says they should rob the camp but Pete refuses, saying they will simply find their own supplies, which upsets Mitch. The three return to the camp after it has been raided by another group and Mitch is furious, shouting that had they attacked the supplies would be theirs and now it is lost and in the hands of another group. Mitch then mercilessly drives his knife into one of the camp's injured survivors. Later on, Philip kills Pete, and informs Mitch why. Mitch is visibly upset by his brother's death, but after Philip tells him why he did it, he understands why it needed to be done. Later, Philip takes charge of the camp and Mitch becomes his right-hand man. Mitch takes part in Philip's assault against Rick Grimes ' group at the prison . When Rick is attempting to negotiate with the militia and asks if the attack is what they want, Mitch replies that what they want is everything that Rick has and that it is time for him to leave and calls him an asshole. After Hershel is killed by the Governor, he orders the militia to drive through the fences and kill every survivor in the prison to which Mitch replies \"Roger that!\" and signals for the group to start moving. Mitch uses the tank to knock down the prison's fences and destroy much of the prison itself until Daryl Dixon tosses a grenade down the tank's gun barrel. Mitch manages to get out of the tank before the grenade goes off, but is confronted by Daryl, who aims his crossbow at him. Though he puts up his hands in surrender, he is shot through the heart by Daryl. Mitch's corpse is seen on the ground near the destroyed tank.",
        "Death[]": "Killed By Daryl Dixon After Mitch escapes from the tank as it explodes, he is confronted by Daryl. Although he surrenders, he is shot in the heart with a crossbow bolt.",
        "Killed Victims[]": "This list shows the victims Mitch has killed: 1 unnamed man Numerous counts of prison residents (Caused and Direct) Possibly numerous unnamed enemy combatants (Pre-Apocalypse) Numerous counts of zombies and possibly unnamed people",
        "Appearances[]": "",
        "Trivia[]": "The casting call for this character used the name Mack . Mitch was described as \"Mid 30s. An aggressive wiseass.\" In the episode \" Nebraska \", Dave says that Fort Benning was overrun, which is later confirmed by Mitch in the episode \" Dead Weight \". Mitch is the first named antagonist to be killed directly by Daryl Dixon .",
        "Name": "Mitch Dolgen"
    }
]