[
    {
        "Mitchell": "",
        "Fate": "",
        "Contents": "",
        "Overview[]": "Mitchell is a brutal, savage, cunning, and vicious young man. He initially comes off as a normal teenager and is friendly with Michonne 's group, playing games and having a good time with them. However, under the leadership of Jocelyn , he along with the other kids were brainwashed to become ruthless and hardened survivors. As one of the oldest in the group, Mitchell acts as Jocelyn's second-in-command and very briefly takes on the leadership role after her demise. Despite Michonne's offer to allow them back into Alexandria , Mitchell orders for the group to kill the children and attempts to kill Michonne himself. Seeing that he is too far gone, Michonne is forced to kill Mitchell along with the other kids.",
        "Pre-Apocalypse[]": "Nothing is known about Mitchell's life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "In a flashback, Mitchell and Jocelyn are found by a group from Alexandria in the woods and are brought to the community. Michonne recognizes Jocelyn as her friend from college and decides to let her group stay. At night, Mitchell and the rest of Jocelyn's kid group enjoys a bonfire with the community kids. In the middle of the night, Jocelyn and her group kidnap Judith and other children, kill a resident , and leave with the food supply and guns. The next day, Michonne and Daryl spot one of Jocelyn's kids outside of an abandoned school. They chase him until they're met by all of the kids in a hallway. Daryl gets shot in the shoulder with an arrow while Linus knocks Michonne unconscious. Sometime later, they wake up bloodied and tied to a pipe. Linus painfully brands an iron X on Daryl and Jocelyn tells Michonne the kids can't be soft. Winnie then brands Michonne as she shrieks in pain. However, Michonne and Daryl manage to get free. Michonne finds an exit and is immediately beaten over and over with a wooden plank by Jocelyn. Michonne summons the strength to stab her in her leg and the chest, killing her. Michonne gets up and tells the kids they can all return to Alexandria, but Mitchell instructs the kids to kill the Alexandrians as he deals with her. Before he can harm Michonne, however, Michonne quickly slashes Mitchell in the stomach, killing him.",
        "Death[]": "Killed By Michonne Grimes Mitchell tries to attack Michonne but is quickly slashed in the stomach. Michonne Grimes or Daryl Dixon (Before Reanimation, Assumed) He is presumably put down before reanimation by either Michonne or Daryl once the fight is over and the Alexandrian kids are safe.",
        "Killed Victims[]": "This list shows the victims Mitchell has killed: Russ (Caused or Direct) Possibly numerous counts of zombies and unnamed people",
        "Relationships[]": "",
        "Appearances[]": "\" Scars \" (Flashback)",
        "Trivia[]": ""
    }
]