[
    {
        "Molly": "",
        "Fate": "",
        "Contents": "",
        "Pre-Apocalypse": "Nothing is known about Molly's life prior to or as the outbreak began.",
        "Post-Apocalypse": "While Daryl and Carol talk in the dining pavilion, Molly can be seen eating breakfast with another girl . Molly is later seen playing with Lizzie , Mika , and Luke in the prison yard, naming the walkers . After Carl confronts the kids and tells them to stop naming walkers, Molly follows Luke and Lizzie to the library, where she is later seen listening to Carol at story time, which turns into a knife lesson. As an outbreak occurs in Cell Block D that left several people killed and reanimated, Molly attempts to flee downstairs to safety. She is saved by Carol and is rushed into a cell with Karen , David , Luke , and another girl where they are safe and wait out until the reanimated residents are put down. Though unseen, Molly was moved to the Administrative Building as it was mentioned that the children and elderly were moved into this building as a part of the quarantine. After the watch tower is blown up by the Governor, the prison residents are told to evacuate to the bus. Luke carries a bag of supplies and follows Molly and Mika, who are carrying Judith, as they head for the bus when Lizzie stops them and tells the group to be strong like Carol told them to, and not to be scared and weak. A short time later, after the bus was forced to leave before everyone could board, Luke and Molly go out into the prison yard alongside Lizzie and Mika, and one of the Governor’s men is shot and killed by Lizzie. After his death, Luke turns around and runs back into the prison, followed by Molly. Lizzie then executes Alisha , and runs back after Luke and Molly into the prison with Mika , despite Tyreese ‘s attempt to tell them they’re fleeing in the wrong direction. Beth and Daryl come across several bodies beside the train tracks being eaten by walkers. Beth sees a child's shoe, and assumes them to be the bodies of Molly and Luke.",
        "Killed Victims": "This list shows the victims Molly has killed: A few zombies",
        "Relationships": "",
        "Appearances": "",
        "Trivia": "In \" Inmates \", Beth and Daryl find children’s footprints in the woods, and Beth speculates they may belong to Luke or Molly. After finding the corpses and a bloody child’s shoe at the train tracks, Beth breaks down in tears, believing the children may have been killed. While it was never confirmed, Luke Donaldson mentioned in an interview that people had speculated that Luke and Molly may have been siblings, and that they had come from Woodbury with the remaining townspeople after the failed prison assault (neither filmed for Season 3). [1]",
        "References": ""
    }
]