[
    {
        "Morales": "",
        "Overview": "Morales was initially shown to be a kind, caring, brave man who was a loving husband and father and also a strong, determined survivor. Morales was shown to be a valued member of the Atlanta Camp and seemed to care about his fellow survivors deeply as seen when he protected them from the horde of walkers that attacked their camp. After abandoning the Atlanta Camp for the good of his family, Morales would suffer a horrible tragedy as he lost his entire family and thus became insane over it. Following this, he found a sense of purpose after being found by the Saviors and thus adapted fully to their sinister lifestyle and became completely loyal to Negan and effectively devolved into a hardened, dark and ruthless survivor. Morales would reveal that he was a man willing to do anything to survive, hinting that he was likely a murderer as well. After encountering his old ally Rick nearly two years after leaving him and the group, Morales was shown to have lost all the care and loyalty he once had for his allies in Atlanta as he was more than willing to take Rick to Negan alive to be punished for his actions and showed barely any remorse upon learning of the deaths of many of his friends from Atlanta; even Glenn at Negan's hands in front of his own wife . Morales even pointed out that Rick is also a ruthless killer and a far cry from the friendly police officer he once was, showing his lack of respect for his former ally. Ultimately, Morales would die a cruel Savior and the polar opposite of the person he once was, and was killed by one of the very members of the group that he was once a part of.",
        "Pre-Apocalypse": "Nothing is known about Morales' life prior to or as the outbreak began, except that he was married to Miranda and had two children, Louis and Eliza .",
        "Post-Apocalypse": "In Atlanta, Glenn radios his group, prompting Morales and T-Dog , wearing riot gear and brandishing baseball bats, to emerge from the building and beat down the walkers. Rick and Glenn rush into the building, followed by them. Inside the department store, Andrea points a gun in Rick's face as he and Glenn enter. \"We're dead because of you,\" Andrea tells him, furious at his recklessness. Morales informs Rick that his gunshots have attracted numerous hordes of walkers. \"You just rang the dinner bell,\" Andrea seethes, as the group's attention turns to a crowd of walkers outside that are slamming themselves against the outer set of glass-pane doors, furiously trying to gain entry. Morales and the group questions Rick about what he was doing roaming around the streets of Atlanta aimlessly. He tries to explain he was trying to flag down a helicopter. Jacqui suggests that it was just a hallucination. \"I saw it,\" Rick insists forcefully. T-Dog tries to make radio contact with the camp, but fails to get a signal, wondering if they might have better luck on higher ground. Suddenly, muffled gunshots are heard. \"Oh, god, is that Dixon?\" Andrea says in disbelief, as they all leave to investigate. On the roof, Morales and the group find Merle firing at walkers with a rifle. T-Dog chastises him for wasting bullets and attracting more walkers. Merle scoffs at him and calls him a slur, which sets off a fight between the two. Morales tries to intervene but is hit in the stomach as Merle beats T-Dog and presses a handgun to his forehead. Rick intervenes, hitting Merle with the butt of the rifle and handcuffing him to a pipe. Morales informs Rick there's no refugee center and that they are part of a larger group of survivors staying outside the city, but T-Dog can't reach them on the radio. \"We're on our own,\" Rick says. With the streets no longer safe, Rick suggests they try to escape underground. Jacqui says that the building might have access to the sewers, prompting Andrea and the group to head back downstairs to the basement. In the basement, Glenn concocts a plan and he and Morales head down the sewer. In the sewer, Morales and Glenn walk with caution til they reach a grated barrier. They discuss ways to cut through, but they soon abandon the idea when they see a walker devouring a rat on the other side. The walker reaches at them through the grate and they step back. Morales, Glenn, and Jacqui arrive with the others to report that the sewer is not an option. Morales and the group heads to the roof. On the roof, Rick spots a cube van at a nearby construction site. The group discusses the difficulty of moving past the walkers undetected. \"They smell dead. We don't. It's pretty distinct,\" Andrea says. Rick latches onto the concept of scent and how the dead use it to differentiate between themselves and the living. A while later, Morales and Rick collect a dead walker from the alley. Inside, Rick acknowledges the walker's lost humanity and then begins hacking the dead body to pieces with an axe. Morales then helps smear the guts on them. Morales, Andrea, T-Dog, and Jacqui race to the roof to follow Rick and Glenn with a pair of binoculars as T-Dog tries again to radio the others. Suddenly, Morales and the rest watch as rain begins to fall rather heavily and washes the guts' smell off of them. Rick and Glenn fight the walkers and manage to get inside the cube van. On the roof, Morales and the group worries that they're being left behind but celebrate as Rick drives back for them. Morales and the group grab their bags and rushes from the rooftop toward the loading dock, with no concern for unlocking Merle's handcuffs. They manage to get inside the van as the walkers break into the store. Rick drives away from the city as the group catches their breath. They look around at one another and a guilt-ridden T-Dog admits to the others he dropped the key, leaving Merle trapped on the roof, still handcuffed to a pipe. Morales returns to the survivors' camp and is reunited with his wife Miranda and children Louis and Eliza. When Rick and the others debate on how to break the news of Merle's abandonment to his brother Daryl , Morales says they must tell him what happened. Morales starts the conversation about Dale 's watch, saying that he rewinds his watch everyday, even though the world has ended. Morales helps defend the camp from the invading zombies that kill several of the survivors including Amy Harrison and Ed Peletier . Morales, his wife, and their two children make the decision that they will not be going to the CDC with the rest of the group and announce that they will be going to Birmingham in hopes of finding other family members. The group does not like their decision, but Rick gives Morales a gun with a box of ammo, and a walkie-talkie in case they want to contact the group if they change their minds. The Morales family bids farewell to the group and drive off. At some point after leaving the Atlanta camp with his wife and children, Morales' entire family was killed and he became insane over it. Eventually however, Morales would be discovered by the Saviors in a trailer \"sleeping himself to death\" and thus Morales joined them and became loyal to Negan . Morales claimed joining the Saviors gave him a sense of purpose. Morales holds Rick at gunpoint at a Savior outpost and greets him. Rick recognizes him and reminds him he knew him in Atlanta. Morales responds that that was a long time ago and reveals that he has called the Saviors to come back. Morales calls the Saviors in from the courtyard as he continues to speak with Rick. He reveals that his family didn't make it and that he was taken in by the Saviors. He berates Rick for his actions, describing him as a monster and that he is valuable alive. He then turns around to see Daryl, who shoots him with an arrow, instantly killing him.",
        "Death": "Killed By Daryl Dixon As Morales is pointing his gun at Rick and lets his guard down, Daryl sneaks up behind him and shoots him through the head with his crossbow, just as Morales turns around to see Daryl, killing him instantly.",
        "Killed Victims": "This list shows the victims Morales has killed: Numerous counts of zombies and possibly unnamed people",
        "Relationships": "For a more in-depth look at Morales' relationships, read here: Morales (TV Series)/Relationships",
        "Appearances": "",
        "Gallery": "For more images of Morales, please visit Morales (TV Series)/Gallery .",
        "Trivia": "Morales is also the name of a character from Frank Darabont 's film The Mist , which was also portrayed by the same actor . Morales has the longest period of absence than any other character to eventually reappear on The Walking Dead ; having been absent for 6 seasons (95 episodes overall). Morales is, in many ways, a dark inversion of Morgan Jones , both being survivors who met Rick at the beginning of the apocalypse and lost their families as time went on, and in turn lost their minds. Both would meet up with Rick again around the same time frame in Virginia, though whereas Morgan began to find his inner peace and joined Rick, Morales would die a cold, ruthless Savior willing to drag Rick in front of Negan. Michonne Hawthorne hallucinates a life similarly like Morales' life in \" What We Become \" where she is found by the Saviors after all she had lost and became a ruthless Savior lieutenant to Negan, although unlike Morales, she did not know Rick until she became a Savior. Morales is the fourth Atlanta camp survivor to later become an antagonist, the first being Merle Dixon , the second being Ed Peletier and the third being Shane Walsh . Morales is the only traitor to the survivors with no remorse for his actions, even before his death. Morales is also the first member of Rick's group to become a Savior , the second being Eugene Porter . With Morales' death, there are no surviving members of his family. Ironically, in Season 1, Morales tells Rick that he'd face the wrath of Daryl for leaving Merle behind. In Season 8, Morales ends up facing Daryl's wrath after holding Rick at gunpoint which results in his death. He is one of thirteen characters known to speak Spanish in the TV Series . The others are Rosita Espinosa , Juanita Sanchez , Gabriel Stokes , Judith Grimes , Dante , Miguel , Felipe , Guillermo , Abuela , Vazquez , and the Mexi can Family ."
    }
]