[
    {
        "Morgan Jones": "Morgan Jones",
        "Overview[]": "Before the apocalypse, he was a loving family man who provided for his wife and son. But the apocalypse took its toll, and after his wife was turned into a zombie, he was able to cope due to him still having his son, Duane, to look after. Morgan was like Rick Grimes in some ways as they were both survivors doing all they can to provide for their family and to keep them safe no matter what. Now Morgan's inner demons are on the brink of escape as the world spares him no horrors, his severe PTSD repressed only by his steadfast commitment to Aikido. While a good man at his core, Morgan struggles immensely with mental illness brought about by trauma. After Rick left to find his family in Atlanta, Morgan began to get reckless, which eventually led to the death of his son. The next time Rick encountered Morgan, he was a changed man, who had become insane and intensively grief-stricken with the death of his family, so he claimed to redeem himself by killing all of the zombies in King County, though Morgan was shown to also have turned into a cold blooded murderer who killed anyone who got in his way, even if they were harmless survivors as seen when he savagely murdered two survivors for following him into the woods. It was only after meeting a peaceful survivor named Eastman that Morgan was able to reclaim his sanity and in which he developed his code to never kill human beings again. It was from Eastman that Morgan learned Aikido and with these skills, he is now an extremely formidable fighter, being able to fend off both the walkers and human threats with his signature weapon, a wooden staff . Morgan would go on to impart these skills to Benjamin and his brother Henry , the latter of whom passed on Morgan's lessons to his girlfriend Lydia , keeping Morgan's legacy alive even after his departure. Following the reclaiming of his sanity and Eastman's death, Morgan set out on a journey to find other people at Eastman's request. After the long journey and being turned away from Terminus thanks to a sign for the community redesigned to warn that it was no sanctuary and finding a map to Washington, D.C. , with Rick's name on it, he set out on a quest to find his friend. Morgan at this point viewed every human life as precious and refused to commit murder in order to survive as seen when he refused to kill two members of the Wolves who had attempted to kill him as he was camped out in the woods. When he is brought to the Alexandria Safe Zone by recruiters Daryl and Aaron, he finds Rick executing Pete Anderson , an act that visibly shocked him. Following this, Morgan takes a strong role in the community of Alexandria and with his fighting skills, is a strong survivor and protector willing to do anything to keep good people safe from harm but still stubbornly refused to kill those who indeed pose a threat to the security of his group as shown when he allows a group of Wolves to leave the Safe Zone following their brutal attack, which almost leads to the death of Rick. He also keeps the leader of the group, Owen, alive even after the latter makes it clear that he still intends to slaughter every survivor in the safe zone and enlists the help of Denise to treat his infected wound. Morgan's refusal to commit murder and desire to prevent others from committing murder was so strong that he even prevented his ideological nemesis, Carol , from killing Owen by getting into a physical confrontation with her over his life and knocking her out. Morgan was also greatly against the idea of killing the Saviors and seeks to build a jail cell to hold human threats captive instead of killing them. Despite his conflict with Carol, after she flees the safe zone, Morgan personally goes on a mission to bring her back. Finding her in a critical condition he saves her life by killing a member of the Saviors named Roman after he refuses to surrender. Morgan regretted having to break his oath, but assessed that he had no other choice in order to protect Carol. Upon finding the Kingdom, Morgan continues to care for Carol despite her cold behavior and takes an active role in the community and develops a close bond with Benjamin , training him in Aikido just as Eastman had taught him. In spite of killing Roman, the Savior who attempted to kill Carol, Morgan desperately tries to hold onto his code of not killing humans and simply goes along with the Kingdom's servitude to the Saviors. He also did not want to fight back against the Saviors as he rejects Richard's plans to fight and also disagrees with Rick's plan of starting a war, showing concern for the many lives that would be lost in the fallout. He even suggests capturing Negan , rather than killing him. However, in \" Bury Me Here \" after his student and friend Benjamin is killed by the Saviors as a result of the actions of Richard, Morgan is severely angered and traumatized and slowly reverts back to his old state of insanity fueled by PTSD. He brutally kills Richard as punishment by strangling him to death and though he claims that the Kingdom will honor the Saviors demands from here on out, he later tells Carol that he is planning to kill them all. Morgan prepares to return to killing by sharpening his staff into a sharpened spear the likes of which he used before meeting Eastman. Fueled by revenge, Morgan actively partakes in the fight against the Saviors and the Scavengers with no qualms of eliminating human threats. Morgan continues to struggle against his demons, mental illness and the consequences of his actions, claiming he feels \"stuck\". By the start of Season 8 , Morgan has become an extremely violent man, willing to do everything, in order to kill every single member of the Saviors. He almost even impales Paul Rovia , in a fight between the two, regarding if they are going to let the Saviors live or not. Morgan's thirst for blood eventually worries those close to him such as Carol and Ezekiel who see how his state of mind is slowly destroying him. His PTSD has started manifesting itself into hallucinations, specifically Gavin, who he threatened to kill but didn't, and Jared, the man who killed Benjamin. At the end of the war, at the suggestion of Paul, Morgan finally relents in killing other people, non-lethally subduing a surviving Savior and, as Paul suggests, adopting a policy of using the sharp end of his staff on the dead and the blunt end on the living. Seeking to reclaim his humanity once again, Morgan isolates himself from other people before setting out on a new journey . Following his losses and the war with the Saviors , Morgan became convinced that he had to stay away from other people as \"I lose people, I lose myself,\" fearing losing his mind again if he got close to somebody and then lost them. As a result, Morgan fought to avoid getting involved with John Dorie and Alicia Clark 's group. He also adamantly refused to kill the living and attempted to keep Nick Clark from seeking revenge , but due to his refusal to get directly involved, it didn't stop him from killing Ennis . Despite his best efforts, Morgan found himself drawn into the conflict with the Vultures and his efforts to protect his new friends turned Morgan away from his isolationist mindset. Before and after the hurricane, Morgan tried to take his new friends back to Alexandria , having accepted that Rick was right and that he couldn't keep running away from those he cared about. While chasing Morgan's Group , Martha attempted to use Morgan's beliefs that he would lose himself if he lost those he cared about against him in order to turn Morgan \"strong\" again. Morgan often expressed this fear and after learning that Martha had poisoned his friends and he potentially couldn't reach them in time, Morgan did indeed nearly lose himself again and kill Martha. However, Morgan regained control, chained Martha up so that she couldn't hurt anyone else and set out to successfully save his friends. After putting the reanimated Martha down, Morgan expressed sympathy for her, knowing that she had been driven insane by people refusing to help her in her own time of need. After reuniting his group, Morgan decided to continue Clayton 's mission of helping people rather than returning to Alexandria. However, the group grew frustrated with their initial lack of success although Morgan refused to give up. He also attempted to help Alicia with her own struggles. After forming the Caravan , Morgan was bolstered by their success and refused to give in to Virginia . Morgan began forming a romantic relationship with Grace , but pulled away from her. After being shot by Virginia, Morgan urged his friends to \"just live\" when it seemed like he would die. Following his near-death experience, Morgan focused on building a safe place for Grace and her unborn child to live and refused offers by Isaac to remove the bullet from his shoulder, feeling that he deserved it. Morgan became more cynical and refused to help Isaac at first, but was convinced that he had a greater purpose due to his unknown savior 's note to him. While fighting Emile LaRoux , Morgan continued to refuse to kill and even offered to allow Emile to execute him in exchange for sparing Isaac and his family. Isaac jumping to his defense caused Morgan to fight back and defeat Emile. Although Emile believed that Morgan wouldn't kill him due to Morgan's pacifist mentality, Morgan decapitated Emile with his own battle axe . After Isaac saved him, Morgan changed, becoming a harder person, but one still dedicated to his friends. Morgan told Virginia that \"Morgan Jones is dead and you're dealing with someone else now\" and stated to Rachel that it felt like he'd been 16 different people over his lifetime. While still dedicated to establishing a safe place for those that he cared about, Morgan became willing to kill again, killing two men in self-defense instead of just knocking them out as he would have in the past and slaughtering 10 Rangers in an attempt to get at Virginia. He later attempted to assassinate his former friend Victor Strand by poisoning, drastically escalating the conflict between the two men. Morgan initially discarded his less-lethal staff in favor of Emile's battle axe, although he later chose to turn his staff into the axe's handle, effectively combining his two weapons, a further sign of his changed state. Morgan later asks John to come back with him to help keep him from losing himself as he works to save their friends. However, despite his change in attitude, for the most part Morgan doesn't descend into the mindset of killing any threat that comes his way that Morgan had previously had when he was willing to kill the living. Instead, Morgan is shown to only kill the living when he has no other choice and to take them down non-lethally if he can. Examples of this are when he only knocks out one of Virginia's Rangers to capture her, doesn't execute Virginia and instead decides to exile her as a sign of a new peaceful future, only knocks Dakota out to save Strand, even going so far as to check her pulse to make sure that she was still alive, and he lets Teddy and Riley go despite their most recent actions as they were no longer a threat to him. Seven years after Mo 's kidnapping by PADRE , Morgan has returned to using a simple staff, albeit possibly because PADRE took his battle axe, and has lost belief in his ability to raise his daughter, instead believing that she's safer with PADRE. While Morgan is outwardly more morally ambiguous now, willing to kill Madison Clark just to ensure his daughter's place and he has been taking children for PADRE, Morgan privately shows that he has retained his morality. While he takes children, instead of just outright kidnapping them from their parents, Morgan only takes ones that have no family left or who are willingly given up in the hopes of a better life for them. When PADRE arrives, Morgan tries to get Madison to flee rather than killing her or restraining her. Morgan has also lost faith in his ability to be a father to Mo, giving her over to PADRE and insisting upon her knowing as little about him as possible, including his real name. Morgan feels that he can't protect her and that Mo is better off with PADRE and adapting to their harsher way of life than with him. When Mo argues, Morgan goes so far as to harshly reveal the truth about her real parents even though he is visibly distressed by it. However, after remembering the events surrounding Morgan giving her up and the skirmish in the present with a herd, Mo insists that he's wrong and can and did protect her, making the hard choice to call PADRE for help in order to save Mo. Even after Morgan and Grace turn her back over to PADRE, Mo doesn't lose faith in Morgan, only pretending to comply with their rules and telling Madison that her father can help them stop PADRE. Subsequently, Morgan admits that he's haunted by his guilt over something that he didn't do a long time which is keeping Morgan from being able to be the kind of father that Mo needs. Although Morgan refuses to elaborate on what it is, he admits that while he can't fix the worst of it, he can fix some of it. Madison helps Morgan to escape from PADRE so that he can fix this issue from his past and become the kind of father that Mo needs him to be. It's later revealed that this is his lingering guilt over the loss of Morgan's family and his inability to put his son Duane to rest. Although Morgan struggles to even face a zombified Duane, he insists upon finishing his mission so that Morgan can know that he didn't let his son down. The experience causes Morgan to experience hallucinations and later despair when it seems like Morgan has lost his chance to put Duane down. Morgan also reveals that he remembers very little of his per iod of insanity , describing it as a blur that he only recalls bits and pieces of. When faced with a zombified Duane who is in danger of biting Mo, Morgan finally brings himself to shoot his son in order to save his daughter. Being able to finally lay his family to rest properly appears to give Morgan a sense of peace about their loss for the first time rather than haunting him further and Morgan commits himself to raising Mo with Grace and to helping Daniel's Resistance take down PADRE. Morgan later states that he thought that laying Duane to rest brought an end to his mental illness problems. After Grace's death, Morgan starts slipping back into his deranged state, although rather than going back into it fully, it manifests more in the form of episodes where Morgan is taken over by red-tinged visions of losing his loved ones - quite literally seeing red - and when he snaps out of it, Morgan has no memory of his actions, but he has attacked both the walkers and the living around him. Morgan greatly fears going back into that state and wants to break the cycle, but he believes it to be impossible to do. After Madison helps Morgan to see that the people that you love are never really gone and that you always carry a part of them with you, Morgan is finally able to break the cycle and permanently snap out of it, even telling Mo to go with PADRE if she really wants to. Following the defeat of PADRE, Morgan, who has been experiencing increasing guilt over leaving his friends behind in Virginia , particularly Rick, he decides to go back to them, entrusting the safety of the friends that he'd made in Texas and Georgia to Madison. Finally, truly at peace with himself, Morgan buries Grace in Eastman's Cemetery and talks to his old friend's grave about just how much he has changed and what Morgan has come to understand. Upon touching Grace's grave, Morgan gets another vision of Eastman, Benjamin , Nick Clark , Isaac , Rachel , John Dorie , John Dorie Sr. , Alicia, Jenny, Duane and Grace - all of the loved ones that he's lost along the way - but this time, instead of being traumatic memories surrounded by red, Morgan is able to remember the better times with them, experiencing fond memories instead of traumatic ones, signifying that Morgan truly is at peace with his losses now.",
        "Pre-Apocalypse[]": "Morgan grew up in Macon, Georgia, although not much is known about his early life. He experienced an average life where he grew to become a hard-working and practical man acquiring skills ranging from construction, craftsmanship, and welding. He was also a serious man who didn't have much luck on the romantic side of his life. As an adult, Morgan fell in love with a woman named Jenny, where they later became married and together they had a son named Duane. The trio lived together as a typical family, where Morgan would spend his time playing with his son and they would go on several family trips. He also received a tattoo of Jenny on his right arm.",
        "Post-Apocalypse[]": "During the onset of the outbreak, Morgan and his family evacuated from their home, upon where they witnessed several broadcasts informing other survivors to travel towards a supposed safe zone in Atlanta . However, due to the chaos and horrendous events which transpired around them, the family was reluctantly forced to take refuge in King County and heavily barricade themselves within a nearby house . At an unknown point, Jenny was bitten and succumbed to the infection. Morgan was unable to put her down and released her into the outside. Following this tragic event, Morgan remained firmly protective of his son and created a sense of normalcy for Duane including correcting his grammar as well as engaging in mealtime prayers.",
        "Killed Victims[]": "This list shows the victims Morgan has killed: Jenny Jones (Zombified) Duane Jones (Indirectly Caused, Alive; Zombified) 40's Man 20's Man (Alive) Eastman (Indirectly Caused; Before Reanimation) Jeffery (Zombified) Owen (Zombified) Young Boy (Zombified, alongside his fellow Alexandrians) Roman Benjamin (Before Reanimation) Richard Savior POW 1 Duke Paulie Gomez Gavin (Indirectly Caused) Keno Savior POW 2 Savior POW 3 Savior POW 4 Jared (Caused) Savior POW 5 (Alongside Rick ) Savior POW 6 (Zombified) Lance (Alongside his fellow Militia members) Duke Bill (Caused) Hardy (Caused) Thin Survivor (Zombified) Lumber Yard Survivor (Zombified) Quinn (Zombified) Jim Brauer (Zombified) Martha (Zombified) Charles (Before Reanimation, alongside Grace ) Ada Johnson (Zombified) Emile LaRoux (Alive) Young Man Cigarette Man Terry (Alive and Zombified) Ed (Before Reanimation, alongside Alicia , Charlie , and Dakota ) Athena Mukherjee (Presumably, Before Reanimation) Thompson (Zombified) Stewart (Zombified) Waters (Zombified) Green (Zombified) Brown (Zombified) Nelson (Zombified) Rachel (Zombified) Power (Zombified, alongside Grace) Rogers (Zombified, alongside Grace) Schindler (Zombified, alongside Grace) Gonzalez (Zombified, alongside Grace) Vaughn (Zombified, alongside Grace) Faz (Zombified, alongside Grace) Yu (Zombified, alongside Grace) Loosen (Zombified, alongside Grace) Bell (Zombified, alongside Grace) Edram (Zombified, alongside Grace) Williams (Zombified, alongside Grace) Cook (Zombified, alongside Grace) Emma (Zombified) Wilt (Zombified) Grace Mukherjee (Zombified) Anderson (Zombified) 1 unnamed Wolf (Zombified) 1 unnamed Viskocil Public Library survivor (Zombified) 27 unnamed Saviors (1 Zombified, 23 Direct, 3 alongside Carol ) 1 unnamed Scavenger 1 unnamed Hilltop resident (Zombified) 1 unnamed member of Leland's Group (Caused) At least 5 unnamed power plant workers (Zombified) 9 unnamed Pioneers (1 Zombified, 8 Alive) 4 unnamed cultists (1 Zombified, alongside Victor Strand ) Many unnamed USS Pennsylvania crewmembers (Zombified, most alongside Grace) 1 unnamed Stalker (Zombified) 2 unnamed CRM soldiers (1 Alive) 1 unnamed patrolman of Alicia's group (Zombified) 6 unnamed Tower residents (Caused, alongside Alicia , Dwight and Sherry ) 3 unnamed members of Wilt's Posse (Zombified) 2 unnamed PADRE guards Many unnamed U.S. Army soldiers and PADRE adults (Zombified) 1 horse Numerous counts of zombies and unnamed people",
        "Appearances[]": "",
        "Trivia[]": "Morgan is the first character in The Walking Dead universe to use the definition walker for a zombie on-screen. Morgan is also the first character in both The Walking Dead and Fear the Walking Dead to call zombies walkers. Chronologically, he is also the first character seen to kill a zombie. The name Morgan is a descendant male name from the old Welsh \"Morcant\" which is derived from mor meaning \"sea\" and cant meaning \"circle\". Morgan heavily suffers from PTSD (Post Traumatic Stress Disorder) as a result of losing his entire family to the outbreak. Morgan has been shown to display noticeable signs of mental instability as evidenced by his psychotic breakdowns and mercilessly murdering innocent survivors whom he encountered before his encounter with Eastman . Morgan is one of only two characters, along with Rick , who appeared in the pilot and are still alive, though both characters are no longer apart of the TV Series anymore. Morgan is the second longest living character in the series. Morgan is currently the longest living character in the Television Series, who was not a member of the original Atlanta survivor group. Morgan's signature weapon is a wooden staff , hand-crafted by Eastman that underwent a number of changes over the course of The Walking Dead and Fear the Walking Dead , as Morgan himself acknowledges in \" All I See Is Red \". In \" Here's Not Here \", the staff was originally one of Morgan's spears before Eastman turned it into a staff. In \" Bury Me Here \", Morgan sharpened the end after Benjamin 's death. In \" The Hurt That Will Happen \", Grace takes the staff away from Morgan after he uses it to put down a radioactive walker, making it too dangerous to use. Morgan is subsequently without his original staff until he retrieves it in \" Is Anybody Out There? \". In \" Is Anybody Out There? \", Grace breaks it in half in order to get rid of the radioactive half of the staff, making it safe for him to use again. From \" Channel 4 \" to \" Today and Tomorrow \", Morgan uses the remaining half of his staff only. This rather humorously causes Morgan some issues in \" You're Still Here \". In \" Today and Tomorrow \" and \" Channel 5 \", the staff is repaired with a new second half by Terrence , a woodworker amongst the Pioneers . Virginia assures Morgan that Terrence stated that the joint holding the two halves together would hold up to anything Morgan could throw at it. The repair is seamless and can only be seen because the new part of the staff is of a lighter color than the old part. In \" The End Is the Beginning \", Morgan abandons all use of the staff in favor of Emile's Battle Axe . In \" Alaska \", Morgan adds the blade of Emile's Battle Axe to the blunt end of his staff, effectively turning the staff into the axe's new handle and creating a double-ended weapon that is highly effective against both the living and the dead. In \" USS Pennsylvania \", the axe head is accidentally broken off by Victor Strand in a struggle. Subsequently, Morgan uses his staff only while Strand uses the axe head. Morgan uses just his staff in \" The Beginning \" as well. Between \"The Beginning\" and \" Cindy Hawkins \", Morgan repairs his broken battle axe off-screen, adding a metal ring close to the point of his staff for an unknown reason. Morgan appears to be religious as evidenced by him saying grace before his meal with Duane and Rick, and he silently prayed in Father Gabriel's church. Morgan is implied to be a vegetarian, although this was presumably influenced by Eastman. Morgan also owns a rabbit's foot which acts as a good luck charm which was originally a gift from Eastman's daughter which was later handed to him after his death. Morgan appears to possess a reasonable knowledge of construction and craftmanship as shown by him being able to create several rigged traps throughout King County as well as being able to build a fortified cell in Alexandria self-handedly. After being trained by Eastman, Morgan is highly proficient in Aikido and thus has proven to be a skilled combatant, being able to engage multiple opponents in combat simultaneously including multiple members of The Wolves and later The Saviors. Morgan has killed the seventh largest amount of living characters on the TV show with a total of at least 45 victims, The Governor has the sixth largest with at least 62, Rick has the fifth largest with at least 68, Daryl as having the fourth largest with at a total of 110, Carol has the third largest with at least 124, Simon has the second largest with a total of at least 172, Negan has the largest with a total of at least 230. According to his interview on Talking Dead , Lennie James trained for his fight scenes with Stephen Ho, one of the original Teenage Mutant Ninja Turtles. The scene in which Morgan appears to shoot his wife is shot from the same angle, and is almost identical, to a scene in the episode from Jericho called \"Crossroads\" where the same actor, portraying Robert Hawkins, is defending the town of Jericho. According to Talking Dead , the producers originally planned for Morgan to appear in the second season , however, Lennie James was too busy to be able to reprise his role as Morgan at the time. Although there were discussions about Morgan possibly making a physical appearance in Season 11 , in the end, it was decided that he would only appear in a flashback scene in the final episode of the series along with having a line saying, \"We are the ones who live\" with many other characters. Morgan has the most disappearances and reappearances out of any main character in The Walking Dead . Morgan is one of the nine TV Universe characters to appear in Fear the Walking Dead , the others being Paul Rovia , Carol Peletier , Rick Grimes , Dwight , Sherry , Jenny Jones , Duane Jones , and Negan Smith . Morgan is the sixth main character to outlive his comic book counterpart , with the first being Shane Walsh , the second being Carol Peletier , the third being Tyreese Williams , the fourth being Beth Greene , the fifth being Judith Grimes , the seventh being Abraham Ford , the eighth being Rosita Espinosa , the ninth being Ezekiel Sutton , the tenth being Alpha , the eleventh being Gabriel Stokes , and the twelfth being Rick Grimes . Morgan is one of three main characters with an unknown status, the others being Dwight and Anne . Morgan, Rick Grimes , Daryl Dixon , and Carol Peletier are the only confirmed survivors of the outbreak introduced in Season 1 to not die in the TV Series . Morgan currently owns the book The Art of Peace . He gave the book to Nicholas Clark , but he died shortly after. Morgan traveled 166 days from Virginia to Texas upon encountering John Dorie. In Season 6, Morgan abandons his staff as his primary weapon for the first time since his initial return in The Walking Dead in favor of using Emile's Battle Axe . However, Morgan ultimately combines his old weapon and his new weapon by getting rid of the axe's original handle and replacing it with his staff as the new handle. As of \" Things Left to Do \", Morgan has more appearances in Fear than he does in the TV Series. Morgan is one of two main characters to end the Fear the Walking Dead with an unknown status, the other being Alex . Morgan appears in a total of 99 episodes across all Walking Dead shows.",
        "References[]": "",
        "Name": "Morgan Jones"
    }
]