[
    {
        "Mr. Gilbert": "",
        "Fate": "",
        "Contents": "",
        "Pre-Apocalypse[]": "Nothing is known about Mr. Gilbert's life prior to or as the outbreak began, except that he was an elderly man who lived in a nursing home and suffered from asthma.",
        "Post-Apocalypse[]": "After the onset of the outbreak, Mr. Gilbert and the other residents were abandoned by the nursing home staff and left in the care of Felipe, Guillermo , and the Vatos gang members. While Rick Grimes , T-Dog , and Daryl Dixon stand-off in a confrontation with Guillermo and his men over Miguel , Glenn Rhee , and the bag of guns, Abuela rushes out in search for Felipe, worried for Mr. Gilbert, who needs his inhaler. He has began to suffer an asthma attack. Rick follows Felipe and Abuela to the nursing home where he sees the elderly being cared for and sees a group of people trying to comfort Mr. Gilbert and help him with his breathing. The old man receives an inhaler and recovers from his asthma attack.",
        "Death[]": "Killed By Unknown Cause At some point, everyone at the nursing home was killed. [1] Although it is not known how Mr. Gilbert died, in a deleted scene for \" What Lies Ahead \", Rick's group returns to the nursing home to find all of the Vatos dead due to another unknown group of people having executed them and walkers invading the nursing home afterwards. It's possible that this event still happened (sans Rick's group returning after the CDC explosion).",
        "Killed Victims[]": "This list shows the victims Mr. Gilbert has killed: Possibly a few zombies",
        "Relationships[]": "Atlanta Nursing Home Guillermo † - Leader Miguel † Felipe † Jorge † Abuela † Atlanta Survivor Camp Rick Grimes Glenn Rhee † Daryl Dixon Theodore Douglas †",
        "Appearances[]": "\" Vatos \" (No Lines)",
        "Trivia[]": "Mr. Gilbert is one of five characters known to have asthma in The Walking Dead , with the other four being Kara , Warren Bedford , Noah , and Tess' Son .",
        "References[]": ""
    }
]