[
    {
        "Mrs. Blake": "",
        "Pre-Apocalypse[]": "Little is known about Mrs. Blake's life prior to or as the outbreak began. At some point, she married Philip Blake and had a daughter named Penny . It is mentioned by Philip that she died in a car crash around eighteen months before the outbreak.",
        "Post-Apocalypse[]": "Since Mrs. Blake died and was buried before the outbreak began, she has not made any appearances, except in photographs and having been mentioned in conversations. The Governor looks over Woodbury from his apartment window as he sips from a glass of whiskey. He walks past Rowan , who is lying naked in his bed, and gazes at a framed photo of his wife and daughter before entering an adjoining, private room. When Michonne Hawthorne enters the Governor's apartment to retrieve her katana, she sees the picture of his family. When Andrea goes to talk to the Governor, behind him are pictures of his family on display. At the beginning of the episode, Andrea looks at the photo of the family of the Governor and also has a bit of remorse towards his wife. A picture of the Governor along with his wife and daughter is shown throughout this episode because he kept it with him after burning down Woodbury. When he finds shelter in the apartment building, he places it on the table beside the couch he sleeps on after he folds over the part he is in. When Lilly Chambler sees the photo and goes to pick it up, he quickly snatches it away and hides it in his pocket. Later on, he looks at the photo one last time before burning it and dumping the burnt remains of it out of the apartment window.",
        "Death[]": "Killed By Car Accident (Pre-Apocalypse) One day while out driving, Mrs. Blake got into a car accident and was fatally injured, which devastated Philip and Penny. Since she died eighteen months before the outbreak, her body never had the chance to reanimate.",
        "Appearances[]": "",
        "Trivia[]": "Mrs. Blake has not been credited, but behind-the-scenes videos have revealed that the woman in the photograph portraying Mrs. Blake is producer Denise Huth . Mrs. Blake is one of the few people that are known to have died before the apocalypse in the TV Series . Mrs. Blake is also the only miscellaneous survivor both seen and named to have died before the apocalypse began."
    }
]