[
    {
        "Mrs. Martens": "Mrs. Martens",
        "Overview[]": "Mrs. Martens is a solemn woman. After Sebastian Milton is exposed to having sent tons of people to their deaths for his own personal gain, including her own daughter , Mrs. Martens and her husband lead many protests demanding justice for his daughter's death and anyone else who was effected by Sebastian's actions. Compared to her husband, she is much more quiet and soft-spoken, but still stands by him nonetheless.",
        "Pre-Apocalypse[]": "Nothing is known about Mrs. Martens' life prior to or as the outbreak began, except that she was married to her husband and had a daughter .",
        "Post-Apocalypse[]": "At some point during the outbreak, Mrs. Martens joined a community in Ohio. Mrs. Martens and her husband are among the dozens of people protesting in Union Square. She demands justice for the death of her daughter and that Sebastian be held accountable. As Governor Milton attempts to leave the train station, Mrs. Martens and her husband and several people make their way into the station and confront her as she walks down the stairs. While she and the rest of the protestors are kicked back outside, she remains at the demonstration until everyone is ordered home by Henderson due to an oncoming herd. That night, Mrs. Martens attends a memorial for her daughter at Union Square alongside her husband and several other city residents. Henderson and a group of soldiers once again order the residents home for violating curfew and that the herd is still a threat outside the walls. When most people refuse to leave, tear gas is deployed, sending everyone scrambling. Mrs. Martens and her husband are among the Commonwealth citizens at Union Station when Pamela Milton announces the arrest of Lance Hornsby and delivering justice for the loss of April and so many others, to which Mrs. Martens applauds. A frightened Mrs. Martens is one of the Commonwealth residents gathered at the entrance to the Estates begging to be let in as the herd approaches. After convincing Pamela 's forces to stand down, Daryl and Gabriel let Mrs. Martens and the others into safety.",
        "Killed Victims[]": "This list shows the victims Mrs. Martens has killed: Possibly numerous counts of zombies",
        "Appearances[]": "\" Lockdown \" \" A New Deal \" \" Rest in Peace \"",
        "Trivia[]": "This character is credited as April's Mother in all of her appearances.",
        "Name": "Mrs. Martens"
    }
]