[
    {
        "Overview[]": "Nabila is a kind and sweet woman. Though initially just a gardener, she eventually goes on to become a soldier for the Militia . She is a loving wife to her husband Jerry and caring mother to her children, usually seen taking care of them. Nabila is shown to be extremely brave and willing to risk her life for what she believes in. Examples of this are her joining the Militia and Ezekiel's rebellion against the sadistic Warden in Alexandria , bravely standing in front of a firing squad to protect Negan and Annie .",
        "Pre-Apocalypse[]": "Nothing is known about Nabila's life prior to or as the outbreak began. She was likely a follower of Islam before the start of the apocalypse, as it's unlikely she became devout after it commenced.",
        "Post-Apocalypse[]": "At some point in the apocalypse, Nabila joined a community called the Kingdom where she became a gardener. Nabila approaches Ezekiel as he observes the Kingdom from a second-story balcony but is cautious due to Shiva lounging nearby. Despite being reassured by Ezekiel that Shiva likes her, Nabila still chooses to remain a distance away. Nabila then informs Ezekiel that the Kingdom’s gardens are infested with weevils and the crops in the garden are therefore ruined. She suggests they replant the crops in the garden while acknowledging how important the gardens were to Ezekiel. Later that day, she and other gardeners start removing the plants as Ezekiel watches on. Nabila is among the Kingdommers to gather in the center of town and listen to Ezekiel's speech about his confidence in the militia. She smiles as she listens and cheers with the other townspeople. When Ezekiel, Carol , and Jerry return to the Kingdom later that day, Nabila gathers with the other townspeople and is saddened by the loss of the Kingdom army. Nabila pays her respect to her friends and neighbors who were killed at the Chemical Plant Outpost as she stands at a fence that has been turned into a memorial. As Gavin is saying his speech to the Kingdommers, Nabila looks around knowing Ezekiel will be there. When Ezekiel rams the school bus, Nabila subdues a Savior and takes his gun. She runs and finds Carol and tells her that Ezekiel is back there. Carol tells Nabila to take the rest of townspeople to safety and Carol will meet her there. Nabila then flees the Kingdom with the rest of the group to the safe house. Having escaped into the woods with the other Kingdommers, Nabila listens to Carol as she instructs her to head to her cottage, assuring her the Saviors don't know about her hideout. Nabila asks if Carol is going back to face the Saviors by herself and when Carol says yes, Nabila replies that the Saviors don't stand a chance against her. Nabila then leads Henry and the other Kingdommers off to the cottage. Nabila is among the Kingdommers to have evacuated to the Hilltop Colony . She works alongside other Kingdommers and Hilltoppers as they help with improving the town's defenses. After the arrival of the Alexandrians, she gathers by some vehicles and chats with Barbara , Kevin , Bertie , and other Hilltoppers. Nabila and Oscar walk around the Hilltop as they recover after the Saviors' deadly attack on the town. That night, she is among the residents and refugees to survive the outbreak that occurred due to the Saviors' tainted weapons infecting and turning several people. Nabila carries a pitchfork as she walks by Daryl and Tara towards the Barrington House. Nabila accompanies Rick and the rest of the militia to fight the Saviors in the final battle. After most of the Saviors are wiped out due to Eugene 's faulty bullets, Nabila and the others fight the surviving Saviors until they surrender. She watches on as Negan is defeated and captured while Rick addresses the crowd, declaring peace among all communities. Afterwards, Nabila returns home to the Kingdom. Having moved from the Kingdom to the work camp along with several other residents, Nabila is part of the team of laborers working to build a bridge connecting the communities' trade routes. One morning as Rick travels through the camp, she gives Jerry a hug and kiss before seeing him off to his work duties. When a group of walkers suddenly ambushed the lumber yard, Nabila is among those to arrive in time to save Daryl , Jed , another Savior, and the injured Aaron . At night, Nabila plays a board game with Jerry and Henry around the campfire. When the work camp is informed of Justin 's death, Nabila watches as the Saviors become furious and start accusing Daryl and Anne of being the culprits. Before a conflict can ensure between the different sides, Rick rides in the middle of the group with his gun drawn and warns everyone to back off. In the years following Rick's assumed death, Nabila and Jerry had three children. Six years later, Nabila spends time with Jerry and her children in the Kingdom as everyone is setting things ready for the fair. She then watches as Jerry leaves on a deer hunting mission. At night, Nabila sleeps as Jerry hold their daughter from her crib. Nabila and Carol walk and chat about the upcoming fair when they notice Jerry and several other soldiers back early from patrol but without their armor on. She listens as Jerry reveals to the gathering of concerned citizens that a group of the Highwaymen had robbed them of their armor and gear. Later that day, Nabila welcomes the first half of the Hilltop delegation and their escorts to the Kingdom. She chats with Earl and Tammy Rose about the abandoned Whisperer baby when Tammy remarks that she cares for the baby and would like to care for it, to which Nabila smiles delightfully at the prospect. Nabila watches from the crowd standing next to her husband and holding their baby as Ezekiel declares they've finally accomplished Rick , Carl , and Jesus ' dreams of reuniting the communities. \"Let the fair of a new beginning begin!\" Ezekiel says as everyone celebrates and applauds. At the fair, Nabila is asked by Michonne to look after Judith . Later that day, she and Jerry walk around some booths and talk about how they are surprised at Michonne's decision to finally allow Alexandria to come to the fair. At some point during the fair, Eugene and Alice approach Nabila asking her if she had seen Frankie recently, to which Nabila shrugs and looks around. That night, Nabila and her family alongside Judith attend the theater and watch the movie. The next day, Nabila listens from the crowd as Siddiq delivers the tragic news about the fate of the missing fair attendees, tells them how brave the victims were in their final moments and how he was intentionally kept alive to tell this very story. He encourages everyone to remember the fallen as brave heroes and to honor them. Several months after the fair massacre, the Kingdommers are forced to abandon their fallen community due to an incoming blizzard and move to the Hilltop. When snow starts falling later that day, Nabila and the convoy is forced to take shelter inside the Sanctuary for the night where she helps her family rest and stay warm. Later that night, the convoy leaves the factory and is forced to cross into Alpha 's territory. When they encounter a frozen lake, members of the group kill walkers that emerge from the snowbanks before the whole convoy manages to escape safely across the ice. Nabila embraces her family, glad for their safety. The next morning, Nabila and the convoy finally arrive at the Hilltop where she spends time with her family in their new community. Nabila is alerted to the commotion of a tree falling onto a house and a portion of Hilltop's walls. She then helps the other residents rescue the trapped injured from the rubble. The next day, Nabila and the other residents kill the incoming walkers with the help of the Alexandria convoy when the herd invades the community that night. Nabila carries a box of radio equipment to the attic of the Barrington House at Hilltop. She helps Eugene set up a new relay station at Hilltop before returning to care for her children downstairs. Nabila attends an emergency meeting in the Barrington House with the leaders of Hilltop and Alexandria and other concerned residents. She listens as the other discuss what to do in the face of the impending Whisperer threat. After it is decided that they evacuate the children and make a stand at Hilltop, she joins the caravan with her three children only to be brought back to Hilltop after finding a roadblock and the zombified bodies of Felix and Penny hanging from a tree. At Hilltop, she remains inside the Barrington House with the other children and parents and witnesses Alden refusing to allow Mary to see her nephew. When the Whisperers and their horde attack the Hilltop at night, she remains inside the Barrington House for shelter. Nabila is among a group of survivors consisting of Rosita, Daryl, Dianne, Jerry, Mariam, two Hilltop women, and two Alexandrian soldiers trudging through the wilderness as they attempt to reach the rendezvous point to find Ezekiel, Earl, and the children, including her son Ezra and daughter Aliyah. Having been injured with burns from the Hilltop battle, Nabila struggles on the journey to the rendezvous point, expressing her grief as she yearns to be reunited with her children. Upon reaching a rendezvous point with no signs of the children, she begins to break down and panic as Jerry attempts to calm her down. She stays behind with Mariam and the women as Ezekiel, Jerry, Daryl, and the others search the area for the children. Nabila meets up with the others at the rendezvous point. She and the other Hilltop survivors welcome Magna back and later listens to Eugene as he explains that he has been talking to a woman over the radio and plans to meet her as he believes she can help them. Nabila is among the Hilltop survivors to relocate to an abandoned hospital referred to as the \" Tower \" where she and her family, and dozens of others, seek refuge on the upper floors of the hospital. As a group of survivors enact a plan to lure the herd away, others defend the hospital from the Whisperers and snipe as many as they can from the windows. When the Whisperers eventually break into the hospital, Nabila and the others are evacuated safely from the hospital via the elevator shafts and basement tunnels. After Beta and the Whisperers are wiped out, the remaining survivors congregate in the woods where the injured are treated and families are reunited. Nabila sits with her children as Bertie greets them and chats with the family. A short time after making it to the rendezvous in the woods with the other survivors, Nabila accompanies Barbara and Lydia to Alexandria, as she is among the refugees assigned to live there after Hilltop was destroyed by the Whisperers. After running into a minor obstacle on the road, they are helped by Negan and resume their journey as Maggie and Judith emerge from the woods. A few days later, Nabila helps clean up the destruction in Alexandria left behind by the Whisperers. She works alongside Barbara, Carol, Negan, Lydia, and several other residents when Daryl returns with Kelly and Maggie’s group. She then watches as Maggie, her son Hershel, and the other members of her group enter Alexandria through the fallen wall and begin to explore the streets of their new home. Nabila is among the Alexandrians seeking refuge from the storm inside Aaron's house. She and her neighbors help secure the windows and keep the children calm as the storm rages. After some very loud thunder, Nabila rushes to attend to the crying babies in another room. Later, with the storm worsening, Rosita makes the call to evacuate everyone to the second floor. Nabila and Barbara grab the babies Mariam and Adam and flee up the stairs. Nabila and her family are among the Hilltop refugees to move from Alexandria to the Commonwealth after accepting Lance's offer. A month later, she and her family are enjoying the Halloween festivities outside of Union Station in the city. She watches on as her husband plays with their kids at the petting zoo with Ezekiel while holding a sleeping Mariam. When Ezekiel gives Shiva's collar and chain to Ezra, she smiles on at the generosity of their family friend. Nabila and her three children attend the Founders' Day celebrations in Union Square, with her two eldest children playing in the petting zoo. Later, she and her family watch the wrestling match with Ezekiel and Carol until a zombie outbreak caused mass panic in the square. Holding Mariam in her arms, she and her children follow Ezekiel through the crowd to safety. Nabila is amongst the prisoners enslaved at Alexandria . During the day, she works beyond the walls in laying train tracks. That night, when Ezekiel leads a revolt against the Warden , Nabila joins him in standing in front of Negan and Annie by the windmill, standing next to Tyler Davis , Magna , and Princess , among several others. The morning after being freed from Commonwealth captivity, Nabila stands outside with many other liberated Alexandrians and Commonwealth exiles. She is with Aliyah and Gracie as they say goodbye to Ezekiel, who is part of a team headed to the Commonwealth to rescue Nabila's daughter and the other children. A year after Pamela Milton 's defeat, Nabila and her family happily walk through the streets of Alexandria , while her children play in the streets with the other kids.",
        "Killed Victims[]": "This list shows the victims Nabila has killed: Numerous counts of zombies",
        "Appearances[]": "",
        "Trivia[]": "Nabila is the first named Muslim character to be introduced on the show. Nabila is one of the thirteen characters in the TV universe to be pregnant during the events of the apocalypse. The others being Maggie Rhee , Lori Grimes , Eileen , Ava , Vida , an unnamed Sanctuary Worker , an unnamed Kingdommer , Jane Carroll , Michonne Grimes , Rosita Espinosa , Grace Mukherjee , and Rachel . Also with a total of three children, Nabila is the only known survivor to get pregnant and have a child more than once in the apocalypse. Nabila is one of eight characters introduced in Season 7 that are confirmed to be alive, the others being Ezekiel Sutton , Jerry , Dianne , Theresa , Douglas , Rachel Ward , and Cyndie . Nabila is mentioned by Jerry in \" Out of the Ashes \" when he finds one of her headscarves in the cellar at Hilltop. Nabila is mentioned by Ezekiel in \" The Lucky Ones \" when he shares with Carol that Nabila and Jerry prepared him a buffet dinner. In \" Variant \", Aaron suggests that a new Kingdom at the Ye Old Renaissance Faire could be led by King Jerry and Queen Nabila instead of King Ezekiel and Queen Carol.",
        "Name": "Nabila"
    }
]