[
    {
        "Neil": "",
        "Pre-Apocalypse[]": "Nothing is known about Neil's life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "At some point in the apocalypse, Neil somehow came into contact with a group named \" the Saviors \" which he subsequently joined. Neil aided his group in terrorizing other survivors and communities around the area into subjugating to Negan 's will, where their victims would be forced to give half their supplies in exchange for not being murdered. Neil is among the Saviors in Dwight 's group who ambushes Denise Cloyd , Daryl Dixon , and Rosita Espinosa on the road and offers to trade the captured Eugene Porter in exchange for being taken to the Alexandria Safe Zone . Neil is ordered by Dwight to check out the nearby barrels, which he carefully approaches until a gunfight ensues. He is gunned down before he is able to flee with Dwight and the other Saviors. While looking for the missing Daryl, Rosita and the group watches as Neil's body is among the dead Saviors being eaten by walkers at the train tracks. When Rosita and Spencer return to the area in search of Daryl's bike, Rosita notices that Neil, alongside some of the other Saviors that were killed by the train track, had reanimated. All the zombified Saviors, including Neil, attack her but she is able to dispatch them all.",
        "Death[]": "Killed By Daryl Dixon (Alive) After Daryl cuts a Savior's throat open, he picks up an AK-47 and shoots Neil multiple times. Rosita Espinosa (Zombified) A zombified Neil is found in the woods by Rosita and is put down.",
        "Killed Victims[]": "This list shows the victims Neil has killed: Numerous counts of zombies and unnamed people",
        "Appearances[]": "\" Twice as Far \" (No Lines) \" East \" (Corpse) \" Service \" (Zombified)",
        "Trivia[]": "When Rosita encounters zombified Neil, his hair is much longer compared to his appearance in \" Twice as Far \". Although in real life this is due to the fact that the Neil's actor Robert Walker-Branchaud had grown his hair out a bit between when he shot scenes for \" Twice as Far \" and \" East \", in terms of the show this can be explained by the fact that Neil's zombified body was beginning to decompose thus giving the illusion that his hair had grown out. Neil is the first named character who is killed by Rosita Espinosa in the TV Series , albeit zombified."
    }
]