[
    {
        "Neil": "",
        "Fate": "",
        "Contents": "",
        "Pre-Apocalypse[]": "Nothing is known about Neil's life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "At some point in the apocalypse, Neil joined a community called the Hilltop Colony where he became the main woodworker and the blacksmith. Neil is working with the blacksmith in the workshop as Rick and his group visit the Hilltop for the first time. He later watches on in horror as Ethan and Rick fight, resulting in Ethan's death. Neil is working out in the yard when Simon and his Saviors enter the town. Neil is out and about in the yard, helping with the farming. Neil joins the others and practice with weapons in Maggie and Rosita 's training class. Later that day, he watches the Saviors take Dr. Harlan Carson back to the Sanctuary with them and proceeds to barricade the fortify the front gate with two other residents. Neil is among the Hilltop residents to accompany Maggie as they liberate Alexandria from the Saviors with the help of King Ezekiel and the Kingdom . After the battle, he listens to the leaders' speeches and rallies with his fellow militiamen. Neil is present and listens to the speeches given by Ezekiel , Maggie, and Rick before their first attack. He travels with Rick and everyone to the Sanctuary to attack Negan and the Saviors. Later, he regroups with Dianne , Jesus , and a group of Hilltoppers and Kingdommers. Neil is among the Hilltoppers to sneak into the satellite outpost that has been reoccupied by the Saviors in order to take it over. He gets into position as the Hilltoppers prepare to assault the unsuspecting Saviors. After a lengthy gunfight, he and his allies are able to gain the upper hand as the Saviors call a retreat. Before Alden , Jared , and the other Saviors can flee, they are captured by Neil and the rest of the Militia. Neil is among the Militia to bring the Saviors back to the Hilltop. He and the rest of the Militia help protect the Saviors from on coming walkers during the travel. Neil helps construct the makeshift prison within the Hilltop's walls to contain the captured Saviors. He watches as the several dozen prisoners of war, along with Gregory , are herded into the prison. Neil is in the car with Jesus, Maggie, and Dianne on their way to the Kingdom when they are stopped by Simon and the Saviors. Despite Simon's threats to kill Jerry , Simon tells Gary to lower his gun and proceeds to shoot Neil in the head, killing him instantly. Maggie requests to use the coffin from the Saviors' truck to transport Neil's body back to the Hilltop. Once back home, his body is buried. Later, Maggie kills one of the prisoners named Dean to avenge Neil.",
        "Death[]": "Killed By Maggie Rhee (Indirectly Caused) Simon Neil is shot in the head by Simon as he attempts to scare Maggie into submitting to his demands.",
        "Killed Victims[]": "This list shows the victims Neil has killed: At least 1 unnamed Savior Possibly a few zombies",
        "Relationships[]": "",
        "Appearances[]": "",
        "Gallery[]": "For more images of Neil, please visit Background Survivors (TV Series)/Hilltop Colony .",
        "Trivia[]": "Neil was an unnamed and uncredited extra throughout Season 6 to Season 8 until he received his name, lines, and credit in \" How It's Gotta Be \". Neil was one of three woodworkers/blacksmiths, along with extras Troy Reuther and Bob Melton, at the Hilltop and became the primary blacksmith in the back half of Season 7. [1] Karl Funk was one of the 12 original Hilltop extras to portray the population in Season 6 before the background cast was expanded for Season 7 and onwards. Neil is the first named character to be directly killed by Simon in the TV Series . Neil appears in the archival footage shown at the beginning of \" Outpost 22 \" as Judith narrates past events of the show to the audience before the episode's story begins.",
        "References[]": ""
    }
]