[
    {
        "Nelly": "Nelly",
        "Pre-Apocalypse[]": "Little is known about Nelly's life prior to or as the outbreak began, except that she was one of Hershel's horses. Hershel used her to work on his farm and help with manual labor. She worked well, but when she got spooked, she took off running, as it is stated by Hershel.",
        "Post-Apocalypse[]": "Maggie takes Nelly out to look for Lori to let her know that Carl has been shot. She appears out of the blue to come Andrea's rescue when she hears Andrea scream and sees her almost being attacked by a walker, She asks for Lori and informs Lori and the others that Carl had been shot. Lori gets on Nelly along with Maggie and heads back to the Green's family farm. Nelly goes along with another horse with Maggie and Glenn as they go in search of supplies in a pharmacy . Daryl takes Nelly out for a ride to look for Sophia. When he comes across a cliff, he sees Sophia's doll sitting in the creek. Nelly sees a snake and gets spooked, throwing Daryl out of the saddle. Daryl falls down the cliff and gets one of his arrows stuck in his side. Nelly then runs into the forest and disappears. Being able to find her way back, Nelly returns to the farm the next morning, which brings up the topic of conversation between Dale and Hershel before Hershel puts her back in her stable and talks to Dale about the Walkers in the barn. Daryl preps Nelly up the next day for yet another search for Sophia, but Carol convinces him not to go and that he should rest after receiving his injury. He gets angry and storms off, leaving Nelly in the stable. With the farm overrun and the barn burnt to the ground, Nelly's fate is unknown. She may have either escaped the farm, or was possibly devoured by walkers.",
        "Appearances[]": "\" Bloodletting \" \" Cherokee Rose \" \" Chupacabra \" \" Secrets \" \" Pretty Much Dead Already \"",
        "Trivia[]": "Most of the cast and crew of The Walking Dead were able to ride this horse due to practice for their roles, as well as for entertainment. It is mentioned that Sarah Wayne Callies , Lauren Cohan , and Norman Reedus got to practice riding Nelly for their scenes with her. [1] [2] Blade , the horse that portrayed Nelly, also portrayed Siggard Family Horse in Season 1 . Nelly is the only named animal to have an unknown status.",
        "References[]": "",
        "Name": "Nelly"
    }
]