[
    {
        "Noah": "",
        "Fate": "",
        "Contents": "",
        "Overview[]": "Noah is shown to be a caring, helpful, and courteous young man. At the hospital , he is one of the only people to be friendly with Beth , and the two hatch an escape plan but only he manages to get out. At one point, he robs Daryl and Carol but has no animosity towards the two and was simply desperate for weapons. After witnessing the deaths of Beth, Tyreese , and his family, Noah becomes a lot more cynical, stating that he doesn't know if he'll make it. When the group arrives at Alexandria , things begin to turn around for Noah. Though he is initially uncomfortable, he eventually eases up. He tells Reg he wants to be an architect and is given a notebook to chronicle the building of Alexandria, writing \"This is only the beginning.\" Unfortunately before he can contribute to the community any further, he is killed due to the cowardice of Nicholas , and ends up being brutally devoured by walkers.",
        "Pre-Apocalypse[]": "Nothing is known about Noah's life prior to or as the outbreak began, except that he and his family had lived in Shirewilt Estates , a walled-in neighborhood within Richmond, Virginia.",
        "Post-Apocalypse[]": "Noah's uncle had ventured outside of their community at some point and never returned, which led Noah and his father to go out on a search mission for him. Their mission eventually led them to Atlanta, where they were ambushed by Dawn Lerner and her officers. Noah was taken by the group while his father was left behind to die. For about a year, Noah worked within Grady Memorial as Dawn's personal assistant, ironing her clothes among other things, while at the same time plotting his escape. Although unseen, Noah arrives at the church with Daryl. He remains hidden in the trees, until Daryl calls for him to come out after Michonne asks where Carol is. Upon meeting Beth Greene for the first time, Noah told her that Dawn helped him, but left his father to die because his father would have been more trouble. Noah is one of only a couple of people at the hospital who are friendly to Beth, he gives Beth a lollipop and clean clothes and tells her about his father and his plans to escape. Later they escape together, climbing down an elevator shaft into the basement and then fighting their way out of the basement. Noah manages to escape but Beth is recaptured by one of the officers. Noah, after escaping the hospital, changing his ward clothes, and constantly avoiding the officers who are searching for him, encounters Daryl Dixon and Carol Peletier as they are scouting a building. He takes Carol's rifle and points it at them. He orders Daryl to drop his crossbow , as he doesn't want to hurt them and he needs the guns. After taking the crossbow and the rifle, he rips off some tents full of walkers to make distance between him and Daryl and Carol. As he runs from them, Carol tries to shoot his leg, but Daryl moves the gun, making her miss the shot and allowing Noah to escape. He later encounters them at another building and as he tries to move a bookshelf that is blocking a door, but gets tackled by Daryl, who pins him down using the shelf. Daryl takes the guns and begins to walk away, as a walker passes through the door and tries to get to Noah. Daryl refuses to save him, but as the walker gets hold of Noah, Daryl has a change of heart and shoots the walker in the head. They free Noah and the boy reveals that he was held at the hospital and that Beth is also there after they ask him about a blonde girl. As they see a wagon from the hospital, they try to exit the building but Carol is hit and taken by the cops. Noah and Daryl hide, and Noah says that they can rescue both Carol and Beth but that they need guns and people, with Daryl stating that they do have both things. They escape the city in a truck, heading back to the church where the rest of Daryl's group is stationed. Noah is shown with Rick 's group at the church, and then they head back to Atlanta. Meanwhile, Shepherd and Lamson investigate the gunshots and find Noah in an alleyway. As they grab him, the Survivors ambushes and holds them at gunpoint. But a hospital car with another officer, Licari , screeches onto the scene and rescues Shepherd and Lamson. The Survivors opens fire and chases the officers, eventually catching all three. Noah joins the group during the prisoner exchange. However, after Beth and Carol are returned, Dawn tells Rick that Noah must be returned to replace Beth. Noah willingly goes, but Rick and Daryl stop him and tell Dawn it's not part of the deal. Noah insists and goes to Dawn. Beth gives him a hug, then turns and stabs Dawn, who shoots and kills Beth. Daryl kills Dawn, and the remaining officers let Noah leave with the Survivors. Noah is still devastated by the unexpected death of Beth. He tells Rick of his walled community of twenty and is accompanied by Rick, Tyreese Williams , Michonne, and Glenn Rhee , to make sure it can become a sanctuary for the group. On the way there Noah and Tyreese talk about Noah's experiences at the hospital and killing. Tyreese also tells Noah of his and Sasha's father, who listened to the stories on the radio about what happened a thousand miles away or down the block. Noah reveals he lost his father in Atlanta, but his mother and twin brothers are still alive in the community. Two miles away, the group parks in the woods to approach Noah's community on foot, off the road, despite Noah assuring Rick that his community is a safe place. Rick declines \"Just in case\". Noah also reveals that they don't have spotters or snipers, just a perch built on a truck parked sometimes upfront. Once he sees the entrance, Noah rushes to the gates and tries to open it, but its locked. After hearing some noises inside, Noah panics and climbs the gates, followed by the rest, only to find that walkers have overran Shirewilt. Noah breaks down in tears, with Tyreese and Rick trying to comfort him. While Rick, Michonne, and Glenn go to gather whatever supply may remain, Tyreese stays with Noah, telling him that he wanted to die after he lost Karen . Noah notices his house and runs towards it, followed by Tyreese. He tries to stop Noah from entering but Noah insists. Inside, they find Noah's mother's dead body. Noah covers her body with a sheet and whispers to her that he tried to get back. Minutes later, Noah finds Tyreese after the latter has been been bitten by the walker who used to be one of his younger twin brothers, whom Noah puts down, stabbing him in the eye with a toy. Noah instructs Tyreese to stay there and goes for the others. He helps them cut off Tyreese's arm and then carrying him back to the car. Noah and the others wait for Daryl, Maggie , and Sasha to come back from the woods. When they run out of gas, the group continues to walk all the way to D.C., hoping to find some place that's safe. While they were still walking, the group sits and waits for Daryl to come back from the woods, when suddenly they all spotted Duke and three other dogs emerging from the woods. Sasha shoots and kills all 4 of them to provide food. Noah tells Sasha that Tyreese tried to help him, saying that they were not gonna make it. Noah looks at Duke's bloody collar in the road with remorse, before the group moves on due to the storm. Noah is first seen pointing a gun at Aaron when he is brought back into the barn. After the cars are brought back to the barn, he is assumed to be riding in the RV when they leave. While the RV is on its way to the Alexandria Safe Zone , Noah gives Aaron medicine for Aaron's boyfriend Eric Raleigh . Aaron asks Noah when he sprained his ankle, to which he answers \"During all this...\". Aaron than tells Noah that they have a skilled surgeon, Pete Anderson , back in Alexandria who could fix his leg. Noah thanks him for telling and leaves the room. At the end of the episode, Noah is seen with the rest of the group waiting at Alexandria's gates. He arrives in Alexandria and is assigned to be a runner. He goes on a dry run with Glenn, Tara Chambler , Nicholas , and Aiden Monroe . He is shocked by how they string up walkers and attempts to kill one who they want alive. He witnesses the fight between Glenn and Aiden. Noah appears at Deanna Monroe 's party feeling uncomfortable and wanting to leave, but Maggie and Glenn assure him that he is with family now. Noah is seen with Reg , Deanna's husband, discussing how he wants to learn architecture from him. Pleased by his approach, Reg gives Noah his notebook for him to write notes. Noah assures Reg that is the beginning and he wants to help build Alexandria in the \"long run\". Noah joins Glenn, Tara, Eugene , Aiden, and Nicholas on a run for micro-inverters, suggested by Eugene to repair the power grid, at a nearby supply store. During the drive there, Tara bothers Noah to tell her what he and Reg were talking about, but Noah resents. The group arrive at the supply store and is impressed with Noah's accuracy as he headshots a walker from quite a distance. As the group enters the store, Noah assists in looking for walkers with Glenn, Nicholas, and Aiden as Eugene and Tara search for the micro-inverter. Aiden spots a walker full-fledged in a military uniform, trying to put it down but accidentally shoots a grenade and the group is caught in the blast. Fortunately, no one is killed but Aiden and Tara suffer major injuries. Noah provides cover fire as Nicholas and Glenn try and rescue Aiden from the bars impaled in him. Failing to do so, Aiden is devoured by walkers as Glenn and Noah run after Nicholas. Stuck in a revolving door, Glenn, Noah, and Nicholas are surrounded by walkers. Nicholas being on one side, while Glenn and Noah are on the other. Nicholas causes the revolving door to turn as he selfishly tries to escape, allowing for the other side to open and the walkers to grab Noah by the leg. Nicholas escapes as Glenn desperately tries to save Noah. Noah tells Glenn to not let him go of his conscience before being dragged out of the door. Glenn is horrified and devastated as he watches Noah get torn apart by walkers. Noah appears briefly in a flashback when Rick reflects on memories with all of his friends while panicking over the possibility that his other friends could be killed by the Saviors . In a hallucination, Rick walks through a floor full of the corpses of his friends and loved ones, among them Noah.",
        "Death[]": "Killed By Nicholas (Caused) Himself (Caused, Sacrifice) While trying to escape from the store, Noah gets trapped alongside Glenn and Nicholas in the rotating doors. Nicholas panics and forces the doors open to escape, allowing the walkers on the other side to grab Noah's leg. Noah allows himself to be pulled from Glenn's grip so that Glenn can survive. Zombies The walkers pull him out and force him against the glass doors, where he is torn apart and devoured in front of a traumatized Glenn.",
        "Killed Victims[]": "This list shows the victims Noah has killed: His younger brother (Zombified) Tyreese Williams (Caused) Himself (Caused, Sacrifice) [1] Numerous counts of zombies",
        "Relationships[]": "For a more in-depth look at Noah's relationships, read here: Noah (TV Series)/Relationships",
        "Appearances[]": "",
        "Trivia[]": "The casting call for this character used the name Burton . Noah was described as \"17-year-old. He may be young, but he's already suffered great tragedy when he lost his leg. Luckily Burton does not let his disability keep him down, and his positivity is infectious to everyone else around him.\" [2] Despite most casting call information being generic in order to keep actual elements of the show under wraps, Noah did go on to \"lose\" his leg, having sprained his ankle after a fall down the elevator shaft of the hospital. Noah was originally planned to only appear in three episodes. [3] A life-sized prop was used for Noah's death scene, as seen on Talking Dead . In order to make this prop, Tyler had to be put in a body cast and held in one posture for half an hour. This process is called \"clay-facing\". During Noah's death scene, a single thumb of one walker pierced the prop's forehead, which could mean Noah's brain had been destroyed. It is unknown if that was intentional, as the prop that appeared on Talking Dead had no puncture in its forehead. In the bonus commentary of the Season 5 DVD, Steven Yeun discusses Noah's death. He says that Noah had indeed let go of Glenn's hand and allowed himself to be devoured, and that Noah's departing words, \"Don't let go\", were meant to tell Glenn to not lose himself. Noah is the last character introduced in the Grady Memorial Hospital to die on-screen. Noah appears in the archival footage shown at the beginning of \" Lockdown \", \" A New Deal \" and \" Outpost 22 \" as Judith narrates past events of the show to the audience before the episode's story begins. Noah appears in the final flashbacks of the last episode \" Rest in Peace \".",
        "References[]": ""
    }
]