[
    {
        "Noah": "Noah",
        "Pre-Apocalypse[]": "Nothing is known about Noah's life prior to or as the outbreak began, except that he lived with his mother at the very least, and had a 'BB gun'/airsoft rifle before his mother confiscated the toy.",
        "Post-Apocalypse[]": "Andrea storms out of the Governor 's apartment to find Karen arguing with Martinez , saying that Noah has asthma and shouldn't fight. Later, when the Governor evaluates all of the able-bodied townspeople to be trained in firearms, Andrea tells the Governor that he has asthma, in which the Governor asks Noah if he has ever fired a gun. Noah replies that he once had a BB gun, but his mother took it away. The Governor pats him on the shoulder, amused, and reassures him that Martinez will be able to train him properly with more advanced weaponry for the upcoming war. When Andrea returns at night in the police car, Noah, on wall duty, is ordered by Martinez to duck. Following the failed prison assault, Noah was among the townspeople murdered by the Governor out on the road after they refused to return to the prison. [1]",
        "Death[]": "Killed By Philip Blake Noah is among the residents shot to death by the Governor after refusing to return to the Prison to continue fighting.",
        "Killed Victims[]": "This list shows the victims Noah has killed: Possibly numerous counts of zombies",
        "Appearances[]": "\" I Ain't a Judas \"",
        "Trivia[]": "Noah's actor, Parker Wierling , was at the Walkers Stalkers event and confirmed he was not Karen's son. In addition to this, during a MTV interview with Laurie Holden and Melissa Ponzio , they also confirmed that Noah and Karen are not related. Instead, Laurie and Melissa speculate on Karen's backstory, suggesting she was a schoolteacher and that is why she cared for Noah. [2] Noah is one of five characters known to have asthma. The other four are Kara , Mr. Gilbert , Warren Bedford , and Tess' Son .",
        "References[]": "",
        "Name": "Noah"
    }
]