[
    {
        "Nora": "Nora",
        "Overview[]": "Nora is a friendly and trusted member of the group. She is quite prominent within the community, seeing as she is a member of the Alexandria Council , and as such helps with making some of the big decisions. She treats her fellow group members with respect and kindness.",
        "Pre-Apocalypse[]": "Nothing is known about Nora's life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "At some point in the apocalypse, Nora joined a community called the Alexandria Safe Zone . In Alexandria , as Michonne and Judith are sitting together on the porch of their house, Nora knocks on their gate. She tells Michonne that crows have been eating about a fourth of Alexandria's tomato crops. Michonne says that the windmill will help once it's built and that she will talk to Eugene when he gets back. Nora also mentions that Negan is refusing to eat food that Scott gave him, to which Michonne replies that she'll handle it. Six years after Rick Grimes ' \" death \", Nora is part of the council that governs Alexandria and she joins the rest of the council in the church as they interview Magna's group before voting on whether or not they should be permitted to join the community. She and the other residents are shocked when Michonne reveals what Magna 's hand tattoo means. In Alexandria, Nora, along with Laura and Kyle , listens as Michonne, Siddiq , and Aaron discuss the new threat , as well as the state of the Kingdom and their invitation to attend the fair. She speaks up and suggests they put the fair invitation up to a vote. Ultimately, it is revealed Nora and the rest of the council decide to send a delegation to the Kingdom to attend the fair. Nora is among the council members to enter the meeting house as the teacher is going over her lessons with Lydia , Gracie , and several other Alexandrian children. The council announces they need to cut class short as they need the space to hold an emergency meeting regarding the discovery of a Whisperer mask in Oceanside. Nora listens as Aaron tells the council that the walkers are coming in constant waves. Michonne tells everyone to take care of it and to remember their training. Later that day at an emergency council meeting, Nora listens as Michonne tells everyone instead of retaliating, she and a small group will meet with Alpha at the border to work things out. Nora is at the dining hall enjoying a meal when Lydia makes a scene by gutting a dead squirrel, upsetting Gage , Margo , and Alfred . She watches as the three leave in disgust before returning to her meal. Later that night, Nora and the council reunite in the meeting house to discuss Lydia's attack. They question Gage and Alfred, who lie and say they were attacked. Gabriel asks why Lydia's the one in the infirmary. They claim to them how their friends got beheaded by the Whisperers and now Margo is dead. The council then lets them go. While the council discusses their vote on Negan's fate, Nora opposes to Negan being spared after explaining her own motives. Daryl arrives and says he believes Lydia, which ties the vote. Gabriel announces he'll take the night to make his decision by tomorrow. Nora attends the funeral service for Siddiq and listens to Gabriel's religious remarks. Standing next to Laura, she silently pays her respects and then leaves the ceremony. Following Beta's attack on Alexandria that left several Alexandrians dead, Nora has not been seen or mentioned since, leaving her fate unknown.",
        "Killed Victims[]": "This list shows the victims Nora has killed: Possibly numerous counts of zombies",
        "Appearances[]": "",
        "Trivia[]": "Nora's character was created and inspired by a writer for the show, Geraldine Inoa . [1] Inoa exited the show as a writer after Season 10 , likely contributing to the negligence of Nora's character. Nora appears in the final flashbacks of the last episode \" Rest in Peace \".",
        "References[]": "",
        "Name": "Nora"
    }
]