[
    {
        "Pre-Apocalypse[]": "Almost nothing is known about Noris' life prior to or as the outbreak began, except that he had a son.",
        "Post-Apocalypse[]": "Noris is among the prison residents to escape Cell Block D during the zombie attack. Noris and other survivors from Cell Block D are sent to the isolation ward set up in Cell Block A. Sent without his son, he anxiously awaits for him while confined to a quarantine cell. Noris is joined by his teenage son in the quarantine ward a short time after he entered with a group of other Cell Block D survivors. When Hershel Greene checks on the survivors, he asks Noris if his son is okay. When Hershel leaves the cell and is attacked by a zombified woman, Noris comes to Hershel's rescue with a handgun, only to get his arm bitten by his zombified son. In panic, he fires in random directions and his crossfire accidentally hits another woman in the chest. His son then starts biting into the back of his neck, subsequently leading to Noris' death. Minutes later, he reanimates and attacks Hershel's daughter Maggie , who puts him down with a shot under the chin.",
        "Death[]": "Killed By His Son (Infected, Alive) As Noris assists Hershel, who is pinned down by a walker, he is bitten on the neck by his zombified son, who then proceeds to devour him. Maggie Rhee (Zombified) While Maggie is running to find Hershel, she stumbles upon a zombified Noris and shoots him under the chin.",
        "Killed Victims[]": "This list shows the victims Noris has killed: Owen's Mother (Alive, Accidental) Numerous counts of zombies",
        "Appearances[]": "",
        "Trivia[]": "Noris is credited as Father in \" Internment \". The name Noris is not used in any dialogue or credits, but it was the name given to Jan Harrelson for his role and can be seen on his professional resume. [1] Jan Harrelson's resume also indicates that he appeared in \"Infected\", although he was not credited. Noris is the only survivor to be killed in the TV series by his own child. In Noris' case, he was bitten by his son. In the entire TV Universe, Melissa Geary from Fear the Walking Dead is the second character to be bitten and killed on-screen by their zombified child, in this case being bit by her zombified daughter, Willa Geary . His death is similar to Douglas Monroe 's death in the Comic Series , in the aspect of accidentally shooting a living survivor while being attacked by zombies.",
        "References[]": "",
        "Name": "Noris"
    }
]