[
    {
        "Overview[]": "Norris is a rough, brutish, and violent person. He takes part in Simon 's massacring of the Scavengers . However, despite this he also takes part in killing Simon's loyalists and capturing Simon himself, showing that his loyalties lie with Negan . After the war , Norris is attempt to work with his former enemies. He ultimately proves to be unable to. After the death of Justin , he is one of most vocal Saviors, accusing Anne of being the murderer. Later, he is in the frontlines when the Saviors attack the camp. This costs him his life when he becomes one of the many casualties in the fight.",
        "Pre-Apocalypse[]": "Nothing is known about Norris' life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "At some point in the apocalypse, Norris somehow came into contact with a group named \"the Saviors\" which he subsequently joined. Norris aided his group in terrorizing other survivors and communities around the area into subjugating to Negan's will, where their victims would be forced to give half their supplies in exchange for not being murdered. When Eugene 's plans successfully divert the herd away from the Sanctuary , Norris is among the Saviors to accompany Negan to Alexandria as they demand Rick's surrender. When negotiations fail, the Saviors launch grenades into Alexandria and they are ordered to find Carl alive. Norris and D.J. spot Carl through the smoke and chase after him. However, Carl is able to escape into the sewer in time thanks to a smoke grande, prompting them to keep searching. Norris and D.J. carry the coffin containing an undead Dean and follow Gary into Negan's conference room. They are ordered to drop off the coffin and leave. Later that day, Norris accompanies Simon to the junkyard where he participates in the massacre that leaves all of the Scavengers dead. Norris is among the Saviors to open fire on the other Saviors planning to overthrow Negan. He also witnesses the fight between Negan and Simon inside the Sanctuary and Simon's subsequent death. Afterwards, Norris helps capture Dwight, who was revealed by Laura to be a mole working with Rick and the survivors. Norris is part of the Saviors' ambush on the Militia. When Norris attempts to open fire, his handgun explodes due to having been loaded with faulty ammunition manufactured by Eugene. He manages to survive, unlike many other Saviors, and intercepts Rick as he chases after Negan. However, Norris is subdued and is among the Saviors to surrender. He then watches on as Negan is defeated and captured while Rick addresses the crowd, declaring peace among all communities. Afterwards, Norris returns to the Sanctuary alongside Laura and the other surrendering Saviors. During the year and a half that passed since the end of the war , Norris was forced to work on the Sanctuary under Daryl 's orders. Having moved from the Sanctuary to the work camp along with several other residents, Norris is part of the team of laborers working to build a bridge connecting the communities' trade routes. When the work camp is informed of Justin 's death, the Saviors become furious and Norris attempts to get past Gabriel and Kal . Norris then accuses Anne of being the culprit, presuming that she is taking revenge for Simon massacring her people. Norris and D.J. grab axes to retaliate when Rick rides in the middle of the group with his gun drawn and warns everyone to back off. Norris, along with the other saviors, leave the camp due to Arat 's death. Shortly after leaving the camp due to Arat's death, Norris and his fellow Saviors manage to disarm Alden while he tried to convince them to return to the bridge project. After discovering that the Oceansiders were responsible for the death of several Saviors, Norris is among the Saviors that return to the camp to enact their revenge. Norris, D.J. and Jed are in the front lines when gunshots go off. Norris fights alongside his companions and eventually dies in the attack. Upon returning to the work camp, Rick finds several reanimated residents, including a zombified Norris. Though weak, Rick manages to put him down.",
        "Death[]": "Killed By Carol Peletier , Jerry , Kathy , or Beatrice (Alive) During the shootout between the rebelling Saviors and members of the Militia, Norris is shot and killed. Rick Grimes (Zombified) With his last forces, Rick manages to shoot a zombified Norris in the head.",
        "Killed Victims[]": "This list shows the victims Norris has killed: Gary (Alongside D.J. and Arat ) Simon (Possibly, Zombified) Numerous unnamed Scavengers (Alongside his fellow Saviors) 10 unnamed Saviors (Alongside D.J. and Arat) Numerous counts of zombies and possibly unnamed people",
        "Appearances[]": "",
        "Trivia[]": "In a promotional image for \" Wrath \", Norris is seen holding Rick at gunpoint near one of the Saviors ' cars at the final battle. This scene was deleted from the final episode. In the Memoriam on Talking Dead for \" What Comes After \", he is credited along with Kathy as Unhappy Camper Walkers . Out of all scenes Norris is present in, there are only three that do not have Norris standing next to or nearby D.J. , whether it'd be at the Sanctuary or the work camp. Those three include when he participates in the Scavengers massacre, him storing guns, and when he is a walker. Norris is possibly Jerry 's last named kill in the TV Series .",
        "Name": "Norris"
    }
]