[
    {
        "O'Donnell": "",
        "Fate": "",
        "Contents": "",
        "Overview[]": "O'Donnell is an abusive, cruel, and condescending bully. He is among the most vicious cops at the Hospital , beating Percy , an old man, after he doesn't stitch a hole properly. It's also mentioned by Dawn that he and his buddies laughed at Joan when she got raped. Eventually Dawn has enough of his behavior and confronts him, causing a fight between the two. With the help of Beth , she and Dawn manage to subdue O'Donnell by shoving him down an elevator shaft.",
        "Pre-Apocalypse[]": "O'Donnell served as an officer in the Atlanta Police Department , and was a close friend and fellow academy rookie to Dawn Lerner . He was married to a wife, and together they had a child who was born in Grady Memorial. During the outbreak he was one of the officers tasked with evacuating the very same hospital, and then staying behind to help sweep the building for remaining civilians. He and his team then witnessed the bombing of Atlanta , and he survived up until the show's events, though not without losing much of his humanity. The fate of his family is unknown but dialogue suggests they were killed during the outbreak as he never mentioned any hope of reuniting with them, which could have been a contributing factor to the loss of his humanity.",
        "Post-Apocalypse[]": "Officer O'Donnell brings in an injured Gavin Trevitt to the hospital with Officer Amanda Shepherd . Later, he is seen walking with Lieutenant Lerner and they check up on Officer Gorman harassing Beth Greene . When Beth tries to flee, she is restrained by O'Donnell as Officers Shepherd and Alvarado dispatch all of the zombies at the hospital entrance. Officer O'Donnell and officer Alvarado are seen patrolling the streets of Atlanta, looking for Noah . When survivor Carol Peletier exits a building, she is suddenly hit by their vehicle. O'Donnell and Alvarado load Carol onto a gurney and put her into the car to take to the hospital. Officer O'Donnell argues with Dawn Lerner over keeping Carol alive, stating that it is a waste of resources. After Beth intervenes, Dawn tells O'Donnell to alert Dr. Steven Edwards that Carol is to be taken off the machines. O'Donnell berates Percy for not properly stitching a hole in his sleeve and shoves him to the ground. Beth looks on. He starts trying to draft her into service, but Dawn calls her away. Beth then walks in on them, catching them in the conversation. O'Donnell says it's time to make a change, that either Dawn can admit the situation to the rest of the officers or he will. Dawn pulls her gun on him and the two argue. He comes after her, knocking her gun down the elevator shaft and the two fight. He starts to get the better of her and Beth steps in to help. When he's distracted by Beth, Dawn is able to seize the opportunity to regain the advantage and punches him in the throat and kicks him backwards towards the elevator. At Dawn's shout, Beth shoves O'Donnell down the elevator shaft, falling to his death. His body may have been eaten by the walkers at the bottom of the shaft.",
        "Death[]": "Killed By Dawn Lerner (Caused) Beth Greene As O'Donnell is fighting Dawn about her leadership, Beth tries to intervene, distracting him. Dawn takes this opportunity and strikes O'Donnell in the throat, before kicking him towards the open elevator shaft, where he is pushed to his death by Beth.",
        "Killed Victims[]": "This list shows the victims Officer O'Donnell has killed: Numerous counts of zombies",
        "Relationships[]": "For a more in-depth look at O'Donnell's relationships, read here: O'Donnell (TV Series)/Relationships",
        "Appearances[]": "",
        "Trivia[]": "O' Donnell is the only named character directly killed by Beth Greene in the TV Series ."
    }
]