[
    {
        "Olivia": "",
        "Fate": "",
        "Contents": "",
        "Overview[]": "Olivia is a kind-hearted, soft, and sweet woman. Like most of the Alexandrians, she is a weak survivor due to her lack of experience outside the walls. During the Wolves ' attack it's revealed that she doesn't know how to shoot a gun. She is shown to be easily pushed around, as she is unable to prevent several residents from raiding the food of the pantry. Overtime, Olivia is shown to become more brave. She helps the group clear out a giant herd inside Alexandria . However, she is still shown to be quite timid, as she is very intimidated by Negan . She is the victim of many demeaning jokes from Negan, causing her to cry. Eventually she gains the courage to slap him in the face.",
        "Pre-Apocalypse[]": "Not much is known regarding Olivia's life prior to or as the outbreak began, except that she had worked seven years at a coffee shop and cured meats in her basement. She also attended school for hotel and hospitality training. [1]",
        "Post-Apocalypse[]": "At some point in the apocalypse, Olivia joined a community called the Alexandria Safe Zone where, upon being interviewed by Deanna , she was appointed as the weapons and supplies inventory manager. When a lonely girl named Enid arrived at the community, Olivia granted her asylum in her house and they lived together. After Rick and Rick's group arrive in Alexandria, Olivia collects their weapons and stores them at the armory while joking that she should have gotten a bigger cart for the guns. Later that day, she witnesses the fight between Aiden and newcomer Glenn at the town's gates. Olivia is woken up early one day by newcomer Sasha to gain access to the armory. As they head to the weapons locker, she talks about her previous job and asks for a leg from a boar to cure meat if Sasha comes across one in the woods. Later that day, Olivia is with newcomer Carol in the pantry gathering ingredients for Carol to make cookies and then signs out a couple of weapons for Tobin and another man. That night, she attends Deanna's welcoming party for the new arrivals and socializes with the other residents and the new arrivals. Olivia is at the armory with Tobin, Spencer , and Francine , listening to Carter 's plan to kill Rick and take over Alexandria. When Rick discovers the complot, everyone accuses Carter of being the only culprit. Olivia is at the pantry with Carol, Erin , and Shelly talking about different recipes. When the Wolves attack Alexandria later that day, Olivia hides in a closet at the armory until she is found by Carol, who enters to gather guns. Before leaving, Carol arms Olivia with a gun and instructs her to shoot anyone she doesn't know who tries to break into the house. Having survived the assault made on the community by the Wolves, Olivia is one of the many townspeople by the front gate, listening to the growing horde gathering outside the walls. She appears to be very concerned about the situation and listens to Rick and Aaron as they address the crowd. Afterwards, Olivia unsuccessfully attempts to prevent several residents from raiding the food of the pantry, though eventually Spencer steps in and is able to calm everyone down. Later that day, she watches in horror as Jessie is forced to put down a zombified Betsy . Olivia is sitting on the staircase of the armory reading a book when suddenly she hears a noise from the pantry. She investigates the pantry and finds that a shelf toppled over. As she begins to clean up the mess, Ron sneaks behind her and steals some bullets from the armory. Olivia takes shelter inside Eric 's house along with him when the herd invades the community. That night, they witness Rick and other residents slaughtering walkers in the streets and are inspired to join the group where they battle the entire herd for hours until dawn when all the walkers are finally killed. Several weeks after the invasion, Olivia opens the pantry as usual for residents to come by to retrieve rations. After Denise 's death, she helps prep the weapons carts to be taken out for an unspecified use by the townspeople. Olivia opens the door of the armory when the Saviors arrive as she was expecting them to come by eventually. She hands over the inventory to Arat and watches as they take all of the weapons. However, things get heated as Arat reveals two guns are missing, and her life is threatened by Negan if those guns are not turned over. As Rick holds a meeting with the townspeople, Olivia is held hostage by Negan. Eventually, the guns are found and a tearful Olivia is released. When Negan returns to Alexandria to deliver back Carl , Olivia answers the door. Negan asks her about Rick's whereabouts, and Olivia nervously tells Negan that Rick is out scavenging and might not return that day. She adds that she and the other Alexandrians are practically starving due to the Saviors taking their supplies, prompting Negan to make a comment on her weight. Olivia starts crying, and Negan apologizes and offers to have sex with her while they wait for Rick. In response, Olivia slaps Negan, but he laughs it off before taking a tour of Rick's house after ordering her to prepare some lemonade. While waiting for Rick's return to Alexandria, Olivia, besides taking care of Judith , is forced to obey to Negan's personal demands. When Tara brings her some lemonade powder from her kitchen and offers to take her place in watching over Judith, Olivia declines since she already promised that to Rick and walks inside the Grimes' house where she makes lemonade and sits down to eat spaghetti along with Judith, Carl, and Negan. Later that day, when Negan and Spencer play pool, Olivia watches on the porch with Carl. After Negan kills Spencer, Rosita attempts to kill Negan and accidentally shoots Lucille instead. As a result, Negan demands Rosita to tell him who made the bullet. After lying twice, Negan orders Arat to \" kill someone \", and Olivia is promptly shot in the face despite Rosita's pleas.",
        "Death[]": "Killed By Rosita Espinosa (Indirectly Caused) Eugene Porter (Indirectly Caused) Rosita has Eugene make her a bullet. After Rosita is taken to the ground by Arat for attempting to shoot Negan with that bullet, Negan demands that she tell him who made the bullet. Negan Smith (Caused) Arat Rosita claims twice that she did it, prompting Negan to order Arat to kill someone for Rosita's lies. Rosita panics and continues to insist it was her, but Arat pulls out her gun and shoots Olivia in the cheek.",
        "Killed Victims[]": "This list shows the victims Olivia has killed: Young Boy (Zombified, alongside her fellow Alexandrians) Numerous counts of zombies",
        "Relationships[]": "For a more in-depth look at Olivia's relationships, read here: Olivia (TV Series)/Relationships",
        "Appearances[]": "",
        "Gallery[]": "For more images of Olivia, please visit Olivia (TV Series)/Gallery .",
        "Trivia[]": "The casting call for this character used the name Julia . [2] Olivia was credited in \" East \" but did not appear in the episode. Olivia is the first named character whose death was caused by Eugene Porter in the TV Series . Olivia appears in the final flashbacks of the last episode \" Rest in Peace \".",
        "References[]": ""
    }
]