[
    {
        "Oscar": "Oscar",
        "Overview[]": "Oscar is a courageous, helpful, and sincere man. Unlike Tomas and Andrew , Oscar is shown to have good intentions. Initially, Oscar and Axel are given their own cellblock away from the main group, but become haunted by the corpses of their prison mates. Controversy arises in the group on whether Oscar and Axel can be trusted. Oscar ultimately proves to be trustworthy. He helps the group with many tasks, and is recruited to help turn off the generator. When being forced to choose between Rick and Andrew, he kills Andrew, solidifying his place in the group. After this point, Oscar becomes a trusted and reliable member of the group, putting his life on the line to help them until his death.",
        "Pre-Apocalypse[]": "Nothing is known about Oscar's life prior to or as the outbreak began, except that he was imprisoned for breaking and entering. Oscar also had a wife and kids, and had one close friend his whole life.",
        "Post-Apocalypse[]": "At the onset of the outbreak, a riot started at the prison. Oscar, Tomas , Andrew , Big Tiny , and Axel were escorted to the cafeteria by a guard. They were locked inside as the guard went out to call for backup, but he never returned. The five inmates then spent the next 10 months locked inside the cafeteria, without knowing what was going on outside. He, along with the other prisoners, are found after outside survivors Rick Grimes , Daryl Dixon , Glenn Rhee , T-Dog , and Maggie Greene break open the cafeteria's door to escape a group of walkers. He witnesses the amputation of Hershel Greene 's leg. Oscar, just like the other prisoners, is confused with what is happening. When Rick tells them about what happened to the world, Oscar doesn't seem to understand the gravity of the situation as he asks if Rick or Daryl has a phone so he can try to call his family. As soon as he understands that a big part of the population has been wiped out, Oscar reveals that he had kids outside and worries about his mother. Oscar agrees with Rick's offer to give his group half of the food from the cafeteria in exchange for help cleaning Cell Block B, so the prisoners can live in it. When Big Tiny is scratched, Oscar is one of the prisoners that asks Rick if there is anything they can do to save him, but they end up witnessing Tomas brutally kill Big Tiny. While clearing out the laundry room, Tomas tries to kill Rick twice. In response, Rick impales Tomas' head with a machete, killing him instantly. Andrew tries to fight Rick, but is easily defeated and runs away through the prison corridors. Rick leaves to pursue Andrew while Oscar and Axel are held at gunpoint by Daryl and T-Dog. Axel tries to convince them that he and Oscar aren't killers like Tomas and Andrew. He begs Oscar to help him out but Oscar calmly tells him to stop talking. When Rick returns, he holds Axel at gunpoint asking him if he was associated with Tomas, but Axel convinces him that he is not a murderer. When Rick turns his attention to Oscar, holding him at gunpoint, Oscar doesn't show any sign of fear and once again calmly tells Rick that he had never begged for his life before, and he isn't going to do it now. He just says, \"Do what you gotta do.\" Oscar is spared by Rick. They reach Cell Block B. Oscar and Axel are horrified as they discover that every prisoner in that area was executed in cold blood, probably by the guards. Oscar tells Rick that leaving them there with all those corpses is sick. Daryl responds that if Oscar thinks this is sick, he doesn't want to know how things are outside the prison. T-Dog gives Oscar and Axel a final word of advice before he, Rick, and Daryl head back to Cell Block C, \"Take those bodies outside and burn them.\" Oscar insists to Rick's group that he and Axel cannot live in their section of the prison, claiming it to be haunted. The group decides to tell him and Axel to go out on their own, although T-Dog says they should be allowed to stay, wanting to give them a second chance. When the walkers begin invading and the alarms go off, Rick recruits him and Axel to get to the generator and turn the power off. There they encounter Andrew, who survived the walker onslaught in \"Sick\" and opened the gates to bring revenge upon Rick. Rick's gun skids to Oscar. He picks it up, initially aiming at Rick, but then shoots Andrew in the head, handing Rick his gun back and turning the alarms off. He and Axel are seen with the group when they reunite at the end of the episode. Oscar and Axel are accepted in the group, but are welcomed with cold shoulders. They assist Glenn in digging Lori Grimes ' and T-Dog's graves, and attempt bonding with Glenn while doing so. Glenn says he requires two more graves, so Axel and Oscar begin digging. Meanwhile, Glenn talks with Hershel, saying that he wished they had killed all the prisoners when they first saw them. Hershel talks this thought away by saying that he thinks Axel and Oscar seem like good guys. Axel and Oscar later assist with Glenn getting zombies away from the main gate, so that Daryl and Maggie can get inside the prison again. They are later seen with the rest of the group as Daryl is feeding the baby , and Oscar grins when Daryl dubs the baby \"Lil' Ass Kicker\". Oscar is seen eating cereal along with the rest of the group. Following this, he, Daryl, and Carl go out into the lower levels of the prison in search of supplies, as well as Carol Peletier . On the way, he discovers a pair of slippers in a bathroom and claims them for himself, saying that he likes to wear slippers after a hard day's work. Later, Oscar is seen back with the rest of the group outside. He witnesses the arrival of Michonne Hawthorne , and her interrogation, and volunteers to accompany the group to rescue Glenn and Maggie after learning their whereabouts. Oscar sets off with Rick, Daryl, and Michonne to find Woodbury and free Glenn and Maggie. On the way, they are approached by a large group of walkers and, although Oscar beats one to death with his hammer, they are forced to take shelter in the home of a hermit . After the hermit nearly allows walkers inside, he is killed, and fed as a distraction to the walkers. The group escapes, and make their way to the outskirts of Woodbury, where they crouch, surveying the area. Oscar and the others infiltrate Woodbury. They use their skills to discover and free the captives Glenn and Maggie, in the process, however, are immersed in an intense gunfight with the soldiers of Woodbury. Oscar assists the injured Glenn over the wall to escape, however, this exposes him and he is ultimately gunned down by one of the soldiers, specifically the soldier who appears as a hallucination of Shane Walsh to Rick. Glenn and Maggie are both greatly distraught over his death and Maggie is forced to shoot him in the head, albeit reluctantly and tearfully, so that he doesn't reanimate. In a hallucination, Rick walks through a floor full of the corpses of his friends and loved ones, among them Oscar.",
        "Death[]": "Killed By Rick Grimes (Indirectly Caused) During the assault on Woodbury, Rick hallucinates a Woodbury soldier as Shane Walsh, his former friend and partner whom he killed the year before at Hershel Greene's farm. Unnamed Woodbury Guard (Alive) Rick, confused, then watches as the hallucinated Shane shoots Oscar in the ribs with a shotgun, killing him. Maggie Greene (Before Reanimation) Maggie unsuccessfully attempts to get Rick's attention, so she shoots Oscar in the head to prevent him from reanimating.",
        "Killed Victims[]": "This list shows the victims Oscar has killed: Andrew Eisenberg (Alongside Daryl , Maggie , and Rick ) Bob Adams (Alongside Daryl, Maggie, and Rick) Pete (Possibly, alongside Daryl, Maggie, and Rick) At least 1 unnamed Woodbury soldier Numerous counts of zombies",
        "Appearances[]": "",
        "Trivia[]": "Oscar was first revealed by a sheet of paper that also confirmed Axel 's appearance in the TV series. However, he first appeared in a Twitter picture posted by Michael Rooker . In \" Sick \", he revealed that he was serving time in prison for breaking-and-entering. Oscar's reaction to Rick pointing a gun at his head in the episode \" Sick \" is near identical to a scene in the show House of Payne where Oscar's actor ( Vincent Ward ) has a gun shoved in his face and states the same line, \"Do what you gotta do\". In an interview, Vincent Ward revealed that there was a deleted scene showing a beef between Oscar and Michonne because he didn't trust her. [1] Oscar is mentioned in \" Clear \" by Carl to Rick and Michonne when discussing tensions with Woodbury. Oscar appears in the archival footage shown at the beginning of \" A New Deal \" as Judith narrates past events of the show to the audience before the episode's story begins.",
        "References[]": "",
        "Name": "Oscar"
    }
]