[
    {
        "Otis": "",
        "Overview[]": "Although he only appeared in two episodes, Otis was shown to be a kind, generous, capable, brave, and unselfish person. He was clearly loved very much by his wife Patricia and was a cherished friend to Hershel, Maggie , Jimmy , and Beth who were all devastated by his death. Otis was extremely remorseful for his accidental shooting of Carl Grimes and made it a personal mission to help Shane retrieve much needed medical supplies to save the boy's life, although it tragically resulted in his brutal death as a result of Shane.",
        "Pre-Apocalypse[]": "Before the outbreak Otis was employed by Hershel years back as a ranch foreman. At some point, he also became an occasional volunteer Emergency Medical Technician who worked with the local fire department. Otis had a wife named Patricia [1] and presumably the two of them lived in the same house as the Greene family. He also knew how to play the guitar and was interested in the sport of hunting.",
        "Post-Apocalypse[]": "At an unknown point in time, Otis located a zombified Sophia Peletier and placed her into the barn on Hershel's Farm. [2] During a hunt, Otis sees a deer and shoots it without realizing that behind it was Carl Grimes . The bullet passes right through the deer into Carl. Otis is in the woods hunting for a deer to feed his fellow survivors. He tracks a buck and shoots it, but the bullet passes through and hits Carl as well. Otis takes Rick Grimes , Carl, and Shane Walsh to Hershel's farm where they discover that Carl was critically injured by the bullet, suffering internal bleeding. Feeling immense guilt for shooting Carl, he took Shane to a nearby former high school , now a FEMA command post, to scavenge for the needed medical supplies. Upon reaching the school, they discovered that the school had been overrun with walkers . Using road flares from a nearby police interceptor, they created a diversion to lure the walkers away from a medical supply trailer. Inside the trailer, they were able to find all of the supplies needed, but upon leaving it, they discover that the walkers had lost interest in the flares and were once again swarming around the trailer. Otis and Shane make a run for safety, hoping to make it back to Otis's truck. They are cut off and forced to break in to the school, shutting themselves inside with the security gate. The walkers break through the flimsy security gate and pursue Otis and Shane through the hallways of the abandoned school . Otis and Shane end up in the gymnasium and are able to take refuge on top of the bleachers and formulate a plan. Otis thins out the group of walkers, while Shane busts through and jumps out of a nearby window. Otis, who was too overweight to fit through the window, takes advantage of the diversion that Shane made, and jumped down and made for the locker room where he was able to find a larger window to break out of. Otis and Shane eventually meet up outside of the school, but continue to be pursued by a group of walkers. The two grow fatigued and Shane falters, pleading for Otis to take the medical supplies and go on without him. Otis refuses, helps Shane to his feet, and pressed on. The pair quickly run out of ammo and are forced to resort to their pistols. However, they are moving too slowly to effectively outrun the horde pursuing them. Shane, knowing that Otis would likely doom them both and Carl, decided to shoot Otis. Shane and Otis scuffled over the supplies, with Otis ripping out a chunk of Shane's hair. Shane prevailed and limps away, while Otis was eaten by the walkers. Otis appears in flashbacks as Shane tells the group a concocted story of his apparent sacrifice during his funeral. At the Manhattan Tribespeople 's base, Maggie looks through a box of old photos of her family, Otis and Patricia, a picture of herself and Hershel as a baby, an old watch, and a drawing of Glenn.",
        "Death[]": "Killed By Shane Walsh (Caused) Shane apologizes to Otis and shoots him in the leg with his last bullet. He then strips the medical supplies away from Otis, with a struggle, and manages to sprint away just as the walkers catch up. Callaway (Infected) Zombies Otis is immobilized and is promptly devoured by a group of walkers, which includes a zombified Callaway, giving Shane enough time to escape. It is unknown if Otis reanimated, or was fully devoured.",
        "Killed Victims[]": "This list shows the victims Otis has killed: 13 unnamed high school refugees and FEMA workers (Zombified) 1 deer Numerous counts of zombies",
        "Appearances[]": "",
        "Trivia[]": "Otis is the first character to die in Season 2 . He is also the first member of the Greene Farm group to die. Prior to his death, Otis discovered the zombified Sophia and placed her into the barn at the Greene family farm . On Talking Dead , Robert Kirkman stated that the scene in which Otis located the zombified Sophia and placed her into the barn on Hershel's farm was actually filmed as a flashback. The timing of Otis putting Sophia in the barn means that she was already dead before the end of \" What Lies Ahead \", presumably during the day or night following her disappearance. Despite being the one who collected walkers to put inside of the barn, Otis seems to not entirely share Hershel's initial beliefs about the walkers being alive, and only sick, as he is shown to have no issue in killing them, as seen while gathering medical equipment to save Carl's life. Otis is the first named character to be killed by Shane Walsh in the TV Series .",
        "References[]": ""
    }
]