[
    {
        "Owen": "",
        "Fate": "",
        "Contents": "",
        "Overview": "Owen is shown to be a cunning, greedy, violent, nihilistic and dangerous person. He appears to care about nothing other than survival for himself by any means necessary and is more than willing to rob and murder other survivors of everything they have. He is shown to be a remorseless, cold-blooded murderer as shown when he slits a man's throat with no emotion or hesitation and makes it clear he is not above killing children either as shown when he threatens Morgan while imprisoned in Alexandria. He is also a sly and calm talker and is shown to possess a very manipulative personality. He seems to view mercy as a weakness as he appears to find it amusing that Morgan refuses to kill other people during their second encounter and openly tells him that he should have killed him when he had the chance to do so in the woods. He appears to be highly intelligent as well, as shown by his ability to devise Walker traps in order to kill other survivors for their supplies and his trivial knowledge of the history of wolves. He also seems to take pleasure in what he and his group do and claims they are doing people a favor by \"freeing\" them. Owen is somewhat shown to have little or no fear of death as shown during his imprisonment when he appears completely unworried that a potential infection might claim his life. Owen also appears to be fearless and brave as while imprisoned in Alexandria and at the mercy of Morgan, he shows no fear whatsoever despite having a deep gash in his torso and makes a subtle threat that he still intends to slaughter every survivor in the safe-zone if he survives his wound. His fearlessness is also evident during the confrontation between Carol and Morgan where he encourages Morgan to kill him and shows no fear over Carol's strong intent to kill him. Ultimately he uses the confrontation over his life to knock Morgan unconscious while he is distracted, take Denise hostage and escape from his cell. Despite his dark and sadistic nature, it is shown that Owen was not a complete monster and was shown to be capable of caring for others as he saved Denise's life instead of fleeing from Alexandria (when he had a clear opportunity to do so) and before meeting his demise, he urged and helped Denise to escape.",
        "Pre-Apocalypse": "Nothing is known about Owen's life prior to or as the outbreak began, except that he enjoyed going to the movies. [1]",
        "Post-Apocalypse": "Owen survived the early stages of the outbreak and eventually found himself the leader of a group of about 30 people, which would later become known as \"the Wolves\". Believing that humanity descended from wolves, he and his group resorted to extreme violence to survive by raiding camps and settlements around the area and brutally slaughtering survivors in order to steal their supplies and reclaim what they believed belonged to their ancestors. Eventually, Owen carved a \"W\" into his forehead, an example that was followed by his fellow cult members. He stationed his group's base at Del Arno's Foods , where he and his group scavenged the surrounding area for supplies and other survivors. His group also survived by setting up traps for unsuspecting survivors, and then using their reanimated corpses as traps for other survivors. They would also carve the letter \"W\" into their victims' foreheads. At some unknown point later, Owen and his group attacked Shirewilt Estates , and slaughtered every survivor in order to steal their supplies. A few weeks later, the group also attacked a small camp of survivors in the woods in which they brutally slaughtered and disemboweled the camp's residents and tied one of their victims to a tree. [2] While looking for new victims around the woods, Owen encounters Morgan as he is cooking breakfast for himself and holds him at gunpoint. The two engage in conversation, wherein Owen tells Morgan that he used to enjoy going to the movies and talking to people. He then insists that he will take everything Morgan has, including his life. When Morgan refuses, he gives a signal to Edward to attack. However, both of them are knocked out by Morgan and left in a car. Eventually, Owen and Edward are able to escape from the car and the two later find a man with a red poncho , whom they capture and bring to the Del Arno Foods cannery that night, where they discover someone had activated the walker traps, forcing Owen to improvise and slash the man's throat. After resetting the walker traps, he rummages through Aaron 's backpack and discovers several photos of a nearby community named Alexandria . Having cut himself in his torso with a rusty car door, Owen leads his group to attack Alexandria for medical supplies. However, his entire group is killed while he hides inside a house from one of the buildings. As Morgan searches the house a while later, Owen ambushes him and tries to kill him with a sickle but Morgan is able to evade his attack. He recognizes Morgan and the two begin to fight. After struggling with Morgan and taunting him that he should have killed him in the woods, Morgan is able to fend him off and then apologizes before knocking him unconscious with his staff. After being locked inside the basement from one of the houses, Owen listens as Morgan tries to help him change his way by telling him of his past and eventual relationship with Eastman . Unmoved by Morgan's story, Owen shows him the gash in his torso and notes that he will likely not survive his injury, but if he did that he would make it his goal to kill Morgan and everyone else in Alexandria, including the children, because that is part of his code. Upon being convinced by Morgan to check on Owen, Denise talks with him from a corner of the basement and angrily accuses him over the atrocities he has committed, claiming they are unjustifiable. Owen excuses himself for his actions and reveals he got a cut in his torso. After some hesitation, Denise asks him to lift up his shirt to check his wound before approaching him. She tells him that he can change for the better and then proceeds to treat his wound. When Carol and Morgan hide in the same house to escape from the invading herd, they eventually fight over the fate of Owen, who shows no fear and admits that he will eventually escape. As Morgan knocks Carol unconscious, Owen grabs Morgan's staff and strikes him unconscious, then takes a knife and points it at a shocked Denise. After cutting his bonds, Owen walks up to Denise and holds the knife to her throat, claiming that she represents what he likes about people. Suddenly, Tara , Eugene , and Rosita enter the basement and Owen forces them to drop their guns and slide them over. He then takes one of the guns and exits from the building with Denise as his hostage. While hiding from the herd, Owen keeps holding Denise at gunpoint and tells her they'll make a run for a lookout tower as soon as a gap opens up in the herd so they can jump from the wall and escape together, insisting she accompanies him because he needs her help for his wound. That night, Owen spots a gap in the herd and sprints to the tower with Denise when he is forced to save her from a walker, causing him to be bitten in the arm in the process. Believing this act could be a signal of him redeeming himself, Denise urges Owen to come with her to the infirmary so she can save his life. They are forced to take shelter inside a house where she ties a belt around his arm to amputate it before both of them run towards the infirmary. Unfortunately, Carol witnesses them from the townhouse balcony and shoots Owen in the chest. He then decides to sacrifice himself to be devoured by the walkers so Denise can escape. Shortly after, Owen reanimates and is found by Morgan, who apologizes to him one last time before putting him down with his staff .",
        "Death": "Killed By Denise Cloyd (Indirectly Caused) Owen goes with Denise to the infirmary to treat his wound, but on the way, Denise is grabbed by a walker. Owen saves her, but he gets bitten on the arm in the process. Carol Peletier (Caused) Himself (Sacrifice) Zombies (Alive) As they continue toward the infirmary, Owen gets shot repeatedly in the chest by Carol (unaware that he is helping Denise escape), and is then devoured by walkers after sacrificing himself to save Denise. Morgan Jones (Zombified) While everyone in Alexandria is fighting off walkers, Morgan sees a zombified Owen, apologizes to him and then immediately stabs him with his staff , putting him down.",
        "Killed Victims": "This list shows the victims Owen has killed: Noah's Brother 2 (Caused and/or Direct, Alive) Noah's Mother (Caused and/or Direct) Noah's Brother 1 (Caused and/or Direct) Red Poncho Man (Alive) Dinesh (Caused and/or Direct) Stacy (Caused and/or Direct) Michael (Caused and/or Direct) Natalie Miller (Caused and/or Direct) Bobby (Caused and/or Direct) Samantha (Caused and/or Direct) Charlyne (Caused and/or Direct) Jeffery (Caused and/or Direct, Alive) Richards (Caused and/or Direct, Alive) O'Hara (Caused) Erin (Caused) Holly (Cause) Dan (Caused) Adrian (Caused) Park (Caused) Shelly Neudermeyer (Caused) Himself (Sacrifice) Numerous Shirewilt Estates residents (Caused and/or Direct) A few camp residents (Caused and/or Direct, Alive) Numerous counts of zombies and unnamed people",
        "Relationships": "For a more in-depth look at Owen's relationships, read here; Owen (TV Series)/Relationships",
        "Quotes": "The following is a list of some of Owen's most memorable quotes.",
        "Appearances": "",
        "Gallery": "For more images of Owen, please visit Owen (TV Series)/Gallery .",
        "Trivia": "Owen is credited as W Man in \" Conquer \" and as Wolves Leader in \" JSS \". Owen's name was never stated in the show, and was instead revealed in an interview by Scott Gimple . [3] With the death of Owen, all known members of the Wolves are deceased. Owen is one of three named Wolves, the others being Aphid and Edward . Owen is the first primary antagonist of a half season whom Rick has never met.",
        "References": ""
    }
]