[
    {
        "Overview": "Despite coming off as menacing and aggressive at first, Ozzy is neither unreasonable nor fundamentally malicious. Despite being a thief and extortionist, he avoids killing whenever possible, and prefers to obtain supplies through intimidation alone. This may also be out of pragmatism, since the Highwaymen don't appear to be a very large group and might not fare too well in an open conflict against a more numerous opponent. Ozzy also seems to be a man of his word, as he and his group faithfully protected the roads when they reached a deal with Ezekiel. To those he is allied with, Ozzy is courteous and friendly. Ozzy is also more than willing to protect his allies from harm as seen when he, alongside Alek and D.J. attempted to save the members of the Coalition after they were kidnapped and to be slaughtered by the Whisperers , fighting valiantly before suffering a brutal death at the hands of Alpha .",
        "Pre-Apocalypse": "Nothing is known about Ozzy's life prior to or as the outbreak began.",
        "Post-Apocalypse": "At some point following the outbreak, Ozzy became leader of a group of survivors known as \" the Highwaymen \". In their base, Ozzy greets Carol , Ezekiel , and Jerry as they enter. He informs them that the meeting is for the King alone. They disagree, and Ozzy asks if they have his toll, while his people approach with their weapons drawn. He suggests they use Ezekiel as ransom when suddenly the Kingdom fighters grab his people from behind. Ezekiel draws his sword and says he's prepared to fight for what they've created. He then offers Ozzy a job to clear the roads for him in exchange to access for the Kingdom and the fair. Ozzy laughs in his face and draws Jerry's sword, telling them they'll have to do better than that. Carol then asks when the last time they’ve seen a movie and a shocked Ozzy responds, \"Seriously?\" Later, on the road, Ozzy and some of the Highwaymen ride up on horses and introduce themselves to Tara and the Hilltop group after helping them take down a herd. They then escort them to the Kingdom, having accepted Carol's deal. In the Kingdom, Ozzy walks around with his horse as he passes by Jerry. He then tips his hat and smiles to Carol and Ezekiel, signaling trust. In the woods, Ozzy, alongside Alek and D.J. help clear the road to keep the route to the Kingdom safe for the other communities. Later, he shows the others the site where Hilde was ambushed. The group decides to split up, with Ozzy and his group leaving to patrol the Kingdom's outskirts. Later, he, Alek, and D.J. find the tied up residents surrounded by several Whisperers in a stable. They rush inside in an act of bravery and start attacking them, giving the group a chance to fight back. In the middle of the chaos, Alpha arrives and the group is subdued and then killed, only leaving Siddiq alive as a witness. Later, Alpha puts Ozzy's decapitated head on one of the several pikes used for the Whisperers' border. The next day, Daryl , Michonne , Carol, Siddiq, and Yumiko find the border and watch in horror at the victims, a reanimated Ozzy being among them. Later, in the Kingdom, Siddiq delivers the tragic news to the crowd, tells them how brave everyone was in their final moments and how they all fought back. He encourages everyone to remember the fallen as brave heroes and to honor them.",
        "Death": "Killed By Himself (Caused) Alpha (Alive) Ozzy, Alek, and D.J. find the stable where several residents are kidnapped. They fight valiantly to rescue them, but are overpowered and decapitated alongside them by Alpha. Daryl Dixon , Carol Peletier , Michonne Grimes , or Yumiko Okumura (Zombified) After finding the border, his zombified head is put down by either Daryl, Carol, Michonne, or Yumiko.",
        "Killed Victims": "This list shows the victims Ozzy has killed: Himself (Caused) At least 1 unnamed Whisperer Numerous counts of zombies and possibly unnamed people",
        "Relationships": "For a more in-depth look at Ozzy's relationships, read here: Ozzy (TV Series)/Relationships",
        "Quotes": "The following is a list of some of Ozzy's most memorable quotes.",
        "Appearances": "\" Chokepoint \" \" The Calm Before \" \" A New Deal \" (Archive Footage)",
        "Trivia": "Ozzy appears in the archival footage shown at the beginning of \" A New Deal \" as Judith narrates past events of the show to the audience before the episode's story begins.",
        "Name": "Ozzy"
    }
]