[
    {
        "Pamela Milton": "",
        "Contents": "",
        "Overview[]": "Pamela is a charismatic and intelligent political authority in the Commonwealth. She initially shows herself to be a caring but stern leader to the citizens of the Commonwealth, as well as to their newcomers . Though she seldom appears to the new arrivals, she personally visits each of their communities to ensure that they are well structured and even offers them permanent asylum and assimilation into the Commonwealth. She is shown to be a largely absent mother to her son, Sebastian , as she spends the majority of her time tending to her duties instead of paying attention to him. She claims that there \"never was a choice\" when it came to choosing her job over her son. After Sebastian's money-heist schemes become public knowledge and forces him into hiding, she appears to become more present in his life, although this is mainly to remedy her family's reputation instead of genuine care. According to Sebastian, Pamela wanted her other son to be her heir, but he didn't survive, leaving her with Sebastian instead. However, she is genuinely devastated by his death. Pamela also has a slight disdain for Lance Hornsby and his manipulative methods, as she easily sees through his cunning personality and knows that his only true desire is to eventually replace her as Governor, possibly seeing him as a threat. Pamela takes a turn for the worst after the death of her son, Sebastian. She reveals a different personality that seems to have been hiding behind her friendly facade; a power-seeking, cunning and dominant figure who will do anything to get her way. She also appears to become more sinister in her behavior as time progresses, such as having Roman Calhoun killed and forcing Lance to feed his corpse to her zombified son, ordering the forced kidnapping and imprisonment of \" traitors \" (and their children) into labor camps, and lying directly to a jury during Eugene Porter 's trial in order to get him executed and save her high position of power. However, her actions with the labor camps are illegal under Commonwealth law to the point that Mercer , with the testimony of the former prisoners as witnesses, has legal grounds to remove Pamela from power. It's also revealed that she is willing to draw massive herds to the Commonwealth as an excuse to clear the streets in a lockdown, doing this at least twice, uncaring of the lives that she risks. When Pamela's actions get the Commonwealth under siege by a massive herd due to this, Pamela orders her troops to concentrate on protecting her home and the estates and to draw the walkers into the lower wards, willing to sacrifice thousands of people to save herself and the Commonwealth's elite. This, along with her transformation of Alexandria into a labor camp despite promising to return it to its residents, reveals that Pamela has always had a sinister nature, but she hid it in public until after Sebastian's death. Maggie believes that Pamela had never intended to honor her deal with the Coalition and had always intended to betray them rather than her actions being triggered by Sebastian's death. However, Pamela's one major weakness is her arrogance, sense of superiority and overconfidence which causes her to gravely underestimate her enemies and overestimate the abilities of her own forces. As a result, Pamela is ill prepared to act when the herd that she had lured to the Commonwealth breaches the defenses and begins to overrun it. She also blackmails Yumiko into being the prosecutor in Eugene's trial, confident that she holds all of the cards, only to have Yumiko publicly denounce her while ensuring her brother's safety at the same time. In addition, her choice to enslave the Coalition captives in their own home literally gives them the home field advantage to undermine and rebel against her forces which may not have been possible had Pamela bothered to send them to a place that they didn't know and were unfamiliar with. As a result, when something doesn't go her way and her fear tactics don't work, Pamela is often left in shock for a moment and doesn't quickly respond to the situation. During the fight between her men and the Coalition forces, Pamela is brave enough to stand on the balcony beside her forces and even takes up a gun to fight herself. However, when she shoots Judith instead of Maggie , Pamela is visibly shocked and horrified, showing that she does retain some morals to the point of being horrified by the possible murder of a child at her own hands. However, Pamela also immediately screamed that it was the Coalition's fault for this, trying to avoid the responsibility of having shot Judith. She also has no regards over the Commonwealth residents, willing to let thousands of them die just to save her own skin. After being defeated, Pamela attempts to commit suicide rather than be imprisoned by feeding herself to a zombified Lance, taking the coward's way out. Negan notes that being imprisoned would be a fate worse than death for someone like Pamela, prompting Maggie to save her so that Pamela could face punishment for and be forced to live with her actions. Even after her defeat, she remains arrogant and rants to Daryl and Carol about how there will be hard choices as leaders by saying it wasn’t easy to spare her, but Carol shuts her up and tells her that the Estates , her bastion of power and wealth, were destroyed in the battle with the horde, leaving her in shame with both her son and home gone.",
        "Pre-Apocalypse[]": "Nothing is known about Pamela's life prior to or as the outbreak began except that she came from a political dynasty family, similar to the Kennedy family and the Bush family with her father serving as President of the United States at some point in time. During her student's years, she went and graduated from Harvard University. Later in life, she had a son named Sebastian . While not interested in politics like her father and uncle, Pamela became interested in philanthropy work despite her exuberant wealth. During these times, she befriended Ohio Congresswoman, Deanna Monroe . Pamela believed that Deanna was a true politician and was born to lead.",
        "Post-Apocalypse[]": "At some point during the outbreak, Pamela presumably founded a community in Ohio and became Governor of the community. Pamela is seen as she joins the carnival with everyone clapping for her. Pamela passes by watching Sebastian insulting Daryl, giving him a disapprovingly look before moving on with her armed escort. Sebastian's smug façade fades and he walks off to join his mother without another word. A crowd mobs the red carpet outside the masquerade ball, including Pamala, Lance and Sebastian. An excited Lance approaches Pamela asking about the wine, clearly proud of his findings, to which Pamela replies \"fine,\" and suggests they discuss his Alexandria idea at a later time, much to Lance's disappointment. Connie interviews Pamela and wonders what her father , the former United States President, would say about the class divide at the party. Pamela evades the question and introduces her to Carrie , a woman who won the lottery the year before. A server tries to approach Pamela, but Max shoos him away. Princess recognizes the server as the soldier who she beat up in the train car. Pamela gives a speech and unveils a portrait of her father. The server, Tyler , holds Max at knifepoint and accuses Pamela of lying. He says he lost everything because of one mistake and says people like him mean nothing to Pamela. Max tries to calm Tyler down. He lets her go and flees. After stopping him, Daryl instructs Sebastian to bring Tyler to Pamela, allowing him to take credit. Sebastian takes Tyler back to the masquerade and receives credit for Tyler's capture. Tyler screams as he's escorted out of the room, adding that there are thousands more like him. Pamela orders Lance to investigate whether there are more resisters. Pamela and Lance travel to Alexandria. While en route, Pamela shares her concern that incorporating new communities would stretch Commonwealth resources too thin. Hornsby argues that Alexandria, Hilltop , and Oceanside are perfect for his vision. Aaron and a welcoming committee greet Pamela's convoy as it arrives in Alexandria. Aaron gives Pamela a brief history of Alexandria. Mercer asks how they keep Alexandria safe. Daryl says they fought many battles to protect it. Pamela recalls crossing paths with Deanna , Alexandria's founder, in earlier days. Daryl says Deanna always rebuilt Alexandria every time it fell. Pamela is unimpressed, especially when a walker leisurely strolls inside Alexandria. Daryl kills it. Pamela says she's seen enough. Pamela relaxes on the beach at Oceanside. Lance tells her that Rachel is ready to see her. Rachel takes Pamela and Lance on a tour of Oceanside. She explains that Maggie has chosen not to ally with the Commonwealth, and that Oceanside will only partner up with the Commonwealth if Maggie agrees to do so. On their way to Hilltop, their convoy stops as they see Maggie is killing walkers on the road ahead. Pamela, Daryl, and Commonwealth troopers help Maggie kill the walkers. Pamela introduces herself. In the woods, Pamela suggests she and Maggie hunt together. As they hunt, Pamela admits to Maggie that she was initially skeptical of visiting Alexandria, Hilltop, and Oceanside. However, she acknowledges that numerous city states fighting each other for resources is not beneficial for anyone. She offers to protect Hilltop. Maggie accuses Pamela of running an autocracy. Pamela argues that Maggie is the sole leader at Hilltop, but Maggie insists that Hilltop is run more fairly than the Commonwealth. She points out that Pamela has a nicer car and house than everyone else. Maggie returns to Hilltop with Pamela's convoy. Commonwealth troopers deliver supplies to the community. Maggie walks up to Pamela and formally declines the Commonwealth's offer. When Pamela asks why, Maggie says everything always costs something. Lance is disappointed. Lance begs Pamela to try and salvage his plan. Pamela correctly guesses that Lance wants to eventually govern the communities. She agrees to let him continue his campaign to enlist the communities but warns that there will be consequences if his Commonwealth duties are compromised. Pamela is reciting a speech she's going to give at an upcoming dinner. She notices Max looks troubled and asks if everything is okay. Max assures she is fine, but Pamela tries to get her to open up more. Max tells her about an idea to use the money they got from Founders Day to start a scholarship fund for less fortunate families to see if Pamela is truly a good person. However, Pamela turns down the idea, saying it will go into the event. Pamela leaves for the dinner, with Max saying she'll follow. However, she stays back to search for evidence against the Miltons to take them down. In the office, Pamela angrily enters and places down a newspaper with Connie's article that says \"Pamela Milton is lying to you\" . With Sebastian's crimes having been exposed, a massive crowd of protestors calls for Sebastian to be punished . Inside her office, Pamela addresses public concerns over a PA system with vague promises and fabrications about finding \"the real culprits\", as Max and Yumiko silently stand by. They converse on whether or not Pamela knows where Sebastian is - likely in hiding somewhere - and their desire to continue attempting to reform the Commonwealth and bringing the full truth to light despite the risks which lay ahead. Pamela and Yumiko walk down the stairs to leave the train station when numerous protestors swarm them, with April's father and mother leading the pack. Pamela says she shares their pain and promises to get to bottom of who was responsible for their loved ones' deaths. Mr. Martens says they know who did it and asks where she is hiding Sebastian. Pamela tries to tell that it's not the truth, but the protestors aren't buying it. Yumiko steps forward and manages to talk everyone down as the guards force them all out. Pamela suspects that Connie is the one who wrote the article, but Yumiko says it would surprise her if she did. Pamela walks outside and into her ride as the protestors chant, \"DOWN WITH THE MILTONS!\" Pamela looks the windows conflicted as she talks on the radio ordering a lockdown. Yumiko arrives at Pamela's house and she offers her a drink. Yumiko is angered at Pamela tear gassing her friends, but Pamela believes it was necessary to keep everyone safe. Yumiko asks Pamela if she can really think there is no way Sebastian had anything to do with the crimes committed. Pamela knows that he has some behavioral issues but says his father and grandfather were the same way and still is his firm in her belief it wasn't Sebastian. Yumiko says she is trying to figure out how much Pamela knew about it since she might have to defend her. However, Pamela shows her distrust of Yumiko seeing that she is close friends with one of the biggest journalists in the Commonwealth, Connie. Just then Sebastian and Carol enter the house and Pamela immediately gets up and hugs him. This is immediately followed by a slap and says that he has humiliated her and himself. Sebastian turns his head to Pamela and states she shouldn't have come here before Pamela grabs him by the face and makes him look at her. Pamela asks what Sebastian had to do with everything, but Sebastian tries to lie and say he had nothing to do with it. Pamela doesn't buy it but then Carol speaks up saying they can help each other. She states she works with Hornsby and that he's been hunting down her friends. Pamela states she doesn't know anything about it and questions how it helps her. Carol proposes they frame Lance for Sebastian's crimes. Pamela, Carol, and Mercer arrive at the stand off between Daryl's group against Lance. Pamela orders him to lower the weapon since she needs Lance alive, but he refuses. Mercer also tells Daryl to lower the knife and that he's on Daryl's side. Carol steps forward and says she made a deal for them, but they need Lance alive. Daryl finally obliges and lets Lance go, but not without stabbing Lance's hand with his knife. The group stands outside as Carol explains the deal. Pamela will provide all the supplies they need and let them go free. Whether they want to go back or stay at the Commonwealth is up to them. In return, Pamela will have Lance to frame for Sebastian's crimes. Pamala talks to Lance alone. Pamela tells him that he will be taken back to the Commonwealth and put on trial. Lance tells Pamela to drop the act, but she says that she's not acting and that he has gone too far. Lance chuckles thinking that Pamela never had a problem with how he did things before. Pamela says they are done talking about the past and his current life at the Commonwealth is over. Lance is in shock, recounting all the years he's worked in service of her. Pamela calls him out for only working for himself, always trying so hard to prove the world wrong. Lance says that Pamela refuses to see it but he's made something of himself. Pamela creepily begins playing with Lance's hair, something he seems to enjoy. Pamela calls Lance a delusional little boy trying to win a game he's never actually been a player in. Pamela begins to walk away, but Lance states she needs him because if something happens to him, alliances the Commonwealth has will become a problem. Pamela says nothing and walks away, as Lance yells that he is in fact a player in whatever game she is playing. Later at the Commonwealth, Pamela makes a speech to the citizens that thanks to their friends and allies, they were able to catch Lance Hornsby and promises to bring him to justice. The citizens applaud, though some are shown to not be buying it. Pamela then talks about Founders Day tomorrow, saying it is an opportunity to come together and celebrate what truly matters, the people. Pamela declares, \"We are the Commonwealth!\" prompting more applause. In Pamela's office, she and Sebastian listen to recording of William Milton. Sebastian complains about the speech he has to give, but Pamela insists. Max hands Sebastian his speech and he sarcastically reads it, before crumpling it up and calling it crap. Pamela scolds Sebastian for his foolishness and the people need to be reminded that he is William's grandson. Sebastian believes he will prove himself simply due to being a Milton, but Pamela says he needs to show it. Sebastian promises he will and Pamela tells him he as born to lead the Commonwealth. Max, who had listened to the whole conversation, walks away. Alongside her son, Pamala attends the wrestling match and enjoys the spectacle. When one of the wrestlers is thrown out of the ring in front of Pamela and Sebastian, Sebastian laughs with delight in contrast to his shocked mother. As the Founders Day activities go on. Pamela steps onto the stage and hands the mic to Sebastian to give his speech. Sebastian steps forward and initially begins by reading off his script before suddenly stopping and starting to speak from, apparently, the heart. Sebastian acknowledges that he knows that the people don't like or trust him, and he probably deserves that, and it will take a very long road for Sebastian to earn their trust and live up to his legacy. Lacking the words to describe how much the Commonwealth means to him, Sebastian invites the Commonwealth to join him in listening to the wise words of President Milton, the founder of the Commonwealth. However, on Max's signal, Eugene instead plays on a loop Max's recording of Sebastian's cynical and entitled view of the Commonwealth and its people and his disgust for the poor. Sebastian completely loses it and runs off the stage after Max who runs away. The crowd turns on the Miltons and begin throwing things and trying to get onto the stage. The Commonwealth soldiers hold soldiers back, even having to resort to physical violence. Mercer tries to deescalate the situation and makes sure no one fires their weapon. Sebastian barges through the crowd going after Max as the chaos ensues. Then, ten reanimated Commonwealth janitors attack the crowd, killing several people. Mercer radios all units to the square and order six soldiers to come with him. Pamela protests that Mercer is supposed to protect her, but he answers that he's supposed to protect the Commonwealth. Sebastian finally catches Max and says she is nothing. He notices a walker approaching and pushes Max into it and watches sadistically as she struggles with it. Eugene sees this and runs over to save Max, pushing the walker off her and into Sebastian. He struggles with the walkers and calls out for help. A crowd surrounds him as he continues to beg for help, but no one lifts a finger and merely watch him struggle. Sebastian pushes the walker off but it grabs him from behind. The walker bites him on the neck twice, with blood spewing out of Sebastian's mouth. Judith finally puts the walker down by shooting it in the head. Sebastian chokes on his own blood before dying. Sebastian's corpse is strapped to a table in the Commonwealth morgue and, reaching for one of his blades, Mercer suggests that they should put him down. However, Pamela refuses, ordering that no one is to touch Sebastian until she says so. Addressing her son's corpse, Pamela tells Sebastian that she wasn't blind to what he was and, that despite what he thought, she was trying to help him, but she may have been too late. While they had their issues, family is a complicated thing. Pamela orders Mercer to find and arrest Eugene, intending to put him on trial for Sebastian's murder and to have him stand as an example to all of the Commonwealth. Under her orders, Mercer has his Commonwealth soldiers take in any associates of Eugene for questioning, including Rosita , Ezekiel , and Princess . Left alone with Sebastian, Pamela cleans up the blood on his face. Pamela knows that Sebastian always complained that she chose the Commonwealth over him, but there never really was a choice. Pamela doesn't know if she was ever capable of giving Sebastian what he needed, of controlling him. Crying, Pamela wonders what, after all of this struggle and sacrifice, they are left with now, but \"at least we don't have to disappoint each other anymore.\" Sebastian begins to reanimate and, composing herself, Pamela leaves the morgue, ordering a soldier outside to take care of Sebastian. In the Commonwealth jail , Pamela visits the imprisoned Lance. He thanks her for coming, and begins to talk about the two of them discussing a way forward. Pamela cuts him over, bitterly remarking that he killed her son. Lance, unaware of the outcome of his plot, loses his smile. Pamela tells Lance she knows about how he had his people kill Commonwealth workers, turning them into walkers and creating a public panic. Lance says that this was done as a way of getting her to \"understand\" and getting her attention, but that killing Sebastian was never part of the plan. Lance acknowledges that his gamble didn't go the way he thought it would, and that despite their differences, he was always on Sebastian's side; that he was willing to help get people for his heist and other \"side projects\", and that he did so simply because he was a Milton. Lance tries to shift the blame onto the newcomers from Hilltop and Alexandria , as everything worked in the Commonwealth's favor until they arrived, and that unless 'someone' who knows how to handle them does so, they will not stop causing descent and chaos. Pamela takes Lance's coin from his pocket, asking him what should be done with him. She suggest they try it 'his way', and \"take a risk.\" She puts her hands behind her back, and puts both of them out, forcing Lance to choose which one he thinks the coin is in. Lance ultimately winds up choosing the hand with the coin in it, and sighs with relief. Thinking this means a favorable outcome for him, he thanks Pamela profusely as she puts the coin back into his pocket. He says he is \"one-hundred percent at the Milton family's disposal.\" Pamela tells him she knows he is: she opens the door to the cell, and a handful of Commonwealth troopers bring an undead, chained up Sebastian into the room, and attach him to the wall. Horrified, Lance says he doesn't understand. Pamela reminds Lance that he just said he's at the family's disposal. However, thanks to him, this shell of her son is all that remains of the family. The troopers bring in the dead body of Calhoun , whom they have shot in the head, and untie Lance before tossing him a machete. \"Body's still warm. Feed my son, Lance,\" Pamela orders as she leaves. In her office, Pamela informs a group of the Commonwealth 's elite that the Coalition are enemies of the state, but that the situation is well in hand. Pamela has already suspended all migrant entry into the city until further notice. Lena Brand is glad that their contributions to the Commonwealth's future have not been in vain. Lena expresses her personal sorrow about Sebastian 's death, stating that Kayla is distraught and it's unthinkable to lose a child which Pamela agrees is worse than death. Yumiko angrily storms into the room, punching a man in the face that tries to restrain her and demanding to know where her friends are, much to the shock of the Commonwealth's elite. Yumiko calls herself the biggest threat that Pamela has at the moment and orders her to dismiss her guests and explain what the hell's going on. Amused, Pamela dismisses her guests and tells Yumiko that she's been expecting her. Pamela explains that her friends have been removed from the Commonwealth, which Yumiko realizes is just like the hundreds of other people that she's had disappeared. Not even denying the accusation, Pamela claims that their rebellion and defiance of the Commonwealth's laws had left her with no other choice. Yumiko calls Pamela out on her hypocrisy, but Pamela continues to insist that she does care about the law and seeing order restored from chaos and for justice to prevail. Pamela wants to assure her citizens that the trial of the man who killed Sebastian will remain impartial and that justice will be served no matter which side someone falls on. To this end, Pamela intends to bring this \"impartial justice\" by having Yumiko, Eugene 's friend, be the prosecutor in his trial . However, Yumiko refuses to sign her friend's death warrant in a kangaroo court publicity stunt. Pamela threatens that Yumiko will never be reunited with her friends otherwise and that she should consider how Yumiko's actions will affect her brother as well. Pamela smugly dismisses her to prepare for a press conference announcing Yumiko's intent to prosecute Eugene. Later, Pamela dictates to her new assistant Kathleen about how the upcoming press conference is important to regaining the public's trust and it needs to have a takeaway that they are moving forward in a transparent, open way. Pamela makes the mistake of calling Kathleen Max , forgetting for a second that Kathleen is not her old, long-term assistant. Pamela plans to have the Commonwealth Army there, but only in the background, so as to present a peaceful return to law and order. Pamela knows that if it feels like a police state, that will only stir up any lingering resentment. Pamela receives a phone call that leaves her visibly shocked. Pamela is led to Lance 's cell where she finds Lance gone and Sebastian dead, his head bashed open, and Lance's lucky coin left behind in his spilled brains as a message to her. Pamela begins to cry, but she quickly becomes consumed by rage after spotting the coin and realizing who's responsible for the state of her son. At the press conference, Yumiko looks over her prepared speech and Pamela tells her that she's glad that Yumiko had decided to attend, but Yumiko states that she didn't really have a choice. Pamela asks how Yumiko's stroll through the square today was, and informs Yumiko that Connie was captured earlier and that she has been placed with the others. Pamela admits that she admires the loyalty that Yumiko has for her people, and she hopes that someday Yumiko will understand why Pamela had to do this for her own people. However, Yumiko already understands, and she knows that this is for Pamela and her power, not for her people. Pamela states that Yumiko's words tonight will carry across the Commonwealth and help restore the people's faith and keep the peace, but Yumiko points out that they're not her words, just bullshit theater, but Pamela is undeterred, ordering Yumiko to make sure that she knows her lines. As the press conference starts, Pamela asks Colonel Vickers for any updates on the escapees and Vickers promises her that she has their best people on it and teams are sweeping every quadrant, which is overheard by Yumiko. As Yumiko walks past her on the way to the podium, a report comes in over Vickers' radio that Alpha Squad has just been found dead in quadrant three and Daryl , Carol and Lance have all escaped. Taking her place at the podium, Yumiko begins to read her prepared statement, but Yumiko begins to pause and have visible second thoughts while talking about how she was given a second chance to uphold the sacred ideals of the old world of justice, and how regardless of the personal cost, we must always seek justice if who we are as a people is to be preserved. Suddenly stopping, Yumiko publicly thanks Tomi and reminds the entire Commonwealth of his invaluable and irreplaceable importance to them as their thoracic surgeon, thus protecting Tomi from Pamela being able to retaliate against her by making Tomi disappear. although Tomi is visibly confused, and a bit displeased by his sister's actions. Turning the tables on Pamela, instead of finishing her prepared speech, Yumiko announces that \"I'd also like to take this opportunity to thank my people for always having faith in me. And now I'd like to show my faith in them, and also honor the pursuit of justice by announcing my intent to defend Eugene Porter who has been wrongly and unjustly accused by Pamela Milton and the Commonwealth. We look forward to our day in court. Thank you very much.\" Amidst the uproar of the crowd, Yumiko drops her prepared speech at Pamela's feet and sarcastically quips to the shocked and furious governor that \"there's your speech,\" and walks away. In the Commonwealth, Pamela testifies at Eugene 's trial about Sebastian 's death and the impact that it had on her. Over Yumiko 's objections, Pamela calls Eugene a murderer that needs to pay, but her objections are overruled by the judge. Eugene worries about how nothing seems to be getting through to the judge, but Yumiko tells him that it's not the judge that they need to get through, but the people of the Commonwealth who are observing the trial, many of whom appear to be displeased with the proceedings and the treatment of Eugene. As Eugene looks around at the crowd, Max gives him a reassuring look. Yumiko questions Pamela about the lottery and Pamela tells her that it's about opportunity and hope for a better future, drawing angry murmurings from the watching crowd. Yumiko calls Pamela out on this as Sebastian had said that the lottery was a lie and rigged by the Governor herself. Despite the prosecutor's objections and orders to desist from the judge, Yumiko presses for an answer, reminding everyone that they all heard Sebastian on tape calling the lottery a lie. Pamela lies that it wasn't her son on the tape and that the tape was altered, causing the crowd to grow even angrier, not believing Pamela's claims. Yumiko demands to know if Pamela really wants them to believe that someone altered Sebastian's voice on the tape and Pamela places the blame on Eugene, calling him an enemy of the state who had admitted to playing the tape and causing chaos on Founder's Day, but no one in the crowd believes the governor's lies with one woman even calling for Eugene to be freed as Yumiko looks to Mercer before staring at Pamela incredulously. Later, the prosecution rests its case and Yumiko prepares to as well after glancing at Mercer. However, Eugene asks for permission to address the court on his own behalf over Yumiko's objections. \"The way I see it, I've been living on borrowed time for well past a decade now. And by all rights, someone like me should've met my maker on the very first day that things started to fall apart. But the thing is, I would've, were it not for the aid of friends. Friends who have not only changed me, but changed the hearts and minds of so many others. I am beyond certain that my fate will not discourage them from keeping that going, from helping others to find the courage to do what's right. I was not always a good man. Some time ago, I fell in with a posse who thrived doing some downright unseemly acts on the reg. I looked the other way. I placed value on order and safety above all other things, but I soon realized that I wasn't the one swinging the bat , I nevertheless had blood on my hands. I knew what was happening. My inaction made me culpable and I hated myself for that. So, I did something . In my own little way, I changed the world. And I learned that one person can do that, and sometimes all it takes is one person to do that,\" states Eugene with most of the court looking affected by his words. Yumiko rests her case and Eugene is found guilty of first-degree murder and sentenced to public execution in one hour, leading to outcry from the crowd watching the trial. As the soldiers and the judge struggle to restore order, Pamela leaves with a victorious smirk on her face. However, Pamela's plans to have Eugene executed for Sebastian's death are foiled when Mercer and several of his men break Eugene out and side with the growing uprising. An angry crowd gathers outside of Union Station , demanding answers from the government. In her office, Pamela is furious that Mercer has no idea how Eugene got away and Mercer simply states that Eugene clearly had help. Looking towards the window, Mercer notes that a lot of people are unhappy about the guilty verdict, leaving a large possible suspect list that will take some time to narrow down. Mercer pointedly tells Pamela that there have been reports of people going missing in the Commonwealth for a while which they don't have many answers for, but maybe they'll get lucky this time. Pamela arrogantly orders Mercer to just do his job before more people get hurt and he departs without another word. Left alone, Pamela orders Colonel Vickers to keep an eye on Mercer and to begin a door-to-door search for Eugene. If Eugene is found, he is to be shot on sight. Vickers asks if Pamela wants the army to try to disperse the crowd, but Pamela refuses, stating that they'll find some bones to throw them instead and options are in place to deal with it if things escalate. Once Vickers is gone, Pamela grabs a radio and simply orders \"B17,\" ordering her men to lure a massive herd to the Commonwealth in order to trigger a lockdown. Pamela receives a report from Vickers that Mercer has only seen his sister and then reported to the wall. Although Mercer just pulled additional backup to deal with the horde, Vickers considers it to be nothing unusual. Intrigued, Pamela asks where Mercer took them from and Vickers informs her that it was from Sector 7, Processing and Tunnel H. Claiming that she's sure that Mercer has his reasons, Pamela rejects Vickers offer to recall those troops. Pamela quickly deduces Mercer's true intentions and sets a trap in Union Station and has Vickers arrest Mercer for treason while issuing orders for the army not to stop the herd. A gunfight erupts between Pamela's forces and the Coalition with Rosita desperately trying to get the doors open. One Alexandria resident crawls towards a hiding Connie , Kelly , Magna and Dianne , but he is shot in the head and killed by one of Pamela's men before he can reach them. As the gunfight continues, Pamela herself emerges and grabs a gun from one of her men who is killed by the Coalition. Pamela takes aim at Maggie , but Judith notices and shoves Maggie out of the way just in time, saving her life. Instead, Pamela accidentally shoots Judith, seriously wounding the young girl. Daryl desperately attends to Judith as Pamela watches in horror and the others increase their fire, killing a few more of Pamela's men. Yelling that \"you did this,\" Pamela retreats to her office. Looking for a way out, Daryl spots a fire extinguisher near Ezekiel and signals him to throw it. Grabbing Rick 's Colt Python from Judith, Daryl shoots the fire extinguisher, creating a smokescreen. In Union Square, Yumiko and Max observe the heavily guarded doors to Union Station from across the street. Hearing twigs snapping, Yumiko spots a hooded Eugene sneaking around a train car, armed with Brooks' rifle and she tells Max that they are going to go around. Inside, under cover of the smokescreen, Daryl and the others manage to break the chains sealing a side door. As a trooper approaches the doors, Eugene ambushes him and knocks the man out with the butt of his rifle. Magna finally breaks through the doors, and everyone is reunited with Eugene, Yumiko and Max before quickly making their escape. In her office, Pamela cleans her face of blood when Vickers arrives with the news that the perimeter has been breached, Section F is overrun with the undead and they've lost 15 troopers and more civilians. \"The dead are in the Commonwealth, Governor,\" summarizes Vickers. Pamela is confused as this was only meant to be a standard lockdown while the walkers were cleared out, but Vickers reveals that the dead are climbing the walls and flooding in. As Pamela is overwhelmed by shock, Vickers suggests making a stand to stem the spread and maybe save a big portion of the city, although Vickers admits that it's a long shot. However, Pamela orders Vickers to pull all of their forces back to the Estates instead and to place additional troops at her home and secure the surrounding area. Pamela instructs Vickers to divert the herd towards the lower wards which will buy Vickers time to gather essential personnel, selfishly prioritizing saving the Commonwealth's elite and essential personnel over protecting her people as a whole. A horrified Vickers points out that that would leave thousands of people unprotected and it will be a death sentence for them, but Pamela is only interested in saving herself and a select few. Pamela orders only the Estates to be protected and for the rest of the city to be sealed off and left to the undead. Pamela's forces evacuate all of the doctors, nurses and medical supplies to the Estates where they barricade themselves inside as the Commonwealth is overrun and a desperate crowd gathers outside of the gates, demanding to be let in. At night, Pamela has her men shoot people trying to climb over the gates while Maggie prepares to assassinate Pamela with a sniper rifle from a balcony. The crowd desperately begs Pamela to be let in, amongst them Mr. Martens , Mrs. Martens and Mei . On a balcony, Maggie lines up her shot on Pamela, but Negan tells her to hold on as Mercer and his loyalist forces move in, ordering Colonel Vickers and her men to lower their weapons. Pamela orders Vickers to arrest them, but the Coalition forces join Mercer's troops from another angle, creating a standoff. Pamela accuses Mercer of being a traitor, but Mercer states that she's the true traitor and lists Pamela's crimes: disappearing hundreds of citizens, leading the dead to their doorstep, shooting a child and now leaving thousands to die. The banging on the gates grows more frantic as the herd begins to approach the Estates, meaning that the people will die if they're not let inside. Gabriel moves towards the gates despite Vickers orders to stop. Gabriel announces that they're opening the gate and letting everyone inside, threatening to kill anyone who tries to stop him. Vickers threatens to shoot him, but Carol warns her that they will fire back if she does. Pamela orders her men to shoot Gabriel as he reaches the gates and one of them points a gun at his head. Suddenly, Daryl yells for them to stop. \"What the hell you doing?\" Daryl demands. \"We all deserve better than this. You built this place to be like the old world. That was the fuckin' problem.\" Pamela states that if she opens the gates, the dead will get in too, not just the living. Daryl tells her that if she doesn't, Pamela will lose everything anyway. \"We got one enemy. We ain't the walking dead.\" Realizing that Daryl is right, Vickers orders everyone to lower their weapons and give Gabriel the key to the gates. Everyone stands down and Vickers defers to Mercer's command who places Pamela under arrest for high crimes against the people of the Commonwealth. As everyone rushes to help let the people in, Maggie informs Negan that Pamela is getting arrested and Negan tells her that prison is a fate worse than death for someone like Pamela, causing Maggie to relent in shooting her. The crowd rushes in just in the nick of time, amongst them Jerry and Elijah , before the gates are closed, keeping out the herd. Elijah reunites with a relieved Lydia while Jerry desperately looks for his family before Ezekiel reassures his friend that they're safe back in Alexandria and that they will get back out there to help the people that still need their help. Approaching the gates, Pamela notices a zombified Lance Hornsby , Carol's arrow still in his neck, at the front of the herd, reaching through the gates. Pamela approaches Lance, baring her neck and intending to have Lance bite her as a form of suicide . Judith begs Pamela not to go through with it as it's never too late and they have to help everyone still out there. Before Lance can bite Pamela, Maggie shoots him in the head with her sniper rife, putting Lance down and saving Pamela's life. Maggie states that it's time to take the Commonwealth back. Sitting in a jail cell after the Commonwealth has been saved, Pamela tells Daryl and Carol that it's not easy to have so many lives in your hands. You will have to make ugly decisions such as picking who will do the jobs that no one wants and who gets the nicer house. Carol tells Pamela that they've already had to make an ugly decision by keeping Pamela alive even after everything that she's done because they've all done things. Carol promises Pamela that they will figure it out and Carol will make sure of it. Pausing on her way out, Carol quips that \"at least we don't have to worry about who gets your house\" as they had blown up the Estates in order to destroy the herd. Daryl and Carol leave and Mercer locks the cell, leaving Pamela facing a lifetime in prison for her crimes.",
        "Killed Victims[]": "This list shows the victims Pamela has killed: Roman Calhoun (Caused) Tyler Davis (Caused) Livits (Caused) Jules Butler (Caused) Luke Abrams (Caused) Adrienne (Caused) Rosita Espinosa (Caused) Marissa Berot (Caused) 15 unnamed Commonwealth soldiers (Caused) 3 unnamed Commonwealth prisoners (Caused) 1 unnamed Alexandria resident (Caused) Many unnamed Commonwealth residents (Caused) Numerous counts of zombies",
        "Relationships[]": "For a more in-depth look at Pamela's relationships, read here; Pamela Milton (TV Series)/Relationships",
        "Appearances[]": "",
        "Trivia[]": "Pamela is the seventh and final major recurring primary antagonist in the TV Series , the first being Shane Walsh , the second being Philip Blake , the third being Gareth , the fourth being Negan Smith , the fifth being Alpha , and the sixth being Lance Hornsby . Pamela is the second major recurring primary antagonist in the TV Series to be female, the first being Alpha. Pamela is also the third female character to be classified as a season's primary antagonist, with the first being Dawn Lerner and the second being Alpha. Pamela is one of the three major recurring primary antagonists to not appear in a season premiere. The other two being Philip Blake and Lance Hornsby. Pamela is one of five antagonists to survive the TV Series, the others being Eugene Porter , Negan Smith , Lydia and Vickers . Out of all of them, Pamela was the only one not to renounce their antagonistic ways. Showrunner Angela Kang said the following about Pamela: \"Pamela is the leader of the Commonwealth . And those who know the character from the comics know she's presiding over a community that is very large, very organized, very successful, and very safe. In the show we'll see that she has this interesting backstory that we built for the family she came from and her level of comfort being in the public eye. Laila is amazing and plays the character with such warmth and nuance. She's somebody we'll get to know a lot about over time, but you don't get to see her for a minute.\" [1] In \" New Haunts \", it was revealed by Kelly that Connie and Pamela met before the outbreak and that Connie got her uncle kicked out of congress. Pamela is the third politician that was encountered in the TV Series . The first being Aaron , who was a former politician but left the circuit before he became an actual official politician, due to him believing his best assets can be better used in a hands-on approach, prompting him to join a non-government organization. The second being Deanna Monroe , who was a former U.S. Congresswoman. Dante Esquivel from Fear the Walking Dead is also a politician, being the Municipal President of Tijuana. Qaletaqa Walker can also count as someone who is in politics as being the Chief of the Hopi Tribe. Pamela is one of five main characters in the TV Series to be recognized with a relative \"celebrity\" status prior to the apocalypse (as an influential politician). The other four are Tyreese Williams who was a former NFL linebacker, Deanna Monroe who was a congresswoman from Ohio , Connie who was a journalist and was known to have uncovered a huge corruption scandal, and \" Beta \" who was formerly a musician. Despite being in Fear the Walking Dead , Dante Esquivel, Jim Brauer , Mickey and her husband Cliff also have the \"celebrity\" status. Pamela is the last main character to be introduced in the TV Series. As of \" A New Deal \", Pamela is the only member of the Milton family confirmed to be alive. Pamela is the ninth main character to later become an antagonist. The first being Shane Walsh , the second being Dwight , the third being Spencer Monroe , the fourth being Eugene Porter , the fifth being Anne , the sixth being Gregory , the seventh being Leah Shaw , and the eighth being Lance Hornsby . Pamela is much more sinister than her comic counterpart who, while a corrupt leader, never did things such as purposefully lead herds to the Commonwealth to trigger a lockdown or create forced labor camps. Pamela also appears to be much more competent in many ways, such as actually being able to handle herself against walkers. While the comic Pamela would make a show of hunting walkers, she wasn't actually able to take one down, just wounding it with her shots. The TV version of Pamela handles a few walkers with just Maggie 's help in \" The Lucky Ones \" rather than relying on her men to finish them off. She is also able to handle an AR-15 in \" Family \". Pamela keeping Sebastian as a walker and forcing Lance Hornsby to feed him is similar to the behavior of the Governor with his own undead daughter . When questioned about the nature of the relationship between Pamela and Lance, Laila Robins stated: \"We were playing with the idea that there was an age difference obviously between us, but as a young boy he had a crush on me. Perhaps his father was the chauffeur for my father, Governor Milton. I manipulate this sexual energy between us. Nothing’s ever been consummated but I do use it to manipulate him a bit.\" [2] Unlike her comic counterpart, Pamela is arrested and put in jail for her various crimes, including shooting Judith Grimes . Ironically enough, in the Comic Series this happens to her son Sebastian , who shoots and kills Rick Grimes . Pamela is the third pre-apocalypse politician encountered in the series, with the first being Aaron (who was involved in politics for some time) and the second being Deanna Monroe . Pamela is one of twelve characters to survive the TV Series who also survive in the Comic Series , the others being Maggie Rhee , Michonne Grimes , Eugene Porter , Aaron , Hershel Rhee , Negan Smith , Magna , Yumiko Okumura , Lydia , Juanita Sanchez , and Michael Mercer . Pamela and Livits are the last characters to cause the death of main character, Rosita Espinosa . Excluding the original main cast, Pamela is one of seven main characters who is listed as a main character upon her first appearance, the others being Bob Stookey , Philip Blake , Gabriel Stokes , Michael Mercer , Alpha , and Lance Hornsby .",
        "References[]": ""
    }
]