[
    {
        "\"Papa Bear\"": "",
        "Contents": "",
        "Pre-Apocalypse[]": "Nothing is known about Papa Bear's life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "At some point in the apocalypse, Papa Bear joined a community called the Hilltop Colony . Papa Bear is seen carrying around barrels of moonshine along with a fellow distiller. Papa is seen socializing among other residents at Hilltop. Papa witnesses the return of Michonne and the others with the body of Jesus, as well as captive Lydia. Later attends the funeral for Jesus. Helps with laundry with other residents. Papa witnesses the commotion that ensued when the Whisperers arrived, and arms himself with a spear and joins the other residents at the front gate, later opens the outer gate with another guard to make way for the hostage exchange. Papa listens to Ezekiel's speech declaring the fair open and enjoys the fair with other community members. Later, he listens to Siddiq's speech in sadness. Papa participates in a training exercise on the beach with other Coalition soldiers and later returns to Oceanside. He helps with putting out the fire in the forest that night as a result of the crashed satellite. Papa is among the coalition soldiers at Alexandria to help fight off the waves of the undead, and is later present for the town meeting on what to do with the Whisperers. Papa opens the gate for Magna and her group as they go to defend Hilltop from walkers. Papa works on a construction project in Hilltop with other residents. Papa is among the coalition soldiers at Hilltop to face the Whisperers and Alpha's horde, and retreats after the horde breaks through the barbed wire fence. Papa helps defend the Hilltop from the Whisperers and their horde as the settlement burns. Papa leaves Hilltop with Dianne and another resident to join the Commonwealth. At night, Papa Bear is awoken and rounded up with the rest of the imprisoned Alexandrians and Commonwealth exiles and forced outside to the windmill. He is horrified as the prison warden attempts to execute Annie and Negan, but is relived after back-up arrives and the Commonwealth soldiers are forced to surrender, thus liberating everyone. Papa boards the bus and accompanies the Alexandrians and the liberated prisoners to the Commonwealth. He survives the ambush at Union Station and flees into the streets with the rest of the group as the undead swarm the city. Papa helps enact Mercer's plan to divert the herd out of the Commonwealth and uses riot shields to create a wall in Union Square along with other Alexandrians and Commonwealth citizens.",
        "Killed Victims[]": "This list shows the victims Papa Bear has killed: Possibly numerous unnamed Whisperers Numerous counts of zombies",
        "Relationships[]": "",
        "Appearances[]": "",
        "Gallery[]": "For more images of Papa Bear, please visit Background Survivors (TV Series)/Hilltop Colony .",
        "Trivia[]": "While his name has not been mentioned in dialogue nor has the character been credited, the name Papa Bear comes from a chalkboard displaying his name at the moonshine booth in \" The Calm Before \". The chalkboard reads \"Hilltop Hooch + Papa Quan's Lightnin Shine. Mmm good!\". \"Papa\" refers to Jamel Vaughn's character name from the set, Papa Bear, while Quan is named after the actor who portrays him, Quandae Stewart."
    }
]