[
    {
        "Patrick": "",
        "Overview[]": "Patrick is an earnest, polite, and respectful young man. He generally gets along with the other kids and is quite well-mannered towards the adults, such as referring to Daryl Dixon as \"sir\" and \"mister\". He has a youthful innocence to him, at one point shown to be playing with LEGOs and admitting to not be ashamed despite the toys being for ages 4-12. One day, Patrick starts to feel sick and later dies of an unknown flu. He reanimates and attacks the cellblock, causing chaos to unfold. Everyone is shown to be saddened by his death, with Rick mentioning how he was a good kid.",
        "Pre-Apocalypse[]": "Nothing is known about Patrick's life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "Sometime within the month after the assault from Woodbury , Patrick joined the prison community. Patrick is seen at the outdoor kitchen and is asked by Carol Peletier to watch over the cooking as she speaks to Daryl Dixon . Patrick thanks Daryl for the deer he brought to camp the previous week and requests to shake his hand, which Daryl allows, but not before licking his fingers. Later, Patrick is seen hanging out with Carl and the other kids near the fence. He attends storytime led by Carol, but asks to be excused due to feeling sick, and Carol allows him to leave. That night, Patrick is visibly sick with a cough. He heads to the shower room, covered head to toe in sweat, and leaving sweaty footprints in his wake. He turns on the water, and, not long after, he drops to the floor and dies from an unknown flu. He later reanimates. Karen enters the shower room and hears a noise. She opens one of the shower curtains but does not see anything. As she walks away towards Cell Block D, where many of the prison residents are sleeping, a zombified Patrick gets up from the shower room floor. He finds his way to Cell Block D and enters a cell where a man is sleeping. Patrick bites his victim in the throat before tearing into his stomach, killing the man until he soon reanimates. From there, they stumble into other open cells and attack their victims. As it becomes morning, chaos breaks out in Cell Block D as sleeping residents are awakened by screams and bloody corpses. As survivors in their pajamas flee the massacre, Rick and several others arrive to help. A zombified Patrick attacks Glenn but is put down by Daryl who soon realizes who he just put down. After the attack, the Prison Council discusses what happened and Carol mentions that Patrick was healthy the day before, deducing that the illness must affect the host very quickly. In the prison yard, Rick comforts Carl, who had been friends with Patrick, by saying that Patrick was a good kid. Patrick and the other deceased residents from the attack are buried in the prison yard, with his glasses placed on his tombstone. In a flashback, Patrick is seen inside the prison playing with LEGO. Patrick admits to Rick that he's not ashamed to be playing with a toy meant for young children.",
        "Death[]": "Killed By The Flu (Alive) At night in the prison, Patrick heads towards the showers, covered in sweat and coughing heavily. He turns the shower on before he collapses to the ground and dies from the flu. Daryl Dixon (Zombified) When clearing out Cell Block D, a zombified Patrick attacks Glenn before being shot in the head with a crossbow bolt by Daryl.",
        "Killed Victims[]": "This list shows the victims Patrick has killed: Greg (Infected, Alive) Mr. Richards (Infected, Caused or Direct, Alive) Chloe (Infected, Indirectly Caused) Owen (Infected, Caused) Ryan Samuels (Infected, Indirectly Caused) Ms. McLeod (Possibly, Infected, Caused or Direct) 4 unnamed prison newcomers (Infected, Caused or Direct) Possibly a few zombies",
        "Appearances[]": "",
        "Trivia[]": "The character Patrick was revealed on September 19, 2013 by Entertainment Weekly . [1] According to Carol, Patrick described himself as a practicing atheist. He is the first person to have died due to the flu.",
        "References[]": ""
    }
]