[
    {
        "Paul": "",
        "Overview[]": "Paul is a rebellious and courageous man, who cares about the safety of himself and the people around him, even if it that means standing up to his leaders. After Rick 's group attack the town, Paul is among those who try to leave Woodbury . Though Paul is convinced to stay, he is shown to reluctant and rather unimpressed. Paul is then forced to join the army and helps invade the prison, however he retreats with the others. When the Governor angrily orders the militia to go back the to the prison, they refuse, with Paul being one of the most vocal. Paul stands up to his leaders and is about to go back to Woodbury. However, he is then shot down by the Governor in act of rage along with the rest of the militia. Ironically, he states that he and the others don't want to fight for a place full of psychopaths, when their leader is the most psychopathic of them all.",
        "Pre-Apocalypse[]": "Nothing is known about Paul's life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "Paul is first seen the morning after the raid on their town by Rick's group. He is one of the angry and scared townspeople attempting to leave Woodbury. As Karen pleads with Shumpert and Martinez to let them leave, Paul demands the guards to let them out. He watches as one man is kicked off the wall as he attempts to leave, and another man pulled from his car after he refuses to stop honking at the gate. Moments later, screaming is heard from within Woodbury and people are fleeing down the street. The walls had been breached and several zombies have invaded the streets. A group of them managed to attack Richard Foster and seriously injure him with several bites. Paul watches in horror as the Governor walked up to Richard lying in the street and shot him in the head, out of mercy and annoyance, and because of Richard's cries of agony. Later that day, after Andrea gave her speech about why everyone should stay in the town and rebuild, Paul agreed with her, but otherwise looked unimpressed. Paul is seen invading the prison and firing on walkers. He is also seen making a retreat once Glenn and Maggie opened fire. Afterwards, he is one of the first to object to what just happened, he attempts to walk away from the Governor resulting in him being the first to die when the Governor opens fire on his own people, being shot in his shoulder. Paul's corpse appears in a brief flashback after he was killed with the other Woodbury residents by the Governor.",
        "Death[]": "Killed By Philip Blake After the failed ambush at the prison, Paul argues that it is not right to go back there. As he turns back, he is shot in the back by the Governor.",
        "Killed Victims[]": "This list shows the victims Paul has killed: Numerous counts of zombies",
        "Appearances[]": "",
        "Trivia[]": "Originally, Paul was not a character being cast for. However, the producers were impressed with E. Roger Mitchell's performance that the character Paul was created for him, after he did not get the role of \"Citizen\" that he originally auditioned for. [1] Paul is one of the most used names in TV Series with it being used three times. This character is the first character introduced to be named Paul. Including variations of Paul such as Paulie and Paula , this makes it the second most used name in the TV Series, with there being 6, only behind Michael . This character is the second character introduced to be named some variation of Paul.",
        "References[]": ""
    }
]