[
    {
        "Paula": "",
        "Overview[]": "In the early days of the outbreak, Paula started out as weak but overtime became a hardened survivor. She is similar to Carol in many ways. Both had undesirable lives before the apocalypse, with Paula being burnt out by her boss and Carol being abused by her husband. When the outbreak began, both lost their families and were forced to become ruthless survivors. Paula is shown to have become desensitized to killing, revealing she stopped counting how many people she killed after it hit double digits. Unlike Carol however, Paula is shown to have lost her humanity and has no qualms with killing while Carol is afraid of what she will become if she continues doing so.",
        "Pre-Apocalypse[]": "Paula was a family woman who lived with her beloved husband and four daughters in Washington, D.C. She worked as a secretary under an unappreciative boss which put a heavy strain upon her lifestyle and essentially made her a burned-out employee trapped in a cubicle working a thankless occupation.",
        "Post-Apocalypse[]": "During the onset of the outbreak, Paula was present at her workplace when the military arrived. However, to her misfortune, only essential government employees and members of congress were being evacuated while everyone else was ordered to stay indoors wherever they were, effectively leaving Paula stuck at her workplace alongside her boss. Due to her boss not having any survival skills whatsoever, Paula was forced to kill him to avoid being killed by his ineptitude and went back home, only to tragically discover that her husband and all of her four daughters had already died. At some point after this event, Paula somehow came into contact with a group named \"the Saviors\" which she subsequently joined upon where she was appointed as one of Negan Smith 's personal lieutenants, during where she developed a sexual relationship with her fellow survivor Donnie . Paula aided her group in terrorizing other survivors and communities around the area into subjugating to Negan's will, where their victims would be forced to give half their supplies in exchange for not being murdered. Having escaped the Satellite outpost, Paula radios Primo 's walkie-talkie, ordering Rick Grimes and his group to lower their weapons after their attack on the compound. She refuses to show herself to Rick and reveals that she is holding Carol Peletier and Maggie Rhee hostage. When Rick offers to trade Carol and Maggie for Primo, Paula and her surviving companions decide to take their prisoners to a safe house while they wait for reinforcements. As Carol is tied up, Paula looks annoyed at her for hyperventilating and tells Donnie they need Carol alive as insurance until backup arrives in 30 minutes. However, he smacks Paula and tries to kill Carol only for Paula to knock him unconscious with the butt of her gun. She then angrily instructs Michelle to interrogate Maggie in another room. Shortly after, Rick radios Paula to ask if she's considered his proposal to trade hostages but she delays her decision and ends the transmission. Paula and Molly then question Carol over her group's motives in their unprovoked attack on the compound. Carol answers that they had previously been attacked by a few of their people on the road, instilling them with a fear of Negan. Paula tells Carol that her boss was the first person she killed after the fall, and says she stopped feeling bad about killing people when her body count reached double digits. Carol accuses Paula of living among killers, but Paula counters that Carol's people are killers, too, making Carol a killer. After Carol tells Paula that she'll die unless she makes the trade, Paula eventually radios Rick again and tells him to meet her in a nearby field. Afterwards, she worries that the absence of static on the walkie means that Rick's group is close to the slaughterhouse. Paula and Molly then leave Carol alone in the cell as they secure the base. When she returns to the room, Paula discovers Molly has been killed and runs after Carol and Maggie, who have become trapped in a hall full of impaled but living walkers. As Paula fires at them, she runs out of bullets and Carol aims her gun at Paula and orders her to run, despite Maggie's insistence that Carol kills Paula. After Paula is shot in the shoulder and Michelle is promptly killed too, Paula asks what Carol is so afraid of when she's so capable of surviving. She then tries to lunge at her but Carol shoves Paula into a speared walker, which tears off a good portion of Paula's cheek as she screams in agony and dies from blood loss and/or trauma. Eventually, Paula reanimates and is then put down by Maggie.",
        "Death[]": "Killed By Carol Peletier (Caused) Zombies (Alive) Paula is shoved by Carol into a pike impaling her and then gets her cheek bitten off by a walker. Maggie Rhee (Zombified) After Paula reanimates moments later, Maggie stabs her in the head.",
        "Killed Victims[]": "This list shows the victims Paula has killed: Her Boss Donnie (Caused) Numerous counts of zombies and unnamed people (Caused and Direct)",
        "Appearances[]": "\" Not Tomorrow Yet \" (Voice Only) \" The Same Boat \"",
        "Trivia[]": "The casting call for this character used the name Polly . [1] Paula was described as \"40s to 50s. Cool, controlled, formidable. She's faced tragedy and trauma and come out the other side stronger and harder. But she's also become colder and less outwardly emotional. She avoids attachments and maintains a toughly pragmatic, nihilistic worldview.\" The zombified Paula was played by another actress because there wasn't time to get Alicia Witt made up as a zombie. Alicia Witt stated that she had a line that she was supposed to say to Carol Peletier which was \"You seem like someone I would send weird cat pictures to\", but it wasn't said in the show. On the Netflix version of the episode, that line appears. Paula is the first named Savior lieutenant to die and the first known female Savior lieutenant. While her exact kill count of living people is unknown, she mentions at one point that it is in the double digits. Paul is one of the most used names in TV Series with it being used three times. Including variations of Paul such as Paulie and Paula , this makes it the second most used name in the TV Series, with there being 6, only behind Michael . This character is the fourth character introduced to be named some variation of Paul.",
        "References[]": ""
    }
]