[
    {
        "Paul Wells": "",
        "Overview[]": "Paul is a cocky, arrogant, and bellicose individual. Like the rest of the Reapers , he is a ruthless survivor who has no problems slaughtering innocent survivors. He takes part in torturing Daryl and later taunts him about his relationship with Leah . Due to his military training, he is a skilled fighter and seems to take joy out of killing walkers. He is shown to be brave, being willing to lead an entire horde of walkers by himself away from Meridian . While doing so he shows no fear and even jokes with Leah on his walkie-talkie. When he becomes surrounded by walkers, rather than flee, he chooses to fight the entire horde all by himself despite the odds being stacked against him. Paul is shown to be a skilled fighter, effortlessly dispatching multiple walkers with ease and Leah has stated that Paul has killed entire hordes before with ease with the skill he displays confirming her words. However, unbeknownst to Paul, Negan and Maggie are walking amongst the walkers in Whisperer masks. The two stab Paul and he becomes disoriented which leads to him being brutally devoured by walkers. Despite this, he's still able to take out several walkers before he goes down, further showing his fighting skills. It's later revealed that Pope had used Paul as bait to see if Maggie was the one responsible for bringing the herd to Meridian. Paul's death is an example that Pope doesn't care for his men and is willing to sacrifice them. Though Pope calls Paul a son to him, he shows very little remorse over his death which pushes Leah towards the decision to kill Pope herself.",
        "Pre-Apocalypse[]": "Prior to the outbreak, Paul was fighting in Afghanistan along with the rest of his squad which included a lot of members that would eventually become the Reapers . Upon returning from war, he struggled to find jobs or deal with trauma, but the relationship between him and his comrades remained strong. He then decided to become a mercenary.",
        "Post-Apocalypse[]": "During the beginning of the outbreak, as Operation Cobalt was put into action in an attempt to try and contain the undead threat, Pope and a group of his people managed to escape the bombings by running until they reached an abandoned church, where inside Pope was amazed to see none of them had been killed or injured, leading him to view him and his comrades as \"the chosen ones\". It is unknown if Paul was present during this revelation. Regardless, he eventually joined the Reapers, and either found or crafted his own mask with a grey, skeletal expression on it, and would use this mask as a scare tactic against those who were \"marked\" by Pope. At some point, Paul and his group eventually attacked a group of survivors led by Maggie Rhee despite having no previous hostilities with her group and succeeded in destroying their camp and killing numerous members of her group, causing them to flee to Virginia. He and his group eventually followed them to finish them all off due to his leader, Pope marking Maggie's group. Paul is among the Reapers who ambushed Maggie 's group on the road leading to Meridian. They killed Roy and severely injured Cole , prompting Maggie's group to scatter into the woods with Jenson and the other Reapers going after them. Chaos breaks out in the woods as Paul and the Reapers hunt down members of Maggie 's group, killing Cole injuring several others, including Duncan , Negan , Daryl , and Gabriel . While Daryl is being taken in for interrogation by Carver and Powell , Paul can be seen amongst his comrades within Meridian . Paul assists Brandon Carver and Leah Shaw with waterboarding Daryl after he is captured by the group, interrogating him for information regarding Maggie and her people. Daryl persists, and is dragged to a cell by Paul and Carver. Later on, Paul is present with Brandon Carver and Bossie as they take Daryl to a small wooden shack in Meridian, where they claim Daryl is about to meet Pope. Leah enters, and the three leave, only for Leah and Daryl to both be locked inside as fire is set to the structure, which they both manage to escape from. Paul is seen waiting outside with all the other Reapers for the inductee to pass the test. As Pope declares Daryl \"forged by fire\", Paul and the rest of the Reapers welcome Daryl with a latin mantra. He is later seen at a bonfire where the Reapers are eating dinner. He later watches in silence as Pope burns Bossie alive for presumed betrayal, claiming he allowed Michael to be killed in order to save himself. Paul is present when Pope and the rest of the reapers are observing the herd. After a suggestion by Daryl, Pope assigns Paul to lure the herd away from the Meridian. Paul does so, joking with Leah via radio as he lures the herd into the woods. Soon, Paul discovers another herd approaching him from behind and radios in to Pope, telling him that they have a situation. Paul starts to kill the walkers but is stabbed by both Negan and Maggie while they are dressed as the dead. After this, he is overwhelmed and devoured by the undead as Leah tries to contact him.",
        "Death[]": "Killed By Daryl Dixon (Indirectly Caused) Pope (Indirectly Caused) Negan Smith (Caused) Maggie Rhee (Caused) Zombies After seeing the incoming horde of walkers coming to Meridian, Pope sent Paul to lure them away into the forest. While fighting off walkers, Wells is stabbed by both Negan and Maggie while they are dressed as the dead. After this, he is overwhelmed and devoured.",
        "Killed Victims[]": "This list shows the victims Paul has killed: Ms. Adams (Possibly) Leo (Possibly) Teresa (Possibly) Numerous counts of enemy combatants (Pre-Apocalypse) Possibly unnamed Meridian residents Numerous counts of zombies and unnamed people",
        "Quotes[]": "The following is a list of some of Paul's most memorable quotes.",
        "Appearances[]": "\" Acheron: Part II \" (No Lines) \" Hunted \" (No Lines) \" Rendition \" \" For Blood \"",
        "Trivia[]": "Paul is killed very similarly to Jesus , having attempted to kill someone they thought was a walker only for it to be a disguise and be stabbed themselves. They both share the same first name, Paul. Paul is the only Reaper to be killed by walkers on-screen. Paul was credited in \" Promises Broken \" but did not appear in the episode. Paul is one of the most used names in TV Series with it being used three times. Wells is the third and last character introduced to be named Paul. Including variations of Paul such as Paulie and Paula , this makes it the second most used name in the TV Series, with there being 6, only behind Michael . Wells is the sixth and last character to be named some variation of Paul. Robert Hayes is a huge fan of the show ever since the first episode and had auditioned for Season 2 . [1]",
        "References[]": ""
    }
]