[
    {
        "Pre-Apocalypse[]": "Little is known about Penny's life prior to or as the outbreak began, except that she was an only child and had a mother and father . She likely attended school somewhere in Georgia . Her mother died in a car accident eighteen months prior to the outbreak, leaving her and her father to rely on one another.",
        "Post-Apocalypse[]": "Following the outbreak, Philip and Penny eventually arrived at the town of Woodbury after previously barricading themselves in an apartment. Her father was able to fortify the town with the help of other survivors and eventually transformed it into a safe, thriving haven. At some point however, Penny tragically died and reanimated. While the circumstances of her death are unknown it is hinted she may have died as a result of hostile survivors as her father would later reveal that had he been murderous from the start of the outbreak, Penny would still be alive. Penny's death drove her father to near insanity and he refused to put her zombified corpse down and instead kept it in secret in a locked room in his apartment, possibly with the hope she could one day be cured. He would often interact with his zombified daughter, pretending Penny was still alive and would feed her flesh. Penny is seen through a picture of her father at the end of the episode. Penny is first seen calm and quietly wheezing in Philip's apartment. He is brushing her hair and accidentally rips off part of her scalp, causing her to turn aggressive. Philip ties her arms into a straight jacket and places a cloth bag over her head until she calms down. Philip then kisses her on the forehead. Michonne is seen through the window, standing on the street and staring up at Philip's apartment. It is unclear if she could see them inside. Michonne then sneaks into Philip's apartment to steal her katana back and opens a notebook with notes about town governing, and listing residents of Woodbury (possibly a list of deceased residents). Penny is listed at the bottom and her name is underlined. Later that day, Michonne mentions the name Penny to Philip and proceeds to threaten him with her katana. When Andrea goes to talk to The Governor, behind him pictures of his family can be seen behind them, Penny amongst them. The Governor comes into his secret room with a bowl of meat. After opening Penny's cage she comes out running but is stopped by her chain. The Governor takes off her hood and demands that she look at him. In frustration, The Governor locks her back up. After stumbling upon Penny caged inside The Governor's home, Michonne unleashes her, not initially realizing she was reanimated. Upon unveiling Penny's face, Michonne becomes aware of Penny's undead state and prepares to put her down, but is interrupted by The Governor's arrival. The Governor pleads with Michonne to spare Penny, but is unsuccessful as Michonne ultimately kills her with a sword stab to the back of the head. The Governor is later seen holding and weeping over Penny's corpse after his scuffle with Michonne. Philip looks at the photo of Penny, his wife, and himself a couple of times throughout the episode. He burns the photo when he's about to leave the Chambler's apartment. He also refers to her as \"someone he loved very much\" that he was \"trying to protect\" when talking to Meghan Chambler about when he lost his eye.",
        "Death[]": "Killed By Unknown Cause (Alive) At some point during the outbreak, Penny died and reanimated. Philip managed to keep her undead-self contained and cared for her in his apartment. When Milton asks Philip what Penny would think of his psychopathic nature, Philip answers that Penny would be terrified of him, but she would also be alive. This indicates that Penny was likely killed by a survivor in a situation where Philip was not ruthless enough to prevent. Michonne Hawthorne (Zombified) Michonne discovers a zombified Penny and, despite being begged by The Governor to leave her alone, plunges her katana through the back of her head.",
        "Killed Victims[]": "This list shows the victims Penny has killed: Possibly a few unnamed people (Infected)",
        "Appearances[]": "",
        "Trivia[]": "Penny Blake is portrayed by two actresses: Kylie Szymanski and Savana Jade Wehunt in \" Made to Suffer \" in one scene when Penny's face was covered with a bag. Penny is the second female child to have died in a mid-season finale, the others being Sophia Peletier (Season 2) and Meghan Chambler (Season 4). Beth Greene 's death in the mid-season finale of Season 5 could be considered a fourth appearance of this theme, as Beth was either 17 or 18 at the time of her death. As revealed on Talking Dead , the children who portray walkers are given blueberry-flavored blood to gargle, instead of the regular type, which is given to the adults.",
        "Name": "Penny Blake"
    }
]