[
    {
        "Percy": "",
        "Overview[]": "Percy is a kind-hearted old man. Despite barely even knowing Beth , he is willing to help her distract the cops by pretending to be sick. Percy often gets pushed around by the corrupt cops at the hospital, such as O'Donnell and is unable to defend himself.",
        "Pre-Apocalypse[]": "Nothing is known about Percy's life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "Percy is seen standing outside his room, participating in a plan that he and Beth Greene made to create a distraction. After he receives some strawberries from Beth, he fakes a sudden and severe coughing fit. As Beth sneaks off to the hospital's medicine cabinet to retrieve some epinephrine for Carol Peletier , a new patient at the hospital who happens to have been part of Beth's previous group, Percy continues to cough, distracting Officers Alvarado and Tanaka . When Beth walks by, as a sign of mission complete, Percy stops coughing and alerts the officers that he is fine. Percy is harassed by Officer O'Donnell but is saved from harm after Dawn Lerner tells O'Donnell to back off. After the deaths of Beth and Dawn during the unsuccessful hostage exchange, Rick Grimes lets the patients know that they can leave the hospital with his group if they wish. However, Percy, Dr. Steven Edwards , and the other patients choose to stay. With the multi-year time skip, the community of survivors at Grady Memorial eventually fell and everyone was killed, including Percy. [1]",
        "Death[]": "Killed By Unknown causes At some point, Percy and all the other Grady Memorial residents died due to unknown causes.",
        "Killed Victims[]": "This list shows the victims Percy has killed: Possibly numerous counts of zombies",
        "Appearances[]": "\" Crossed \" \" Coda \"",
        "Trivia[]": "Percy was meant to appear in \" Slabtown \", but his scene was deleted. In a deleted scene for \" Coda \", Percy is critically injured after O'Donnell shoves him down. He refuses help from Dr. Edwards but Beth tells him that he should get the help. Dawn ultimately tells Dr. Edwards to help him.",
        "References[]": ""
    }
]