[
    {
        "Pete Dolgen": "Pete Dolgen",
        "Overview[]": "Although he only appeared in one episode, Pete was shown to be an unselfish, determined and caring person who was a strong survivor and very fair minded. He was shown to have a somewhat good relationship with his older brother, Mitch, though the two appeared to have many conflicts and appeared to be a respected member of Martinez's camp. Following the death of Martinez, Pete showed his potential as a leader for a short time, though appeared to find the task a challenge as he revealed to the Governor. In contrast to his brother Mitch however, Pete was not a hardened survivor and preferred to do the right thing than make the hard call as seen when he refused to rob a camp at his brothers urging and instead stated they should take them in, despite the fact there was no room available at their camp. After discovering the camp had been raided, Pete was more concerned that the people were all dead than the supply load being taken and was visibly shocked when Mitch mercilessly killed an injured survivor, showing Pete did not see murder as a necessity. Ultimately, Pete's decisions to do the right things and spare the camp led to his violent death at the hands of the Governor who killed him to establish his position of leader.",
        "Pre-Apocalypse[]": "Pete mentioned he was in the Army and was stationed at Fort Benning when the outbreak happened. He tried to maintain his position for some time but ultimately abandoned his post and joined up with his brother.",
        "Post-Apocalypse[]": "Pete Dolgen was part of Martinez 's group of survivors and together with Mitch , his brother, is one of Martinez' trusted allies. He first appeared when Martinez finds Philip Blake and Meghan Chambler in a pit. After Martinez helped them out and offered them to join, Mitch argues that they are only a burden, to which angrily Pete replies they got a kid. When Martinez, Philip, Pete and Mitch are on a supply run, they come across three dead bodies, each found together with texts written on card boards, \"Liar\", \"Rapist\", and \"Murderer\", the first two decapitated while the third one shot himself in the head. They find a cabin which they enter. Inside, Pete is attacked by a walker but Philip puts it down before it causes any harm. When Pete activates his flashlights, he spots two zombified heads belonging to the two bodies they came across earlier and is clearly scared. Later, the four of them are drinking beer while talking about their past. Pete was a soldier stationed at Fort Benning, where he was one of the longest to remain there. Mitch replies that Pete is too loyal to bounce. After Philip secretly kills Martinez, Pete declares himself temporary leader of the group until a vote can take place. On a supply run with Philip and Mitch, Pete tells how difficult it is to lead a group, something to which Philip agrees to. When the three of them come across a small camp with survivors, Mitch mentions they should raid them, something that Pete strongly disagrees to, as he wants to either bring them into their own camp or find their own supplies. Later, Philip walks away from them, back to the camp and it turns out everyone is killed and all the supplies are gone. Mitch becomes angry, saying they would have died anyways, but now the supplies are with someone else. An old man who is critically hurt is killed by Mitch, much to the dismay of Pete. Back at their own camp, Philip visits Pete under the guise of wanting to talk about Mitch's behavior. However, Philip stabs Pete in the back and strangles him to death. Later, Philip tells Mitch he killed Pete because he would have done the right things at the costs of his own people. Philip also says that he agreed to raid the camp and does not care about Mitch killing the old man. After Philip dumps Pete's dead body in a nearby lake, it later turns out he reanimated underwater with his leg chained to a weight on the bottom, providing Philip a similar view as the heads in the fish tanks in Woodbury.",
        "Death[]": "Killed By Philip Blake (Alive) The Governor, believing Pete to be weak and unworthy of leadership, goes to his RV to talk. When Pete turns to face him, The Governor stabs him in the back and then brutally strangles him to death without remorse. Later, his body is dumped into a lake and he reanimates.",
        "Killed Victims[]": "This list shows the victims Pete has killed: Possibly numerous unnamed enemy combatants (Pre-Apocalypse) Numerous counts of zombies",
        "Appearances[]": "\" Dead Weight \" (Flashback)",
        "Trivia[]": "The casting call for this character used the name Patrick . Pete was described as \"Mid 30s. Fair-minded.\" He became the embodiment of the episode title in two ways. First, he was dead weight in Philip's eye because of him always doing the right thing even at the cost of his own people. Second, when he reanimated under water, he was chained to the bottom, making him literally dead weight. In \" Made to Suffer \", Philip told Andrea that he kept zombified heads in jars in order to prepare for the horrors of war. His going back to view a now undead Pete chained to the bottom of a lake mirrors this theme and expands on it as well as Philip's speech about heroism being for fools. Pete essentially becomes a \"road not taken\" that Philip can look at and regain his resolve. Pete is the only member of the River Camp to have an undead status. He is also one of nine survivors to be classified as being undead, the other eight being Jim , Callaway , Eric Raleigh , Winslow , Matias , Lucille , Clara , and her husband Eddie . While Duane Jones was also classified as undead at the end of the TV Series, he was finally put down in the episode \" King County \" of Fear the Walking Dead .",
        "Name": "Pete Dolgen"
    }
]