[
    {
        "Dr. Pete Anderson": "",
        "Fate": "",
        "Contents": "",
        "Overview[]": "Although initially appearing as a somewhat kind and welcoming person, Pete is later revealed to be a violent, abusive and alcoholic man. A strong desire for dominance may be the reason why Pete chooses to abuse his wife and children, regardless of the physiological damage it is causing them. Pete appears to show no remorse for his abusive actions at all. Pete is shown to despise anyone who tries to get in his way of dominating his wife and turning her against him as shown when Rick Grimes convinces Jessie to stand up to him, he engages Rick in a fight. After once again seeing Rick simply speaking to Jessie, Pete flies into a violent, alcoholic rage and sets out to kill Rick once and for all, which ends up with him slitting Reg Monroe 's throat and causing his own demise in the process, all the while refusing to accept that he had caused this situation. Despite his abuse, Pete's sons Ron and Sam do seem to care somewhat for their father as they both show signs of grief following his death and Ron shows bitterness towards Rick for killing his father. Ron also becomes extremely angry when Rick's son Carl tells him that \"your dad was an asshole.\"",
        "Pre-Apocalypse[]": "Jessie notes that things happened in Pete's life which led him to become rather vicious and have angry outbursts; however, she also states that he received help from psychiatrists which helped maintain his anger. Pete attended college to study art with Jessie and had a relationship with her, resulting in her getting pregnant. He later became a surgeon to provide for his family. [1]",
        "Post-Apocalypse[]": "At some point during the outbreak, Pete and his family made their way toward the Alexandria Safe Zone where they settled. Pete was made the resident surgeon of the town and was noted for doing \"incredible things\" for several patients. Pete smokes on his porch when newcomer Rick Grimes is walking around Alexandria at night. He mentions how his wife has cut Rick's hair and welcomes him to the Safe-Zone. Pete formally introduces himself to Rick at the welcome party being thrown by Deanna Monroe and mentions that he is the town doctor, offering Rick to drop by sometime for a check up. Later, he and Jessie wave at Rick as he walks around Alexandria. When he tries to wrap his arm around Jessie, she shrugs him off publicly. Pete stops by Rick's house, visibly drunk, and offers him a beer, but Rick declines saying he's always on duty. After briefly discussing the death of Rick's wife Lori , Pete says that the people in Alexandria have also lost things, even if that seems hard for Rick to believe. He also tells Rick to take Carl and Judith to him for a check-up and then leaves, patting Rick's shoulder and declaring them friends before exiting the house. Later on, Carol Peletier comes by Pete's residence and asks to see Jessie. Pete declines and says that she can't be seen. Carol immediately reports to Rick and mentions Jessie's abuse. Pete approaches Rick while he is standing outside by the water and asks him what is wrong. Rick coldly tells him to \"keep walking\", angered at the revelation that Pete has been abusing Jessie and possibly Sam . With Rick's help, Jessie stands up to Pete and he is ordered to live separately but instead confronts Rick and a scuffle ensues between the two, which results in them crashing out of the window and fighting on the town square as Alexandria residents rush to witness the fight. Pete hits Jessie when she attempts to break up the fight, enraging Rick and causing him to gain the upper hand and strangles Pete when he sees Sam's floating red balloon and threatens to kill Pete if he abuses Jessie or Sam again. However, Pete is spared when Deanna manages to get Rick to break up the scuffle. Pete carefully watches Rick and Jessie's conversation from the separate house he was put in by Deanna, angrily looking back and going back inside his house. When Carol comes by to give Pete a casserole and to check on Tara Chambler , who was gravely injured two days before, he asks her what she is doing in his house and quickly tells Carol to get out. Carol then threatens him, saying that if he were to harm her, Tara, or anybody, she would not hesitate to kill him, quickly adding that she could kill him right now and everyone would believe he had tried to hurt her. Carol then leaves Pete's house, where he soon lets out his frustration by knocking down and throwing away any furniture he saw in his living room off-screen after breaking her casserole's Tupperware. Later at night, Pete, who seems to be drunk, goes over to Rick's house and takes Michonne Hawthorne 's sword, intending to kill Rick with it, and goes out to find him. He appears at the night gathering after Rick explains himself. He shouts at everyone that Rick is not one of them before moving in with the katana. Reg Monroe steps forward and tries to calm Pete, but Pete accidentally slits his throat and Reg collapses, bleeding out in Deanna's arms. Abraham Ford disarms Pete and holds him to the ground. Deanna, her husband dying in her arms, gives Rick the order to kill Pete, which he does instantly. Pete's corpse is covered and is about to be buried in the Alexandria graveyard along with Reg's, but as Gabriel and Tobin are digging the graves, Rick appears. He tells them to stop, claiming no killers will be buried inside the walls. Deanna then appears and agrees and tells them to bury Pete several miles down the road as Ron eavesdrops. Pete's corpse is then buried in the forest several miles away from the community by Morgan and Rick.",
        "Death[]": "Killed By Abraham Ford (Caused) Himself (Caused) After slicing Reg's neck, Pete is immediately tackled by Abraham and disarmed by Michonne. Pete starts yelling \"THIS IS HIM\", wanting to blame Rick as he drove him to do this. Deanna Monroe (Caused) Rick Grimes Deanna, driven by rage, tells Rick to \"do it\". Abraham steps back quietly and Rick, without hesitation, executes Pete by shooting him in the head.",
        "Killed Victims[]": "This list shows the victims Pete has killed: Reg Monroe (Accidental) Himself (Caused) Possibly numerous counts of zombies",
        "Relationships[]": "For a more in-depth look at Pete's relationships, read here; Pete Anderson (TV Series)/Relationships Alexandria Safe Zone Jessie Anderson † - Wife and Abuse Victim Ron Anderson † - Son and Abuse Victim Sam Anderson † - Son and Abuse Victim Deanna Monroe † - Leader and Caused Killer Reg Monroe † - Accidental Victim Rick's Group Rick Grimes - Attempted Victim and Killer Carol Peletier Abraham Ford † - Caused Killer",
        "Quotes[]": "The following is a list of some of Pete's most memorable quotes.",
        "Appearances[]": "",
        "Trivia[]": "Pete is the first member of his family to die. Pete is the last character to die in Season 5 . His name is excluded from the IN OUR MEMORY wall of Alexandria, likely due to him killing Reg. He is the only member of his family to not have been devoured by walkers . He is also the only one of his family to not have been killed in \" No Way Out \". Pete is one of seven Alexandria residents to be an antagonist, the others being Carter , Nicholas , Ron Anderson , Aiden Monroe , Spencer Monroe , and Vincent .",
        "References[]": ""
    }
]