[
    {
        "Philip Blake": "Philip Blake",
        "Overview": "The Governor is shown to be a cunning, manipulative, cruel, callous, savage, brutal, sociopathic, megalomaniacal, fearless, apathetic, stoic, psychopathic and highly intelligent man who is a determined survivor and a strong leader to those in his group. According to producer Gale Anne Hurd, the Governor is extremely delusional and believes that he is almost a messiah and destined to be a leader. He is prone to fits of psychotic rage and this combined with his utter lack of mercy make him a dangerous person and physical opponent. In Season 3 , the Governor put on a façade of congeniality and was initially introduced as being a kind, generous person dedicated to keeping his community safe. In reality, however, he is gradually revealed to be a volatile, depraved, and unpredictable psychopath, very capable of cold-blooded murder and is also a smooth talker, being easily able to talk his way out of situations using his \"charm\". He was also highly manipulative, and thought nothing of using others and coercing them into doing his bidding. The Governor was also completely obsessed with protecting the people he cared about and he attempts to accomplish this by taking charge of the group, and doing what was necessary for their survival, which mainly included killing anyone who was a potential threat to them without hesitation. He also had dark secrets, such as keeping his zombified daughter in a closet and having fish tanks filled with walker and human heads. He claimed that he kept the tanks full of heads to harden himself to the harsh realities of life outside the idyllic walls of Woodbury. Despite this, the Governor did not care if his victims came back as walkers and overall took pleasure in removing anyone whom he perceived as being a threat to him and his group. Despite his psychopathic nature, he truly loved his daughter Penny and protected her strongly during the apocalypse and was utterly devastated by her death to an extent so great that he refused to put her zombified corpse down and was even more devastated when she was put down by Michonne Hawthorne . Throughout Season 3, he gradually became a much more cold-hearted and barbaric person and his darker personality was fully exacerbated following Michonne's killing of his zombified daughter, thus triggering severe homicidal desires within him. From then on, he lost most of his sanity and only desired to be on a warpath, seeking retaliation on Michonne and Rick Grimes ' entire group and setting out to slaughter them all. The Governor's desire to destroy Rick's group was so strong that he slaughtered almost every member of the Woodbury army when they refused to aid him in his quest. In Season 4 , after being abandoned and wandering alone for months following the fall of Woodbury, the Governor adopted a \"makeshift family\" that he found whilst wandering and retains much of his old self. However, he lied to them, keeping his past and his violent nature a secret, while convincing himself that he is doing this to protect them (which is true). According to his actor, David Morrissey, the Governor was genuinely conflicted inside about protecting those he cares about with violence and barbarism, and was constantly fighting himself in a \"Jekyll-and-Hyde\" manner. This internal conflict makes him almost a tragic character; however, this battle with himself ultimately proved to be fruitless, as he quickly returned to his old actions to protect his new family and new group by killing Martinez and later Pete Dolgen to re-establish his position as a leader and attempting to take the prison from Rick's group by holding Hershel Greene and Michonne hostage, eventually brutally killing Hershel and almost succeeding to kill Rick. He dies a disgraced, cold-blooded, remorseless, and sadistic mass murderer, and is put down by one of the very people he swore to protect, yet failed to.",
        "Pre-Apocalypse": "Philip was born in the mid 1960's and grew up in Meriwether County alongside his brother. The pair experienced a rough childhood and thus held a negative relationship with their father whom was physically abusive towards them both. As a child, Philip often played chess with his father which he frequently lost to, as he often pressured Philip into making quick decisions and thus never showed mercy, which caused Philip to lose confidence in himself. At a young age, the brothers were caught smoking a pack of cigarettes belonging to their father in a garage. His brother intervened, taking the blame for their actions (when in actuality it was Philip who was responsible). Regardless, the siblings were beaten up by their father. The futility of his brother's attempts to stand up against their father had a strong impact on Philip's development and led him to believe of heroes as fools who only bring harm upon themselves and others. In spite of his brutal upbringing, Philip grew to become a family man where he had a beloved wife and a daughter named Penny where the three lived together as a typical family. He also had a pet dog who he called a \"wonder of stupidity\", and jokingly said that it \"lost a fight with a tree once\". Over time however, Philip gradually grew to become dissatisfied with his plain, mediocre life where he worked as an office drone under a younger and unintelligent boss who hounded him for several years. Eighteen months prior to the outbreak, while at work one day, Philip received a call from the hospital informing him that his wife had tragically died in a car crash. This event left Philip emotionally devastated, especially after she had previously left a message for him to call her back, which he never did, (an action for which he deeply regrets). After her death, Philip and Penny began to rely upon each other.",
        "Post-Apocalypse": "After the onset of the outbreak, Philip alongside his daughter and nine other survivors barricaded themselves up in an apartment (for an unspecified amount of time) before they eventually moved out, picking up several new group members along the way notably including Milton Mamet , Martinez , Shumpert . They eventually discovered the abandoned town of Woodbury. After they secured the town, Philip established a fortified community which gradually began to increase in numbers and through his charisma he established his leadership role and became known as \" The Governor \", a name he didn't approve of. His community eventually grew to contain about 73 survivors. His charismatic personality led many of the community to look up to Philip and admire his leadership. At an unknown point however, Penny tragically became infected and later reanimated. Due to his inability to come to terms with his daughter's death Philip kept her infected corpse locked away inside his closet (which he kept hidden from the community.) Penny's death affected him severely, and most likely contributed towards his development into a ruthless, pragmatic and hardened survivor. It is hinted that Penny may have died as a result of people as the Governor would reveal that had he been murderous from the start of the outbreak, she would still be alive. Philip resided in a lone apartment where he kept a collection of severed heads encased in water tanks, the reason behind this was to prepare him for the outside horrors. The Governor commanded his group to scavenge for food, supplies and weaponry in order to help strengthen the community during which he and his group raided several camps and killed numerous innocent survivors in order to accomplish this. In addition he sent out several groups to capture and imprison walkers - which would then be utilized for stage fight tournaments as a form of entertainment for the residents of Woodbury. It was during this period where the Governor eventually came across a mortally wounded Merle Dixon whom though noted his erratic behavior was impressed with his skill and thus appointed him as one of his lieutenants. The Governor arrives at a recent helicopter crash scene with a handful of men including Merle Dixon , Shumpert , Crowley , Martinez and Tim , in trucks. Unbeknownst to them, Andrea Harrison and Michonne Hawthorne were watching from a distance. While investigating, he finds one of the soldiers as a zombie. He takes his knife and stabs the bisected man through the top of his head. They investigate the helicopter and notice that the pilot survived the crash and is still alive. As they put the surviving soldier in a truck, Michonne's pet walkers begin making noise, drawing their attention. He and his men search the area which causes Michonne to quickly take the pets out. Merle eventually finds them and they are captured. Merle loads the two in the truck and they drive to Woodbury. While Michonne and Andrea are in the hospital, The Governor comes to check on them. Michonne demands her weapons; he replies that they cannot leave yet. Andrea inquires why they are being kept as prisoners, to which he tells them they are not prisoners but guests. He shows Andrea and Michonne around the secure town of Woodbury. Andrea questions the Governor about his moniker: he tells her that it is just a nickname. Andrea quips that \"Governor\" is a title, not a nickname. Later, he gives them an apartment and instructs them to spend the night so Andrea can rest, and then to come over to his place in the following day. Early the next morning, he goes to a hidden laboratory, where he has Milton Mamet experimenting on walkers. When the Governor arrives, he finds Milton and Merle having a heated discussion, which he compares to a school fight. The Governor questions Merle about Andrea. Merle reveals that she was from his group in Atlanta, but she was separated from them. The Governor asks Merle to investigate more about it. After Merle leaves, Milton proposes that he himself do it, questioning Merle's capabilities to restrain himself during interrogation. After the Governor defends Merle's usefulness by comparing Merle to a hammer, Milton asks whether a hammer is the best tool for this job. The Governor switches the subject to Michonne's walkers. Milton explains how they had starved and were being used as camouflage; the Governor relishes the idea. Milton once again asks to meet the girls so he can ask them questions. At breakfast, the Governor answers Andrea's questions about Woodbury. He leaves early to check on the surviving soldier, Lieutenant Welles. The soldier asks about his two fellow soldiers that were in the helicopter with him, The Governor says they didn't make it. He asks the soldier where his camp is, so he can bring in his fellow soldiers, Welles tells him about the camp where his military comrades are stationed at. The Governor sets out to the camp/military convoy. He arrives at the camp showing a white flag. One soldier questions what he wants, and the Governor tells him that Welles' helicopter crashed, but he survived and is being treated. The soldiers are happy to know that Welles is alive, but then the Governor surprises them by shooting one of the soldiers. The Woodbury soldiers come out of the bushes and they kill the other military soldiers during the distraction. The Governor picks up an M4 and looks around the campsite for supplies. When he sees a soldier running away, he shoots the soldier, before ordering Tim to finish him off. Later, he and his men arrive back at Woodbury with the military trucks and supplies. The townsfolk reunite around him, and he lies saying that the soldiers were dead when they arrived. When everybody is going back to their homes, The Governor approaches Merle and Milton, giving them unknown orders. As he leaves, Andrea approaches and asks for his name, which he denies her. Later that night, after apparently having sex with Rowan , the Governor goes inside a secret room in his apartment, where he stores walker heads inside fish tanks. One of the heads is Lieutenant Welles. The Governor watches them for entertainment. The Governor comes across Michonne, who is inspecting one of the army trucks stolen from the National Guard and driven into Woodbury. The Governor keeps to his story that the men died fighting against walkers, and that the bullet holes were probably from fighting an enemy before. The Governor has a parting drink with Andrea (since he has gotten news of her wanting to leave). He tells her about what happened to his wife, saying that she died in a car accident before the outbreak. As Andrea is leaving, he reveals his real name, Philip, and tells her that she can return to Woodbury at anytime. Later on, the Governor is playing golf when Merle talks to him, requesting his permission to go on a scouting mission to search for Daryl Dixon , Merle's missing brother, as he now has the location of the Greene family farm . Initially, The Governor refuses since it is too risky, but agrees to accompany Merle on the search if he can get more concrete evidence. The Governor is seen brushing the hair of his undead daughter, Penny. When he accidentally tears a chunk of her scalp, she goes into a fit of rage. The Governor restrains her, but notices that Michonne is suspiciously glaring into the window at the two of them (although she cannot see Penny's face as the Governor covered it) At this point, The Governor is angered by her presence. Later on, he makes a speech at the town's barbecue, saying that on this day, they celebrate how far Woodbury has come. He, Milton and Merle head to his apartment to get more drinks. Milton tries to convince him to cancel the celebration so he can make an experiment at his lab, but the Governor refuses, telling Milton to forget about work at least for one day and celebrate with everybody. Tim discovers that Michonne broke into the Governor's apartment to steal her katana, and slaughtered several walkers in an industrial courtyard near Milton's lab. The Governor admonishes her, and offers a spot on his research team, she grabs her katana and holds it to his throat. She then decides to leave Woodbury with Andrea once and for all. Later on that night, the Governor notices that Andrea is still in Woodbury. She tells him that she wanted to stay and Michonne left without her. He invites Andrea to a gladiator fight including chained-up walkers and a fight between Martinez and Merle. While Andrea is disgusted by it, the Governor believes it to provide entertainment for the Woodbury citizens and a way to keep them from fearing walkers. Knowing that Michonne is dangerous, the Governor sends Merle, Crowley, Tim, and Gargulio to kill her. Later, Andrea asks if she can help out with something. He says she can, she asks to be on wall duty, and he agrees to it. However while on wall duty, Andrea leaves the walls to kill a walker, causing the Governor to scold her. She apologizes, and also reveals to him she liked the walker fights, but was ashamed that she did. He tells her she doesn't have to be ashamed, because he loves them. He reveals that before the outbreak, his life was mediocre, he hated his job, he had a small sized house, he doesn't even know why he became the leader of Woodbury. They share a drink, and end up sleeping together in his apartment. Merle interrupts them, because he has vital information. The Governor goes in the hall so Andrea won't hear. Merle falsely tells him Michonne is dead, but they lost all the other men. The Governor is saddened to hear about the death of his men, and says that they will cover it up saying that they died heroically during a supply run. Merle says that he has even more news, he stumbled upon a person from his old group from Atlanta and other girl. He kidnapped them: Glenn Rhee and Maggie Greene , and that they are apparently held up at a secure location. The Governor instructs Merle to lock them up for interrogation and not to tell anyone, especially Andrea, because she knows them. After having sex with Andrea, someone knocks at the door and the Governor goes to answer it. It's Milton, and he informs that Mr. Coleman is ready. He nods and sends Milton to go. Needing to distract Andrea, the Governor sends her to assist Milton with his research. With that cleared up, he goes and confers with Merle, who has been interrogating Glenn for most of the day. Merle says that he wasn't able to get any information from Glenn, but he is going to interrogate Maggie next. The Governor says that he'll interrogate her himself and sets off. He enters the shack where Maggie is being kept captive, he at first attempts being reasonable and nice, untying her from the chair and telling her that it's all a misunderstanding. She only needs to tell him where her group is and they will take her and Glenn back to them. She gives him the silent treatment, the Governor then takes a different approach. He demands that Maggie take off her shirt. She refuses, and he says that he will bring in Glenn's hand if she doesn't. She takes off her shirt, and then he forces her to take off her bra. She stands topless and he comes over, unbuckling his belt. When she still doesn't flinch, he pushes her onto the table and demands information, but she tells him to \"do whatever you're gonna do. And go to hell\". The Governor smiles and then takes Maggie, still topless, to Glenn at gunpoint along with Merle and Martinez. Assuming the Governor raped her, Glenn tries to attack him, but Martinez points his gun at Maggie, making Glenn stop right where he is. The Governor then says that he is tired of games and someone will reveal the location of their camp immediately, he prepares to shoot Glenn in the head, but Maggie divulges everything he needs to know about her group: They are camped at a prison near Newnan and that their group is small. The Governor then decides to taunt Glenn by hugging and kissing Maggie on the head, telling her that it's all okay. He and his men leave her and Glenn locked inside the shack and head to his apartment to discuss the prison with Merle, Milton, and Martinez. He is shocked that only ten people could clear out that whole overran prison. He realizes the group is strong and they need to be prepared. He tells Merle that his brother is with the prison group and this may count when Merle has to choose a side, he questions where Merle's loyalty lies, and Merle promises that he is loyal to Woodbury. He then sends Merle and Martinez to scout out the prison. Andrea returns to his apartment shortly after, and she is shocked and saddened about how the experience with Mr. Coleman went. The Governor hugs and comforts her. The Governor comforts Andrea after her experience with Mr. Coleman and is worried since the presence of Glenn and Maggie makes it possible for Andrea to discover them. He tells Merle to execute Glenn and Maggie at the \"screamer pits\", but they are saved by Rick , Oscar , Daryl and Michonne, who had arrived to rescue them. After hearing the shots, the Governor heads out in the streets to investigate, at first he thinks a walker broke into the back gate and it's nothing to worry about, but then one of the Woodbury soldiers reveal that there are intruders in town, prompting the Governor to tell the rest of the guards to search the whole town for them. He, Andrea, Milton, Merle, and Haley meet at Milton's lab, where Merle reveals that Warren was killed. The Governor tells everyone to keep their eyes open and orders Andrea to check if the residents are okay. A shootout erupts in Woodbury's streets shortly after, Andrea witnesses one of the attackers in the smoke, saying that he is wearing a prisoner jumpsuit. The Governor panics and orders her to go inside. The Governor goes to his apartment and is horrified to discover Michonne with her sword and his zombified daughter, Penny, prepared to execute her. The Governor pleads with her not to do it, but Michonne kills her anyway, beginning a brawl between the two in the secret room. During the struggle, several of the tanks are thrown to the floor, spilling out the heads inside. During the battle, he attempts to drag her arm toward a walker's snapping jaws, but she is able to escape his grasp. As the Governor is strangling her, Michonne grabs a piece of broken glass from one of the tanks and stabs his right eye, blinding him. As she is about to finish him off with her katana, Andrea arrives with her gun drawn at Michonne. The two stare at each other horrified, and Michonne leaves. Andrea is even more horrified when she spots the fish tanks with walker heads inside. The Governor ignores her and hugs the corpse of his dead daughter weeping. Later on, the Governor's injuries are treated by Dr. Stevens , who informs him that he can't recover from his eye injury. He forces her out of the way, saying that he needs to do something, he is confronted by Andrea about the tanks with heads. The Governor says that he used them to get ready to prepare for the real, outside world. Merle arrives asking what happened, the Governor only tells Merle that he was attacked (Merle doesn't know that Michonne, who he told was dead, is the one who attacked the Governor). During a gathering of the citizens in the arena, the Governor makes a speech about how he failed with the townsfolk, letting \"terrorists\" break into town. But he informs them that Merle led Michonne and the others to attack Woodbury and brands him a traitor. The Woodbury soldiers bring in Daryl (who was captured during the shootout), and the Governor asks the citizens what they think should be done to the terrorists. As the citizens chant for Merle and Daryl to be killed, the Governor taunts Merle saying, \"You wanted your brother, now you got him.\" The Governor is at the arena as the residents demand the death of Merle and Daryl, he then orders the two brothers to fight each other to the death, so that Merle can prove his loyalty lies with Woodbury, ignoring Andrea's asking to stop it. In the middle of the fight, gunshots are heard coming from Maggie and Rick, causing the residents to panic. During the confusion, Merle and Daryl manage to escape with Rick and Maggie, while the Governor does nothing to stop them but watch the situation. By the morning, The Governor is at his apartment gathering guns, Andrea walks in asking him why Daryl was there and why he didn't tell her that her friends were still alive. He explains telling Andrea that her friends killed seven good people and they are hostile. Andrea says that the Governor needs to calm down the citizens, as they are scared and want to leave Woodbury, he tells her that if the townspeople want to leave Woodbury and take a chance outside, let them go, the easy life of celebrations and barbecues they had until now is over. When some walkers invade the town, Richard Foster is bitten and severely injured. The Governor steps out of his apartment, puts a quick end to Richard's suffering by shooting him in the head in front of everybody, and walks back to his home. Later on, the Governor is seen watching Andrea from his apartment as she calms the residents, who want answers to all that happened through the day. The Governor visits Andrea at her apartment, he says that he is unable to continue being the leader of Woodbury for a while and tells Andrea that she is the right person to be the new leader, even though Andrea hesitates, he insists. He then goes to Milton's laboratory, confronting him and asking where his loyalty lies (in a similar way he did to Merle before the attack in Woodbury), a scared Milton promises that he is loyal to Woodbury. Milton is then ordered to keep an eye on Andrea while, without her knowledge, the Governor, Martinez, Shumpert and two soldiers went out to attack the prison. The Governor makes his arrival at the prison known by shooting Axel in the head from outside the fence with a AUG A1 . During the whole shootout, the Governor seems to be taking sadistic enjoyment. One of the Woodbury soldiers runs down the prison gates with a truck full of walkers and sets them free inside the prison. The Governor and his men get in their car and escape during the distraction. The Governor wants to avoid any more invasions by arming the citizens of Woodbury and teaching them how to shoot. Andrea comes in after being informed of the attack at the prison, the Governor lies to her, telling her that he went to the prison to negotiate and the group attacked them first. He tells her that they are bloodthirsty and if she goes to the Prison, she is to stay. The Governor is seem later checking the residents approved into the Woodbury army , Andrea comes to Noah 's defense for Karen , saying that he is an asthmatic. The Governor, however, doesn't dismiss Noah and says that he is going to learn how to shoot from the best, before turning back to look at Andrea. When Andrea tells Milton of her plans to sneak out and visit the Prison to negotiate with Rick, he immediately tells the Governor about her intentions of escaping Woodbury, but the Governor simply tells Milton to help her escape. Tyreese Williams ' group is soon brought in by a returning Milton, and the Governor learns that they has just visited the prison. Tyreese says that he can describe the prison's layout for them, but the Governor tells him and his group to just rest for the night and they'll talk about this later. At night, Andrea returns and informs the Governor that she went to the prison, they are broken and living in horrible conditions, she also informs that Merle and Michonne are living there too. The Governor tells Andrea that she came back because Woodbury is where she belongs, they end up sleeping together. While the Governor is sleeping, Andrea gets up without him noticing and holds a knife over his bedside, contemplating Carol Peletier 's plan to sleep with the Governor and kill him while his guard is down. Andrea cannot go through with it, so she puts the knife away and peers out the window. After a meeting being set up by Andrea, the Governor finally meets Rick face to face in an abandoned farm store. As noticing that Rick carries his gun in hand, the Governor mocks him by pretending that he surrenders himself, \"We got a lot to talk about\", he says. He removes his belt with his pistol and calmly sits on a chair, he invites Rick to do the same, but Rick just holsters his gun and still stands. Unknown to Rick, the Governor has a taped a gun under his side of the table. Andrea storms into the barn complaining that the Governor started the meeting without her, Rick says that he knows everything about the Governor, about the raids, the heads in fish tanks and that he attempted to rape Maggie. The Governor asks Rick for his offer, which is setting boundaries in the area: Woodbury takes west of the river, prison takes east. The Governor refuses the offer; he wants Rick to surrender. As the situation starts to get out of control, Andrea interferes telling both men to calm down. The Governor asks her to leave him and Rick to discuss this privately. As Andrea leaves the barn, Martinez (who is waiting with Milton outside) closes the door. The Governor and Rick start to insult one another about their respective positions as leaders, but incredibly they show some amount of respect for each other. Even though, Rick calls him a town drunk for killing Axel and running down the Prison's gates. The Governor asks if Rick ever misjudged someone, and says that he knows about the possibility of Judith being someone else 's daughter. He says that if he just leaves Rick's group alone, his people are going to think he is weak. \"That's your problem\", Rick says. The Governor shares a story about the day his wife died, he was at work when he received a call from the hospital telling him that she died in a car accident. She left a message to him earlier telling him to call her back, but he never managed to do so, \"What did she want?\", The Governor asks. Rick remembers about Lori and becomes visibly rattled, The Governor smirks. He gets up and tells Rick that this fight will go down to the last man, but there is a way out: he promises not to do anything to his group if Rick gives up Michonne. Rick is not sure about giving up Michonne, he doesn't trust that The Governor will keep his word about leaving them alone. The Governor gives Rick two days to think about the offer, saying that he'll be back in this farm store by noon. The Governor, Martinez, Milton and Andrea head back to Woodbury. Upon arriving, The Governor instantly pulls Martinez aside and orders him to prepare an ambush on Rick's group in the next meeting, he wants everyone dead, except Michonne. Milton hears the conversation and complains about breaking the offer. The Governor simply tells Milton that they would have to get rid of Rick sooner or later anyway, on the way back to his apartment, he thanks Andrea for setting up the meeting, without her acknowledge of his true intentions to kill Rick and everybody from her former group. The Governor is inside a torture room hidden somewhere in Woodbury (This place is believed to be the \"screamer pits\"). He tests the resistance of the chains that once held Michonne's pet walkers, with a sadistic smile on his face. After a while, he is seen laying out tools beside a dentist chair, he looks back and notices that Milton is watching and approaches him. Milton tries to convince The Governor that he doesn't need to take revenge on Michonne, that he can simply forget all of this and move on, leaving the prison group alone. The Governor says that this is something he has to do, and asks Milton if he truly believes that walkers actually have something left from their old beings inside them, Milton says that he believes, but Penny is already dead, it's time to move on. The Governor refuses and says that he is going to do this. He later returns to the room with more tools and a recorder, he tests the recorder without knowing that Andrea and Milton were watching him the whole time from a window. He is later seen walking down the street when he notices that Martinez is confiscating Andrea's weapons, he tells Andrea that is just for precaution, and says that he wants her to come with them the next day, when they close their deal with Rick and the prison group. Andrea says she will and then walks off. The Governor is then reported by Tyreese and Sasha that Andrea jumped over the fortified wall and escaped Woodbury. Tyreese says that Andrea looked pretty disturbed with the town and is concerned about what this is about. The Governor lies, saying that Andrea has mental issues for spending the whole winter alone in the outside world. After the meeting, Milton approaches The Governor and implores to let Andrea go. The Governor realizes that Milton told her about the Michonne deal and she is going back to the prison to warn everybody, he gets in his car and leaves Woodbury to go after Andrea. While driving down a road, he spots Andrea walking through a field and follows her, Andrea panics and run inside a forest to avoid being followed. As the night falls, The Governor manages to find Andrea once again, she runs inside an abandoned warehouse, he leaves his car and follows her inside. The Governor listen to Andrea's footsteps, he starts mind games, trying to scare Andrea into revealing her location. The Governor grabs a shovel and start breaking windows and spreading glass inside the warehouse, so he will be able to listen Andrea if she walks over the pieces of broken glass. He continues with the mind games when he listens to a noise, while investigating, he discovers three walkers wandering inside the place, and kills all of them easily. He then starts bashing one of the walkers head with the shovel. He listen another strange noise and follows it, finally finding Andrea as she stands in front of an old door. \"It's time to go home,\" The Governor mockingly says, Andrea open and hides behind the door, releasing an small herd of walkers on The Governor. He fights the walkers with the shovel, a piece of metal, and empties his gun on them, Andrea escapes the warehouse as The Governor is cornered by many walkers. By the morning, Andrea finally reaches the prison. She notices Rick in a guard tower and tries to wave so he can see her. But The Governor returns after surviving the walkers in the warehouse and tackles Andrea to the ground, Rick fails to spot them and The Governor drags Andrea away. The Governor returns to Woodbury, Martinez approaches him and asks about Andrea, he says that she is still missing. Martinez also reports that somebody burned down the walkers they captured, and is suspicious that Tyreese is responsible. The Governor talks to Tyreese and his group, explaining that they use the walkers as a scare tactic and were never intended to kill people. Tyreese apologizes for being difficult. The Governor asks where Tyreese found the gasoline. \"Come again?\" Tyreese asks, confused. The Governor says it's nothing and leaves. On his way out, Milton asks if The Governor found Andrea, he says that he didn't, but he will look again in the next day. \"It's a real shame about the pits,\" says Milton. \"I hope you find out who did it.\" The Governor stares at Milton and says, \"already have.\" Meanwhile, back at the hidden torture room, Andrea is tied to the dentist chair with a gag on her mouth and the walker pet chains dangling behind her. The Governor and his men are waiting for Rick's arrival at the farm store, preparing to ambush Rick as soon as he shows up. But instead, a car playing loud music suddenly drives alone into the place, attracting many walkers and forcing the Woodbury soldiers to defend themselves. Unknown to them, Merle planned this to take out The Governor while the others were distracted killing the walkers. As Merle had his cross-hair pointed right at The Governor, Ben unintentionally walks in the way and gets shot instead, saving The Governor's life and revealing Merle's location. Woodbury soldiers start to kick Merle in the ground, The Governor orders them to back off, saying that he is going to take care of Merle himself. The Governor drags Merle back into the farm store where he was hiding and starts kicking and punching him. Merle tries to fight back, but to no avail. The Governor starts choking Merle and bites off two of his fingers, before breaking his bayonet arm and finally pinning Merle against a wall. \"I ain't begging you,\" are Merle's last words before The Governor pulls out his gun and shoots Merle in the chest, killing him. The Governor has Milton tied up to a pipe in the shacks and beats him, blaming him for the death of his men at the hands of Merle , since Milton burned up the walkers they had gathered, which they otherwise could have released on the Prison. The Governor begins to berate Milton, and tells him to be stronger. When Milton asks about Andrea's whereabouts, he takes Milton to the room where he has Andrea held in, and orders him to kill her in order to get out of the situation...alive, and to redeem himself. Milton tries to attack The Governor instead, but the latter defends himself and stabs Milton in the stomach three times; he then decides to leave Milton locked up with Andrea, since the latter will reanimate and kill her. Before leaving the room, The Governor says: \"In this life now, you kill or you die...or you die and you kill.\" He then goes outside, where the Woodbury Army is waiting for him. He reminds them that Rick's group were responsible for the death of eight Woodbury defenders, and they will not stop until they are all eliminated. Tyreese and Sasha inform him that they are not going to attack the prison, since someone needs to stay and defend the townspeople. The Governor gives Tyreese an sniper rifle and coldly thanks him, he then gets in his car and the army moves out to attack the prison. They arrive there exploding the guard towers, shooting all the barricades and running down the courtyard gate, but the prison seems to be empty, and The Governor decides to move inside. They enter Cell Block C and find out that the place is also empty, The Governor notices a bible left on the table, he then hears a strange noise coming from the dark corridors, he decides to split the army in teams to search the corridors. While doing so, they are suddenly attacked by flash grenades and walkers, everyone starts panicking and The Governor tries to calm them down, as they are running outside, Glenn and Maggie start shooting at them from the catwalk, telling them to leave the prison. The Governor wants to stay and fight, but the scared army of citizens leave the prison behind, prompting The Governor and his men to get in a truck and go after them. As they reach the army, they stop the convoy and The Governor leaves his truck angry at them, ordering them to go back to the prison immediately. Martinez and Allen agree with him, but the rest of the army refuse to attack the prison again, since they are scared and want to return to the safety of Woodbury. The Governor loses his sanity and starts shooting everyone to the ground. Martinez and Shumpert watch horrified as The Governor shows no remorse whatsoever after killing 23 of his own people, including Allen. The Governor gets back in his truck with Martinez and Shumpert and they drive off to an unknown location. The Governor appears in the very end of this episode, secretly watching over the prison from a distance. Following the massacre of the Woodbury Army, The Governor, Martinez and Shumpert camp at the site where they also massacred the National Guard soldiers. Growing wary of The Governor's mental state, Martinez and Shumpert decide to abandon him during the night. In the morning, The Governor wakes up and realizes that he was left behind to die, he then steals the remaining National Guard truck and returns to Woodbury to burn the city to the ground out of anger. He then spends several months surviving on his own, one day, he comes across a building with several messages and names written on them, one of which is Brian Heriot . After arriving in a town, The Governor is weakened and falls to the ground. This leads him to spot a young girl peering at him from a window and he decides to enter the house, finding a family who, at first, warily hold him at gunpoint, but then welcome him into their home. The Chambler sisters, Lilly and Tara , take all of The Governor's weapons and question him about where he came from and what are his intentions. The Governor fakes his name, saying that he is Brian Heriot. He also informs the sisters that he was living in a town, it was safe, until the man in charge \"lost it.\" After having dinner, \"Brian\" helps the sisters to take their father, David , to his room, since he has cancer and cannot walk on his own. After doing this favor, David asks Brian a favor: to grab a backgammon set from an apartment upstairs. Brian does so and the Chambler family thanks him for it. By the morning, Lilly stops by the apartment she let Philip stay in. She reveals that her father's oxygen tank is almost in the end, so he will need a new tank soon. The Governor offers himself to go out and search for some oxygen tanks in a nursing home. The Governor manages to collect two oxygen tanks in the nursing home, but barely manages to escape alive. After arriving back at the apartment, Lilly offers to treat his injuries with the assistance of her young daughter, Meghan. Lilly leaves the room to collect more medical supplies and Philip ends up bonding with Meghan about their injuries -- The Governor's eye and Meghan's hurt finger. During his time at the apartment, Philip befriends the Chambler's and slowly begins socializing. One day, as he is teaching Meghan how to play chess, David passes away because of his cancer. Unknown to the Chambler sisters that a person who dies reanimates no matter what, The Governor tries to rush both of them out of the bedroom, but not in time. David reanimates and nearly bites Tara before Philip ironically puts him down with his own oxygen tank. After burying David, The Governor realizes that he doesn't want to care about people again like he cared for his daughter and decides to leave. Lilly spots Philip leaving and convinces him to take her and her family with him. They take David's truck and drive off. During their time on the road, Philip and Lilly share a night of passion. After spending some days on the road, the truck breaks down and forced the small group to continue their journey for a safe heaven on foot. They are eventually attacked by a small herd of walkers, Philip rescues Meghan and manages to run off with her to a safe field, but they end up falling inside a pit full of walkers just like the ones he used in Woodbury. In order to protect Meghan, The Governor kills all the walkers inside the pit with his bare hands and then swears that he is never going to let anything happen to Meghan. When looking up, Philip realizes that Martinez was watching them inside the pit the whole time. Martinez helps Philip and Meghan out of the pit, as the Chamblers call him \"Brian,\" Martinez realizes what is going on and allows them to join his group as long as they don't question his leadership. After joining the group, The Governor, Lilly, Tara and Meghan start living in one of the trailers in Martinez's camp. One day, Philip and Meghan are playing chess and they have a conversation about whether they are bad people or not, which makes Philip think about all that he has done in the past and how he's been trying to redeem himself. Later, he agrees to go on a supply run with Martinez and two of his men, Pete and Mitch . They come across a abandoned house in the woods and kill all the walkers inside, one of the walkers that Philip kills is a young boy. They decide to spend the night in the house, drinking beer that Mitch found stashed in the kitchen. Pete questions what The Governor did to survive the apocalypse until this point, and he dodges the question simply saying that he survived and makes the same question to both Pete and Mitch. They reveal that they were both serving the military, Mitch escaped with his tank and formed the camp, Pete was in Fort Benning , but soon left the place to join his brother. Upon returning to the camp, Martinez invites Philip to play golf with him like they used to do back in Woodbury. As they are playing, both men drink alcohol and start to get drunk, Martinez reveals that Shumpert was never the same after what happened with the rest of the Woodbury citizens, he died after being bitten by a walker and Martinez himself had to put him down. Martinez also comments that he's willing to share leadership responsibilities and offers to split them with Philip. Angry and drunk, The Governor hits Martinez with the golf clubs in the back of the head, he then drags Martinez to one of the walker pits and throws him in to be devoured while screaming that he doesn't want to be the leader again. Following this, The Governor is seen shaking inside his trailer over how he killed Martinez. In the next morning, Pete announces that Martinez was found dead inside one of the walker pits, they assume that he was drunk while playing golf and fell in. Pete names himself the leader of the group until they can properly vote on the matter. Philip is asked to join Pete and Mitch on a supply run where they come across a small group of people that set up a camp just a few miles away from their camp, Mitch believes that they should attack and steal their supplies, but Pete says that they shouldn't kill other people over supplies and they continue to search, ignoring the camp. They eventually fail to find any food, on the way back, they realize that someone attacked the camp that they passed by and stole all of their supplies. An angered Mitch kills one old man that barely survived the attack and Pete says that they should've helped him instead of killing him. Philip realizes that Pete is a terrible leader, as soon as they return to the camp, he waits until dawn to escape the camp with Lilly, Meghan, Tara and Tara's girlfriend, Alisha . They get in a car and start driving down the road, but soon they come across a swarm of walkers stuck in mud blocking their path and are forced to return to the camp. The next day, The Governor goes to Pete's trailer and says that he wants to talk about Mitch. When he is inside Pete's home, he proceeds to stab Pete in the back with a knife and then chokes him to death. Right after, he goes to Mitch's trailer and forces his way in at gunpoint. He orders Mitch to sit down and reveals that he killed Pete and now he is assuming the leadership. Mitch asks if Philip came to kill him too, but The Governor reveals that Mitch was right about attacking the other camp the day before, Pete was a bad leader and would lead them to death. Philip wants Mitch to be his right hand man and never to question his leadership, Mitch accepts it. To cover Pete's death, they throw his body into a lake and fake a story how Pete died heroically during a supply run. The Governor is seen marking a map when Lilly comes by. When asked, Philip says that they need to move to a more secure location, but Lilly believes that their current location is safe enough. Philip's leadership is doing good for the group for some weeks, his relationship with Lilly is going well, until a walker gets in the camp and nearly kills Meghan. The Governor realizes that no matter how much they work on security, the camp will never be safe enough to keep his new family safe. There is only one place that is secured in this area of Georgia. He gets in a truck and drives back to the prison and The Governor's story finally catches up with the present storyline, where he is secretly watching the prison from a distance. As he investigates the area, he comes across Michonne and Hershel burning a pile of dead walkers. The Governor pulls out his gun and prepares to attack. The Governor sneaks up on Michonne and Hershel and hides behind a tree. He manages to knock Michonne out and holds Hershel at gunpoint, forcing Hershel to surrender. Later on, Philip is back at the camp and gathers his people around, saying that he has to convince them to do something. He reveals to have captured Hershel and Michonne and explains that the people who attacked his old camp are currently living in a prison. The place is fenced and safe from walkers, but the people who live there don't deserve that courtesy. He lies by saying that Rick's group attacked his old camp, burned everything to the ground, mutilated him and killed his daughter. His plan is to use Hershel and Michonne to force Rick and his people to leave the prison, he intends to do it without dropping blood on the ground, without shooting a gun. Everyone seem to agree with The Governor. After the speech, he is approached by Lilly, she questions him if they are going to kill the people in the prison, but The Governor explains that the prison group are the true killers. Lilly disapproves his idea; her opinion of \"Brian\" seems to have changed. Philip goes into the hostages' RV to give Hershel and Michonne some food. Hershel tries to convince Philip that they can sort this out without using violence, that if he promises to stay in line, Rick will understand it and will let them live at the prison. Philip explains that they can't live together, as he wouldn't get along with Rick and Michonne. Hershel asks him how he can threaten someone else's daughters, if he once had one himself. \"They're not mine,\" is his cold-hearted response. They drive one of the trailers to a river, where The Governor asks Lilly to stay with Meghan until he and the rest capture the prison. Lilly questions Philip's actions once again, but The Governor promises that everything is going to be fine and that he loves both her and Meghan. He then approaches Meghan as she is playing in the mud and says goodbye, promising that he will be back by the end of the day. The Governor and his militia arrive at the prison, Mitch is driving his tank, and he announces their presence by blasting one of the guard towers. The Governor climbs the tank and calls Rick out. From the courtyard of the prison, Rick and his people gather to see what's happening, he says that he is not the leader anymore, there is a council commanding the prison. The Governor asks if Hershel and Michonne are in the council, the two are brought out of and put on their knees in front of the tank. Rick leaves the courtyard, crossing the prison's yard to talk with Philip from the other side of the fence. Rick is willing to be captured himself if The Governor lets Hershel and Michonne go, but The Governor says that the only thing he wants is the prison, he gives Rick until sunset to make his decision. Despite Rick trying to convince him that they could live together, The Governor responds with \"It could work, but it can't\". When Rick refuses to leave, The Governor grabs Michonne's sword and threatens to kill Hershel. Rick then gives a speech about how people can come back from what they were, that they can put Woodbury and their confrontation all behind, that people can change. However, the speech seem to have no effect on The Governor, as he calls Rick a liar and proceeds to partially decapitate Hershel with Michonne's sword, much to Maggie and Beth's horror. This then causes Rick to open fire at The Governor angrily. Philip is hit in the arm and runs to a safe spot. The two groups start to fire on each other and the war officially begins. The Governor spots Hershel, still alive, attempting to crawl away to safety. Philip grabs him and utterly decapitates him. Right after this, The Governor realizes that Lilly was there watching everything. She is carrying the corpse of Meghan, who was bitten by a walker. The Governor remains silent, he shoots the little girl in the head to prevent reanimation and walks back to the battle like nothing important happened. This cold hearted action leaves Lilly in shock. The Governor then orders his militia to take the fences down and destroy the prison group, ordering them to \"Kill Them All\". Mitch drives the tank over the prison fences and the militia invades the yard. The Governor advances behind the tank and takes cover behind a bus. Just as he is about to follow his people inside the courtyard, he is tackled by Rick. The two engage in a fist fight, in which The Governor eventually gains the upper hand. Upon beating Rick while pinning him down, just as he is about to kill Rick by strangling him, Michonne sneaks up behind The Governor and runs him through the back with her reclaimed sword. After studying his prone form, she coldly decides to leave him to die slowly and painfully in agony. Later, however, a disgusted Lilly approaches the dying Philip and shoots him in the head with his own gun , ending his life and avenging all of the deaths that he had caused. The Governor's corpse appears briefly at the prison's field, with a bullet hole in his forehead. It is also shown that his body has been devoured by walkers. The Governor appears as one of the people that Tyreese hallucinates of after being bitten by a walker. He acts aggressive towards Tyreese due to the fact that Tyreese didn't earn his keep to please Philip.",
        "Death": "Killed By Michonne Hawthorne (Caused) As the Governor beats up Rick, Michonne sneaks behind him and impales him through his back with her katana. However, she decides not to put him down and leaves him to die in agony. Lilly Chambler Later, Lilly finds The Governor lying on the ground, mortally wounded from being stabbed by Michonne. Lilly shoots him in the head, finishing him off.",
        "Killed Victims": "This list shows the victims Philip has killed: Sean (Zombified) Franklin (Zombified) Wilson (Caused) Brady Welles (Caused or Direct, Alive) Richard Foster (Out of Mercy) Axel Merle Dixon (Alive) Milton Mamet (Alive) Jody (Indirectly Caused) Paul Noah Rowan Eileen Eileen's unborn child Dr. Stevens Emily Coleman Betty Coleman Mrs. Foster Pete (Possibly) Allen Andrea Harrison (Caused) Bill Jenkins (Zombified) David Chambler (Zombified) Caesar Martinez (Caused) Pete Dolgen (Alive) Hershel Greene (Alive) Meghan Chambler (Before Reanimation) Julio (Caused) Ms. McLeod (Possibly, Caused) Flame (Indirectly Caused) Jeanette (Caused) 6 unnamed U.S. Military soldiers (Caused) At least 21 unnamed Woodbury townspeople (1 Alive, 1 Caused, 3 Before Reanimation) At least 15 prison community residents (Caused, Alive) Numerous counts of zombies and unnamed people (Caused and Direct)",
        "Relationships": "For a more in-depth look at Philip's relationships, read here: Philip Blake (TV Series)/Relationships",
        "Appearances": "",
        "Gallery": "For more images of Philip Blake, please visit Philip Blake (TV Series)/Gallery .",
        "Trivia": "Philip is the second major recurring primary antagonist in the TV Series , the first being Shane Walsh , the third being Gareth , the fourth being Negan Smith , the fifth being Alpha , the sixth being Lance Hornsby , and the seventh being Pamela Milton . Philip is tied with Alpha as having the third most appearances in the TV Series, appearing in a total of 17 episodes alive (he appeared dead in \" After \" and as a hallucination in \" What Happened and What's Going On \"), behind Shane with 18 episodes and Negan with more than 40 episodes. Philip is the first major recurring primary antagonist to lead more than one group; in this case he led the survivors of Woodbury and later the survivors in Martinez's camp . Philip is one of the three major recurring primary antagonists to not appear in a season premiere. The other two being Lance Hornsby and Pamela Milton. Initially, the role of The Governor was handed to academy award nominated actor, John Hawkes ; however after some negotiations, Hawkes eventually turned the role down, believing that he didn't feel good enough for the role and feeling someone better than him for the role is still waiting out there to be chosen. [1] In preparation for the role, David Morrissey stated that he read ' Rise of the Governor ' in order to divulge into the character's backstory. David Morrissey also noted that he took inspiration from various cult leaders most notably including David Koresh from Waco, Texas alongside Jim Jones whom Morrissey both cited as influences towards the character. In terms of developing the character's southern accent, David Morrissey stated that he regularly listened to Bill Clinton audiobook of his autobiography My Life which Morrissey became partially inspired by. The Governor is hinted to have an affinity for the music of Frédéric Chopin ; this has been demonstrated several times. He is seen listening to Chopin: In \" Say the Word \", whilst brushing the infected Penny 's hair. In \" I Ain't a Judas \" after Andrea Harrison gets back from visiting the Prison. In \" Live Bait \" while teaching Meghan Chambler how to play chess. The Governor's most used weapons were a Steyr AUG A1 assault rifle and Beretta 92SB Nickel pistol. Ironically, his own pistol was used later by Lilly Chambler to kill him. Philip is one of six characters in The Walking Dead franchise to receive a permanent eye injury, the others being his comic series counterpart , Carl Grimes (along with his comic series counterpart ), and Kenny and Violet (Determinant) from the Telltale game series. The Governor is one of the two people in the TV Series to lose an eye, Carl being the second. Interestingly enough, the Governor lost his right eye in the show, whereas his comic counterpart lost his left eye. The Governor's clothes can be purchased as an Xbox 360 Avatar Outfit. [2] Glen Mazzara admitted during his Q&A at comicbook.com that the Governor and Michonne were the hardest characters to cast. The Governor has killed the sixth largest amount of living people, having total of at least 62 killed victims, Rick has the fifth largest with a total of 68, Daryl has the fourth largest with at least 78, Carol has the third largest with a total of 110, Simon has the second largest with a total of at least 172, Negan has the largest with a total of at least 225. Philip is the second main character to die in a mid-season finale, the first being Hershel , the third being Beth Greene , the fourth being Deanna Monroe , the fifth being Spencer Monroe , and the sixth being Paul Rovia . The Governor appears in the archival footage shown at the beginning of \" Lockdown \" and \" A New Deal \" as Judith narrates past events of the show to the audience before the episode's story begins. The Governor is the third main character to die by being shot in the head, with the first being Dale Horvath , the second being Andrea Harrison , the fourth being Beth Greene , the fifth being Carl Grimes , and the sixth being Leah Shaw . Excluding the original main cast, The Governor is one of seven main characters who is listed as a main character upon his first appearance, the others being Lance Hornsby , Bob Stookey , Gabriel Stokes , Michael Mercer , Alpha , and Pamela Milton .",
        "References": "",
        "Name": "Philip Blake"
    }
]