[
    {
        "Pre-Apocalypse[]": "Nothing is known about Phillips' life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "At some point during the outbreak, Phillips joined a community in Ohio. In a flash forward, Trooper Phillips and the rest of his squadron are gathered outside Hilltop's gates as Daryl speaks with Maggie and Elijah. Trooper Phillips is one of the sixteen soldiers accompanying Lance Hornsby as he investigates the events that took place at Riverbend. He and the rest of the squad arrive at Hilltop and eventually granted entry inside to search the town for the stolen Commonwealth weapons. After no weapons are found and an intense confrontation between the Rhees and Lance, Phillips and the other Commonwealth soldiers eventually leave Hilltop with their boss. That night, he and the others encounter Leah in the woods where Lance strikes up a deal with the lone Reaper. As the squadron of soldiers are split up into smaller groups, Phillips is assigned to Romano's group. Daryl, Gabriel, and Aaron are among those assigned to Romano's group, as they head out on a scouting mission to check out three locations, including a large house, in search of the Riverbenders and Hilltoppers. After clearing the large house, they proceed to investigate a junkyard next where Phillips and the soldiers suspiciously split up, creating a perimeter around the three Alexandrians in the junkyard. However, the three men suddenly attack the soldiers, aware of an incoming ambush. Phillips moves in on them, but Gabriel sneaks up on him and stabs him in the leg, before kicking him in the head.",
        "Death[]": "Killed By Lance Hornsby (Indirectly Caused) Gabriel Stokes Lance orders his soldiers to kill Daryl, Gabriel and Aaron. Gabriel manages to sneak up on Phillips and stabs him in the leg, before kicking him in the face.",
        "Killed Victims[]": "This list shows the victims Phillips has killed: Numerous counts of zombies and possibly unnamed people",
        "Appearances[]": "\" No Other Way \" (No Lines) \" Trust \" (No Lines) \" Acts of God \"",
        "Trivia[]": "While uncredited, the name Trooper Phillips was used on set for this character. The actor also portrayed a surrendering Savior in Season 8 and a Whisperer in Season 10 . He portrayed a second Commonwealth soldier who was also killed in \" Acts of God \".",
        "Name": "Phillips"
    }
]