[
    {
        "Pope": "Pope",
        "Overview[]": "Pope is a merciless, unpredictable, hardened, bloodthirsty, sadistic, and sociopathic man. Due to the trauma he endured during his time in the military, he only ever had his comrades and God to turn to. When the apocalypse began, he and his group became ruthless survivors, attacking other groups without provocation. Pope is shown to be particularly brutal and murderous, gleefully taking delight in killing a tortured Frost and getting noticeably more excited as the battle with Maggie heats up. Pope is religious to the point of delusion. At the start of outbreak, when Operation Cobalt was put into action, Pope and his group managed to escape by hiding out in a church. Seeing that none of his men were injured, Pope began to believe that he and his men were the chosen ones. It becomes apparent that Pope's interpretation of Christianity is a more twisted version. He seems to believe that not only was he chosen by God, but also that he is God, with him saying things like \"God is angry, I am angry,\" and \"You don't question the Lord, you don't question me!\" He often preaches about the importance of family, acting as the father figure for the Reapers. He is shown to despise cowards who leave their brothers behind. However, it appears the Reapers follow him more out of fear rather than actual attachment. While torturing Frost, when Brandon Carver shows disdain with Daryl joining the group, a single stare from Pope makes him stand down. Pope often has a rather rude and condescending attitude when talking with his men. This is most prominent with Leah , who although he has stated he favors more than the other Reapers, he constantly mocks about her relationship with Daryl. Pope becomes increasingly frustrated and unhinged at his men's failure to track down Maggie 's group, at one point lashing out at Washington and Ancheta . Though he allows Daryl to join the group, Pope is still skeptical of his loyalties and at one point subtly threatens him by telling a story about how he strangled his dog to death. Overtime, Pope proves himself to be a hypocrite in many ways. Though he gets angry at his men for not tracking down Maggie's group, he himself doesn't do much to help and has only been seen in Meridian since his introduction. Though he has stated he is a man of God, he has shown no remorse for his group's immoral acts of murdering innocent survivors and taking their home. Whenever he's called out for these flaws, he usually attempts to justify them by saying it was God who decided what happened. Perhaps the most prominent example of Pope's hypocrisy, is his talk about the importance of family. Despite his preaching about how family is all they have left, he has shown to have no problem killing his own. He burns Bossie alive believing him to have left Michael Turner behind just because he had wounds on his back, when in actuality that wasn't the case. Another example is him using Wells as bait to a horde of walkers to see if it was Maggie who had lead the herd to Meridian. This is made even worse by the fact that the Reapers are not a large group. The final straw is when he orders Ancheta to fire the hwacha down at the courtyard, even though his men are in the line of fire. This would prompt Leah, the person he trusted the most, to kill him in an attempt to save what was left of her family.",
        "Pre-Apocalypse[]": "Prior to the outbreak, Pope was fighting in Afghanistan along with the rest of his squad which included a lot of members that would eventually become the Reapers . Upon returning from war, he struggled to find jobs or deal with trauma, but the relationship between him and his comrades remained strong. He then founded his own private military company which many of his comrades joined. Pope also had a dog named Tick , who he strangled to death after being bitten by him.",
        "Post-Apocalypse[]": "At some point following the outbreak, Pope gradually became the leader of a group of hostile survivors that would come to be known as the \"Reapers\". The group was heavily armed with military grade weaponry and well trained in stealth and ambush tactics which were utilized when encountering other survivors and settlements that were \"marked\" by Pope to be killed or destroyed. The Reapers motives for destroying groups that caused them no harm is unknown though it was likely to obtain supplies and other resources. In the following years, Pope and his people came across a settlement of survivors led by Maggie Rhee in Tennessee. They decided to take the settlement by killing a majority of Maggie's group; forcing her and her surviving group members to flee back to Virginia. However, Pope ordered at least one member of his group to follow Maggie and her people and finish them off. Pope was mentioned by the Attacker who killed several members of Maggie's group. When he was surrounded and interrogated, the man simply says, \"Pope marked you\" , before committing suicide. Pope is first seen as Mancea prays and chants over Michael's body in tongues after he was found dead, Leah and the Reapers grieve their fallen brother. Clearly distraught, Pope proclaims that God is angry and so is he, and orders the Reapers to make the group they're hunting \"feel their wrath.\" Leah goes to see Pope and conveys what Daryl told her. Furthermore, she suggests they recruit Daryl. She is frustrated when Pope ignores her, and demands a response. Pope calmly replies that not everything is about her, and blames her for losing a day of tracking so Leah could interrogate her \"old boyfriend.\" After a moment of silence, Pope asks Leah about Daryl, to which she says that Daryl would be a good fit for their group due to being fearless. Pope, however, is skeptical, and thinks Daryl just wants to be with Leah. He then wonders why Leah didn't kill Daryl when she had the chance. Leah confesses that Daryl meant something to her at one point, but claims she severed all ties when she rejoined the Reapers, and doesn't regret her decision. Pope confides that he trusts Leah more than any of the other Reapers, and asks if she thinks they can trust Daryl. When she says yes, Pope is pleased, intends on finding out for himself. Pope then tests Daryl out by setting the shed on fire and the room is engulfed in flames. Daryl is able to break through a window and helps Leah out of the burning room, and follows her to safety outside where they find Pope and all of the Reapers gathered outside. Daryl is deemed \"forged by fire, ordained by God\" by Pope, who welcomes him into their ranks. In a private meeting, Pope asks Daryl if he believes in God. When Daryl admits that he doesn't, Pope is disappointed. Confused, Daryl points out that he passed their test, but Pope reveals the test isn't over. When asked what more he wants from him, Pope simply tells Daryl he wants him to understand. Over a drink and a cigarette, Pope explains the backstory of his group. The Reapers started out as a military unit serving in Afghanistan, where they saw a great number of their comrades killed. Despite their sacrifice, the politicians didn't really care about them, and just used them as props. In those dark days, the soldiers didn't have much to hold onto but God and each other. After returning home, many Reapers found it difficult to reintegrate into society. Ultimately, Pope formed a mercenary group comprised of his old unit, and they served all over the world. During the Fall, Pope witnessed such carnage that his faith in God started to waver, just like Daryl's. When the military bombed the cities, the Reapers survived by holding up in a small church, as everything around them burned. Despite their perilous situation, none of the Reapers were even injured. It was then that Pope came to believe the Reapers were chosen by God to survive. He compares this situation to Daryl making it out of the fire unscathed, claiming that God chose Daryl tonight as well. Pope brings Daryl to a bonfire where the Reapers are eating dinner, and orders Bossie to give Daryl some food. Pope then praises Bossie for carrying his fallen comrade for ten miles on his back, to which Bossie exclaims that he just did what any of them would have done. After inquiring about Bossie's wounds, Pope notes that the wounds are on his back. Despite Leah trying to calm him, Pope once again asks where Bossie was when Turner was being attacked. Petrified, Bossie claims he was there, facing the enemy. Acknowledging this, Pope tells Daryl that it's human nature to run when scared, and that it takes divine strength to risk everything for someone else. Pope commends Daryl got Leah out of the fire first, proclaiming that God baptized him in that fire. However, Pope warns Daryl that there is one rule he forgot to tell him: never turn your back on your brother. Pope then adds that God doesn't just use fire as His baptism, but also His wrath. With this, he throws Bossie into the bonfire and burns him to death for his perceived betrayal. Pope proclaims that the Reapers always run into the fire and towards the enemy. Pope is seen when Carver interrogates Frost for what he knows about his groups whereabouts. Initially refusing to talk even when tortured, Pope tasks Daryl with taking over to see what he can get out of him. Daryl puts Frost in a chokehold and orders him to give up his friends' location. Frost refuses. Daryl chops off Frost's finger and again demands to know the location of his friends. Frost finally reveals the location of the supply depot. Pope dispatches Leah to scout the location with a crew of Reapers. The Reapers return to Meridian. Carver tells Pope that Maggie's group got away. Pope reveals that he continued to interrogate Frost after they left and got all the information he needed. They see Frost tied to a post: he is now a walker. Pope confers privately with Carver as they head inside. Daryl worries if Frost told him that he's not actually loyal to them. The search patrol tells Pope that they found no sign of Maggie's group. Pope screams at the Reapers for failing to find their enemy, which Daryl has led him to believe is dozens strong. Leah admonishes Pope for yelling at his soldiers. Pope tells Leah to do another sweep with Daryl. When Leah and Daryl find a man hiding in the woods with his wife. Leah radios Pope to see what they should do. Pope instructs them to kill the man. Pope, Leah and Daryl watch the horde from the top of Meridian 's perimeter wall. Leah observes the horde is moving in a peculiar pattern. Daryl offers to lead the horde away from Meridian. Pope adopts Daryl's strategy, but sends Wells instead. When the Reapers stop hearing back from Paul over the radio, they assume that he is dead, which Pope reveals he figured would happen. Leah realizes Pope dispatched Wells as bait to confirm his hunch that Maggie is controlling the horde. Leah reminds Pope that Wells was part of their family, but Pope says it was Wells' fate to die. Pope asks Daryl for intel about Maggie. Daryl says that Maggie is a good shot and advises Pope to look for her in the trees. Carver radios Pope to report that the horde has returned. Pope looks out at the horde and declares that it will never reach their gate. Explosions start to go off as the horde trips mines that have been planted around the perimeter. Daryl rejoins Pope and Leah. Leah tells him the walkers are scattering, but Daryl points out that they're actually advancing. Pope tells Leah to secure the hwacha . Pope joins Daryl and Leah on the roof. Pope orders Ancheta to launch the hwacha. Leah says the hwacha will end up killing their own people, but Pope reasons that it's their time to die. Ancheta lights the fuse. Daryl unsheathes his knives to attack Pope. Leah stabs Pope in the neck. Daryl hurls a knife into Ancheta and puts out the fuse. Pope crawls on the ground. Leah stabs him once more, killing him.",
        "Death[]": "Killed By Himself (Indirectly Caused) Daryl Dixon (Caused) Leah Shaw After Pope shows his willingness to sacrifice his own men, along with some convincing from Daryl, Leah stabs Pope in the neck and he begins to bleed out. While trying to crawl away, Leah stabs him again at the base of his head.",
        "Killed Victims[]": "This list shows the victims Pope has killed: Tick (Pre-Apocalypse) Ms. Adams (Caused) Leo (Possibly) Teresa (Caused) Josephine (Caused) Jen (Caused) Billy (Caused) Matty (Caused) Gus (Caused) Ainsley (Caused) Maya (Caused) Roy (Caused) Cole (Caused) Duncan (Caused) Reaper 5 (Alive) Bossie Frost (Alive) Paul Wells (Indirectly Caused) Alden (Caused, Alive) Himself (Indirectly Caused) Numerous counts of enemy combatants (Pre-Apocalypse) Possibly unnamed Meridian residents Numerous counts of zombies and unnamed people",
        "Quotes[]": "The following is a list of some of Pope's most memorable quotes.",
        "Appearances[]": "",
        "Trivia[]": "A Pope (from Latin papa , derived from Greek πάππας) is a religious title used within several Christian churches, most notably the Roman Catholic Pontifex . Before being cast as Pope, Ritchie Coster auditioned for the roles of Bob , Abraham and Negan . [1] Pope's death is ironic, as Leah holds her boot to the back of his head, similarly to how Pope himself killed Bossie . Pope's death is similar to Hershel Greene , as both have their necks sliced open and attempt to crawl to safety afterwards, only to be caught again by their attacker and executed for good. Pope is one of three Reapers to not be seen with a Reaper mask, the others being Mancea and Montanio .",
        "References[]": "",
        "Name": "Pope"
    }
]