[
    {
        "Potter": "",
        "Overview[]": "Potter is a humble and grateful man, unlike many who live in the Sanctuary, most likely due to his low status in it's hierarchy. He seemed to despise Negan and his lieutenants, due to their poor treatment of the worker class. Following the defeat of Negan, he was grateful for the new regime brought by Rick Grimes , and held Rick in high regard.",
        "Pre-Apocalypse[]": "Nothing is known about Potter's life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "At some point in the apocalypse, Potter somehow came into contact with a group named \"the Saviors\" which he subsequently joined upon where he was appointed as a worker for the Sanctuary. Potter, along with José , Brooke , and many other workers confronts the Savior lieutenants, demanding power, water, and other amenities. He demands that the power be restored as it is too hot to stay on the ground floor. When Negan starts whistling and makes his way toward the crowd, Potter and the others quickly take a knee. Potter is among the workers from the Sanctuary sent to Eugene 's outpost to help produce bullets for Negan's army. When Eugene informs Frankie of what to inform Tanya regarding breakfast for himself and the workers, Potter openly shares his opinion with Eugene on what food they should get cooked by Tanya. Potter is producing bullets with the other workers when he listens to Eugene's speech about meeting the minimum quota for Simon. When a soot-covered Eugene returns after his brief absence, Potter and the other Saviors are ordered to complete the entire bullet order in anticipation of Negan's final assault on the militia. During the year and a half that passed since the end of the war , Potter started to work on the Sanctuary under Daryl 's orders. When Rick and his group arrive at the Sanctuary to deliver farming equipment, Potter tells the others Rick is the man who ended the war and tells him he hopes Negan is suffering. After Rick promises to the Saviors that he’ll continue to support them, Potter thanks him as everyone applauds and treat Rick like a celebrity. At some point following Rick's assumed death, the Sanctuary eventually falls as a community, with most of its residents integrating into Alexandria, Hilltop, and the Kingdom, though some chose not to join any of the communities. Since then, Potter has not been seen among the communities after the Sanctuary fell, leaving him with an unknown fate.",
        "Killed Victims[]": "This list shows the victims Potter has killed: Wade (Possibly; Indirectly Caused, Accidental) Huck (Possibly; Indirectly Caused, Accidental) Simon (Possibly, Zombified) Several dozen unnamed Saviors (Indirectly Caused, Accidental) Possibly numerous counts of zombies",
        "Appearances[]": "",
        "Trivia[]": "Potter appears in the archival footage shown at the beginning of \" Variant \" as Judith narrates past events of the show to the audience before the episode's story begins."
    }
]