[
    {
        "Quan": "Quan",
        "Pre-Apocalypse[]": "Nothing is known about Quan's life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "At some point in the apocalypse, Quan somehow came into contact with a group named \"the Saviors\" which he subsequently joined upon where he was appointed as a worker for the Sanctuary. Quan walks around the factory floor of the Sanctuary. Quan is among the many workers and Saviors to flee to the upper floors of the Sanctuary after the herd of walkers breaks into the Sanctuary. From the upper windows of the Sanctuary, Quan is among the Saviors and workers to help shoot at the walkers as a way to clear the Sanctuary of the horde that was lured there by the Militia . Quan is among the hundreds of Saviors and workers milling about the marketplace at the Sanctuary as the soldiers prepare for the final battle against the Militia. After the war ends and Negan is defeated, Quan is outside gardening with Laura and the other surviving Saviors. He and another young resident open the gates as Tara , Rosita , Eduardo , and other volunteers from Hilltop arrive with panes of glass to help repair the windows of the Sanctuary. Sometime after the events of the bridge's destruction and the 6 year time jump, Quan moved to the Hilltop Colony. He may have moved after the fall of the Sanctuary, or he possibly chose to move beforehand. Quan walks around Hilltop carrying a barrel of moonshine along with Papa Bear. Quan socializes with fellow residents at Hilltop. Quan and Troy escort Connie and Kelly back into Hilltop when the Whisperers suddenly arrive. He prevents Kelly from running after Connie, who is lagging behind, and gets Kelly inside the gates to safety. After witnessing the commotion that ensued when the Whisperers arrived, Quan remains armed with a spear and joins the other residents at the front gate. Quan is among the Hilltop residents that attend the fair at the Kingdom . He watches from the crowd as Ezekiel declares they've finally accomplished Rick, Carl , and Jesus ' dreams of reuniting the communities. “Let the fair of a new beginning begin!” Ezekiel says as everyone celebrates and applauds. In the fair, Quan sells moonshine and other beverages from his booth with Papa Bear to the fair attendees. The next day, Quan listens from the crowd as Siddiq delivers the tragic news about the fate of the missing fair attendees, tells them how brave the victims were in their final moments and how he was intentionally kept alive to tell this very story. He encourages everyone to remember the fallen as brave heroes and to honor them. Quan is among the coalition soldiers stationed at Alexandria. After waves of walkers begin surrounding the settlement, he attends the town meeting on how to handle the situation. After the meeting, he is among the crowd of people being instructed by Gabriel on how to repel the walkers and reports to his assigned location. For the next two days, Quan fights alongside the other soldiers and Alexandrians in defeating the walkers and removing their corpses. One morning, Quan attends a combat training session led by Aaron with several other soldiers. Quan is among the coalition soldiers on guard duty at Hilltop. Quan is among the Hilltoppers going about their business in town, though on high alert. After the caravan of children return to town, he listens as Daryl , Dianne , and the others discuss that the roads leading away from Hilltop have been blocked and that the Whisperers are closing in on them. He then helps the other townspeople prepare for the incoming battle and stays within the walls with the other residents for safety. Quan is among the residents to help defend the Hilltop as the Whisperers and their horde push into the settlement. He helps load the catapults with stones as they are launched onto the horde outside the walls. Ultimately, it can be assumed that Quan was killed by the Whisperers or the zombies that continued to push into the burning Hilltop, as he was not seen among the several survivor groups to escape Hilltop, and was never seen at any point afterwards again.",
        "Death[]": "Killed by The Whisperers Zombies It can be assumed that Quan was killed by the Whisperers or the zombies that continued to push into the burning Hilltop, as he was not seen among the several survivor groups to escape Hilltop after the battle. It's unknown if he reanimated or not.",
        "Killed Victims[]": "This list shows the victims Quan has killed: Possibly a few unnamed Whisperers Possibly numerous counts of zombies",
        "Appearances[]": "",
        "Trivia[]": "While his name has not been mentioned in dialogue nor has the character been credited, the name Quan comes from a chalkboard displaying his name at the moonshine booth in \" The Calm Before \". The chalkboard reads \"Hilltop Hooch + Papa Quan's Lightnin Shine. Mmm good!\" Quan is named after the actor who portrays him, Quandae Stewart, while \"Papa\" refers to Jamel Vaughn's character name from the set, Papa Bear .",
        "Name": "Quan"
    }
]