[
    {
        "Overview[]": "In contrast to the other members of his dangerous group, Randall did not appear to be a completely bad person, however he did display antagonistic traits such as attempting to shoot Rick , Glenn , and Hershel in order to avenge Dave and Tony 's deaths and also encouraging Rick to leave Shane behind while he was trapped in a bus, although both could be chalked up to his want to survive during high stress situations. Furthermore for the latter, he appears to be quite excited and enthusiastic when he helps save Shane with Rick. Randall did however seem to have good relationships with his fellow group members as he showed concern for Dave and Tony and also Sean . Randall however admitted to witnessing the cruelty of his group, though it is unknown if he partook in the same acts of cruelty. He firmly stated he did not participate, though there is a possibility he lied and he did hint a few times that he enjoyed the group he was a part of, and did not seem to be disgusted at his group's actions. Even after being left to die by his group he still seemed to show some admiration for them as implied by comments to Shane and appeared to want to re-join his allies. Randall is shown to be extremely talkative, which he himself admits he does when he's nervous. This often causes him to say things without thinking getting him into more trouble. After Rick and Shane leave Randall at a station, he attempts to plead with them and mentions that he went to school with Maggie . This causes an argument between Rick and Shane, with Shane saying Randall is too dangerous. It's most likely that if Randall had kept his mouth shut, Rick and Shane would've let him go and the feud between them wouldn't have intensified. Later, while Daryl interrogates him, he starts to talk about how his group raped teenage girls and forced the father to watch, going into specific details on what went down despite not needing too, prompting Daryl to beat him up more. Randall was also shown to be a sly, cunning, untrustworthy, and a liar person as shown by his attempt to convince Carl to release him from his chains, claiming he was innocent and the members of his group are good people. He was shown to have a strong desire to live as he begs Rick numerous times to not kill him or allow Shane to kill him. He's also not good at hiding his emotions, crying numerous times during his captivity. Although it was never revealed of Randall's true nature, good or bad, Shane took no chances and violently murdered him to ensure he would cause no harm to the group.",
        "Pre-Apocalypse[]": "Not much is known about Randall's life prior to or as the outbreak began, except that he was born in 1990, attended school with Maggie Greene , and was on the varsity baseball team. He also lived with his mother and brother, whom he lost in the outbreak. He talks about having a normal life as \"just some guy\". He also enjoyed watching football and \"screwing around on the internet\".",
        "Post-Apocalypse[]": "At some point following the outbreak, Randall's entire family was killed and for a period of time he was all alone. He eventually encountered a group of about 30 survivors known only as \" The Living \" and became a member in which he assisted in scouting missions and protecting the group. Randall himself claimed that he witnessed the atrocities of his group. One incident in particular in which his group gang raped two teenaged girls while they forced their father to watch, but kept them alive. Randall claimed he did not partake in the group's violence though he may have lied. He claimed the only reason he joined the group was to survive.",
        "Death[]": "Killed By Shane Walsh (Alive) After Shane sets Randall free, the two wander off into the woods, talking about the possibility of Shane joining Randall's group. Once Shane felt that they've reached a far enough point away from the farm, Shane snaps Randall's neck, instantly killing him. Glenn Rhee (Zombified) Later, Daryl and Glenn find a zombified Randall in the woods. Daryl fires a bolt at him but misses, so he pins him to the ground, where Glenn slashes him in the head, putting him down.",
        "Killed Victims[]": "This list shows the victims Randall has killed: 2 unnamed public works survivors (Zombified) Numerous counts of zombies and possibly unnamed people",
        "Appearances[]": "",
        "Trivia[]": "In the Talking Dead following the episode \" Judge, Jury, Executioner \", episode director Gregory Nicotero confirmed that he had initially shot Daryl and Randall's final confrontation in the barn to where that Daryl was going to kill Randall himself until he heard Dale 's desperate screams for help. Randall is mentioned in \" I Ain't a Judas \" by Carol to Andrea when discussing Shane's death. A broken neck is fatal if it severs the spinal cord, because it consequently blocks the neural connections between the brain and the rest of the body - heart, lungs, but most relevantly, limbs. Despite the fact that Shane killed Randall by breaking his neck, a zombified Randall was somehow able to get up and attack Daryl and Glenn just like a regular walker would. This was probably a plot oversight. Randall was initially scripted to kill Hershel Greene in the Season 2 episode \" Better Angels \", but the producers eventually decided against it. It is revealed in a deleted scene that Randall's last name is Culver , and Maggie discovers Randall went to the same high school as her when she looks through her high school book and finds his picture. Randall's brother also attended that school. However, Maggie was two years ahead of Randall, apparently shared no classes with him, and guesses that she just never noticed him.",
        "Name": "Randall Culver"
    }
]