[
    {
        "Reg Monroe": "Reg Monroe",
        "Overview[]": "Reg is cultured, wise, gentle and well-educated. He's also reasonable and very respectful to people around him. He is shown to be a good mentoring figure, such as agreeing to teach Noah about architecture. Reg is quite caring and brave, immediately rushing towards Pete Anderson to stop him from killing Rick . Unfortunately, Reg ends up getting his throat slit by Pete. Reg's death is what ultimately shows Deanna that they need to be ready to do what needs to be done, as she tells Rick to kill Pete.",
        "Pre-Apocalypse[]": "Nothing is known about Reg's life prior to or as the outbreak began, except that he lived in Ohio, had two sons Aiden and Spencer , is married to Deanna Monroe , and was a professor of architecture.",
        "Post-Apocalypse[]": "Reg and his family tried to return to Ohio as the outbreak started, but was directed to Alexandria by the U.S. Army . After the Army failed to show up, Reg and his sons started to build a wall around the community using materials from a nearby shopping mall under construction. When other people joined the community, they had enough manpower to finish the construction of the walls. Deanna introduces Rick Grimes to her husband at the party, where he offers him a drink. Rick hesitates at first, but ultimately accepts Reg's offer. Later, he can be seen talking to Erin as newcomer Sasha Williams is overwhelmed by the atmosphere of the party. Reg is called by newcomer Noah to meet him in the early morning, before a supply run. He agrees and meets with the boy, bringing him breakfast. During the meeting, Reg is surprised to learn that Noah wants him to teach him about architecture, and that he fears the walls can be knocked in or worse. When Noah says he wants to help the community grow by constructing buildings, Reg agrees in teaching him and passes his notebook to Noah, telling him to write down everything that happens, explaining that he does the same. Reg is later seen with his wife Deanna, watching as their son Aiden goes on a run with his scout team and Eugene Porter . Reg is seen with Spencer and Deanna as they listen to one of Aiden's track CDs, depressed over Aiden's death. After a few minutes of the CD playing, Reg requests the music be turned off, unable to listen to anymore. Reg is later seen yelling for Deanna when Pete Anderson and Rick's fight escalates to them fighting in the middle of the town square. Reg watches as Rick yells at the townspeople, and waves his gun around, for a brief moment aiming at him. Reg is seen alongside Maggie Rhee and Deanna while Maggie is trying to convince Deanna that Rick does not mean any harm to the community. Reg attempts to assure Deanna that Maggie is telling the truth and, later after the conversation, tells Maggie that he will do anything that he can to help Maggie convince Deanna that the community needs Rick to survive. Reg appears alongside the rest of the community during the town meeting, joining in on discussing the topic of what Rick the day before. He remains silent as Deanna's and Rick's groups debate on a solution. Soon after Rick trudges in the midst of the meeting with a walker's corpse and informs everyone of the unlocked gates, a drunken Pete appears, brandishing Michonne Hawthorne 's katana. Reg rushes towards him, trying to prevent another confrontation, only to be slashed through the throat as Pete shoves him away. Deanna appears to be shocked, and cradles his body whilst screaming his name. Reg dies in her arms as he chokes to death from his own blood. She then gives Rick the order to execute Pete. Although covered up, Reg's corpse is seen in the beginning of the episode being brought to the graveyard by Abraham Ford . Abraham takes out a bottle of alcohol, takes a sip himself, and then pours a little onto Reg's tarp-covered body in his memory. He is later seen being buried in the Alexandria graveyard by Fr. Gabriel Stokes and Tobin . Reg and his wife Deanna appear in a photograph on the table Pamela sits at when visiting Alexandria. Pamela mentions to Daryl and Aaron that she knew Deanna as they sometimes crossed paths when she was involved in philanthropy circles in Washington DC, well before she got involved in politics.",
        "Death[]": "Killed By Himself (Caused) Pete Anderson (Accidental) As Reg attempts to calm Pete down, he gets his throat slashed with Michonne's katana and quickly dies from blood loss. Abraham Ford (Before Reanimation) [1] Later, Reg is put down by Abraham to prevent reanimation.",
        "Killed Victims[]": "This list shows the victims Reg has killed: Himself (Caused) Possibly numerous counts of zombies",
        "Appearances[]": "",
        "Trivia[]": "Reg is the first member of Alexandria to be directly killed by a living person.",
        "References[]": "",
        "Name": "Reg Monroe"
    }
]