[
    {
        "Regina": "",
        "Overview[]": "Like most of her fellow Saviors , Regina is a rough and ruthless survivor. She is one of the highest-rankings members and as such holds a lot of power. She has no qualms killing others when necessary, including shooting a Savior worker who is about to kill Simon . After the end of the war , Regina along with the other Saviors join the other communities. She seems to have attempted to change her antagonistic ways, such as trying to stop a fight between Jed and Aaron . However, when Saviors begin to be killed, she turns back to her aggressive ways. Six years after Rick 's presumed death, Regina joined Jed's group and became bandits who stole supplies. After they robbed Carol and Henry , Carol would get revenge on them and burn them alive.",
        "Pre-Apocalypse[]": "Nothing is known about Regina's life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "At some point in the apocalypse, Regina somehow came into contact with a group named the \"Saviors\" which she subsequently joined upon where she was appointed as one of Negan's personal lieutenants. Regina aided her group in terrorizing other survivors and communities around the area into subjugating to Negan's will, where their victims would be forced to give half their supplies in exchange for not being murdered. Over time, Regina was appointed as the leader of her own outpost due to her loyalty and leadership capability. She became in charge of overseeing the collection of weekly tributes from a community located at the Viskocil Public Library .",
        "Death[]": "Killed By Carol Peletier As payback for hurting Henry and presumably killing other survivors for their supplies, Carol locates Regina and her group's camp. She spreads fuel around and uses a lit match to ignite the fuel, burning Regina and the other Saviors to death.",
        "Killed Victims[]": "This list shows the victims Regina has killed: Simon (Possibly, Zombified) 1 unnamed Sanctuary worker Several horses (Alongside her fellow survivors) Numerous counts of zombies and unnamed people",
        "Appearances[]": "",
        "Trivia[]": "Regina appears to have been the highest ranking female Savior while under Negan's leadership and the only female leader of a Savior outpost; in this case the Shephard Office Plaza . Regina is also the last of Negan's closest lieutenants and outpost leaders to die aside from Eugene, who redeemed himself. With the deaths of Regina, Jed and their group, the remaining known antagonistic Saviors aside from Negan are dead. She is the first named Native-American character to appear on The Walking Dead and second overall as the first one was Terminus Resident 1 . A year and a half after Negan's defeat, Regina is observed walking with a cane, as a result of being shot in the leg by Eugene during the final battle. Six years after Rick 's presumed death, however, she is shown walking without it once more. This is possibly a reference to Rick in the Comic Book , who is forced to walk with a cane after Negan broke his leg at the end of the war. Similarly, Rick's leg eventually healed enough that he didn't need the cane anymore. During the In Memoriam on Talking Dead for \" Who Are You Now? ,\" Regina is not named despite her death being shown. Instead, she is simply grouped in with the other former Saviors who are billed as Saviors Getting Lit . Only Jed gets his own separate part where he is billed as Savior Jed . This is despite the fact that Regina had a longer role stretching through Season 8."
    }
]