[
    {
        "Overview[]": "In contrast to Saviors like Jared , Reilly isn't shown to be hostile and seems to be a good-hearted person on the wrong side. He is shown to care for his fellow Saviors , arguing that they can't leave their injured comrades behind. After Simon showed his lack of care for him and the other captured Saviors, Reilly starts to question his loyalty and what is waiting for him back at the Sanctuary. When given the offer to go back to Hilltop , Reilly and some other Saviors accept. Reilly shows his loyalty to Rick after saving him from walkers. Unfortunately, Reilly along with the rest of the Saviors would be betrayed by Rick. Reilly states in his final moments that they could've lived and become part of the community.",
        "Pre-Apocalypse[]": "Nothing is known about Reilly's life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "At some point in the apocalypse, Reilly somehow came into contact with a group named \"the Saviors\" which he subsequently joined. Reilly aided his group in terrorizing other survivors and communities around the area into subjugating to Negan's will, where their victims would be forced to give half their supplies in exchange for not being murdered. Although unseen, Reilly is among the Saviors at the satellite outpost to surrender to the Militia. He is then taken to the Hilltop and put in a makeshift prison. Having escaped from the Hilltop , Reilly and the other escaped Savior prisoners capture Rick and Morgan near the abandoned dive bar they are resting at. With injured comrades, the Saviors argue over what to do, particularly as Rick reveals that a herd is on the way. Jared insists on killing them and to head to the Sanctuary when Rick offers the Saviors a chance to return to the Hilltop and join the community, in which Reilly and a few others seem to seriously consider Rick's offer. As the herd attacks the bar, Reilly and another Savior free Rick and Morgan. As he provides cover fire for them, he is suddenly attacked by Rick with a hatchet and then is bitten by the invading walkers. Later, as a dying Reilly lays on the ground, he speaks a few words to Rick, choking on his own blood. Rick shoots him once in the head with his revolver.",
        "Death[]": "Killed By Himself (Indirectly Caused) Rick Grimes After Reilly frees Rick and Morgan, he provides cover fire for them, however, he is suddenly attacked by Rick with a hatchet. As he lays on the ground, dying, he speaks a few words to Rick before being shot by him.",
        "Killed Victims[]": "This list shows the victims Reilly has killed: Himself (Indirectly Caused) Jared (Indirectly Caused) Evan (Indirectly Caused) At least 5 unnamed Saviors (Indirectly Caused) Numerous counts of zombies and possibly unnamed people",
        "Quotes[]": "The following is a list of some of Reilly's most memorable quotes.",
        "Appearances[]": "\" Still Gotta Mean Something \"",
        "Trivia[]": "Reilly's first and only appearance was in \"Still Gotta Mean Something\". He, along with the other credited Saviors in this episode, was not credited nor did he appear in any other Season 8 episode featuring Alden and the other Savior prisoners. Reilly is the last named person that Rick Grimes killed before leaving the show. Rick approaching a badly-hurt Reilly and trying to listen to what he says before killing him is a reference to a similar event with Rick and Bob Lamson in \" Coda \".",
        "Name": "Reilly"
    }
]