[
    {
        "Richard": "",
        "Fate": "",
        "Contents": "",
        "Overview[]": "Richard is a stoic, cynical, apathetic, and brave man. As stated by Paul Rovia , he has never seen Richard smile, most likely due to the death of his family. He has an immense hatred for the Saviors and tries to convince Ezekiel to get the Kingdom to join in the fight against them. During the Savior exchanges, he gets into conflict with Jared on multiple occasions. Because of this, Gavin tells them that if the Kingdom doesn't give enough food, Richard will be the first to be killed. Richard shows that he cares more about the lives of the people around him more than his own, stating that he proudly die for the Kingdom. In an attempt to get the Kingdom to join the fight, Richard gets rid of a cantaloupe to sabotage the food exchange, knowing this would lead to his death. He hopes that his sacrifice will motivate the Kingdom to fight the Saviors. However, the plan would go wrong when Jared shoots and kills Benjamin instead of him. Angered by his death, Morgan would strangle Richard to death as revenge, an action he would later regret. Despite his plan causing the death of both him and Benjamin, it would ultimately succeed in getting the Kingdom to join the war.",
        "Pre-Apocalypse[]": "At the perfect age, Richard grew to become a family man where he married a woman whom both had a daughter named Katy and the three lived together as a typical family located somewhere near the greater Washington, D.C. Throughout his adult life, Richard believed he never personally asked for much and received more than he ever deserved.",
        "Post-Apocalypse[]": "After the onset of the outbreak, Richard and his family found refuge inside a large tented community where over time several problems arose within the community. Richard, however, never acted upon his concerns regarding their safety believing that it wasn't his responsibility. At some point later, an unknown conflict ensued which resulted in a fire that engulfed the community and his wife was caught and burned to death leaving Richard and Katy on their own. After 3 days of travelling with no food and no sleep, they found themselves in a precarious dilemma which resulted in Katy being devoured by walkers, leaving Richard on his own. Sometime after this event, Richard later encountered Ezekiel with whom he came to develop a fierce loyalty towards and subsequently settled into his community named the Kingdom. Upon assimilating into the community, he managed to regain a sense of purpose and thus committed himself in ensuring the safety of his fellow residents and in the process, became one of Ezekiel's trusted allies. Roughly during this period, Richard managed to befriend Paul Rovia , a scout for a nearby community named the Hilltop Colony upon where the two came to develop a trusting partnership, and thus a trading system was established between the two communities. Despite this, Richard gained a lesser opinion on the community leader Gregory for his cowardice. Richard was present at the time of the arrival of a notorious group of survivors named the Saviors who operated on behalf of Negan . Upon meeting, the Saviors demanded a portion of supplies in exchange for leaving the community unscathed, to which Ezekiel complied under the condition that the Saviors would never step foot inside the Kingdom. Throughout the following months, Richard aided his group in gathering supplies in order to compensate the Saviors demands and thus he took part in several conducted weekly trades between the two groups, which he alongside Ezekiel, and several others kept secretly hidden from the rest of the community. When his companions are being attacked by walkers on the road, Richard and a group of Kingdomers come to the rescue and then help them transport the newc omers to the Kingdom. Later that day, he attends the feral pig hunt with Ezekiel, Morgan, Benjamin , Dianne , Alvaro , and Jerry . After the pigs are herded into a garage, he allows the pigs to feed upon a walker tied up in a room, stating that he wants their bellies filled with rot for the Saviors. After Dianne loads up the truck with the captured pigs, Richard drives separately from the group back to the Kingdom. Richard later attends the exchange with the Saviors and gets into an altercation with Jared . He manages to dodge Jared's initial blow and punches him in the face in return, prompting everyone to raise their weapons. As Ezekiel attempts to diffuse the situation, Jared knocks Richard to the ground and punches him several times before being ordered off of him by Gavin . As the Saviors drive away, Gavin informs the Kingdom group that Richard will be the first killed if next week's food drop is too light. A bloodied Richard looks on and scoffs at the Saviors as they drive away. In an effort to fight against the Saviors, Richard stops by at Carol's cottage to speak with her and Morgan to help him convince Ezekiel to strike first, explaining that he doesn't think the Kingdom can co-exist with the Saviors. Carol refuses to have anything to do with it and insists on being left alone, while Morgan hesitates to disrupt the peace with the Saviors. Richard dejectedly leaves and enters a camper trailer hidden in the woods. He hurls an empty milk bottle and cries. When Rick 's group is brought to the Kingdom outskirts by Jesus, Richard and Alvaro greet them and question what they are looking for. After Jesus explains that they have similar interests, Richard invites them to follow him. He stresses their need to battle the Saviors as Jesus assures him that he has good news. Richard takes Rick's group inside the Kingdom, where they reunite with Morgan and then to the theater, where they meet Ezekiel. As Rick tries to convince Ezekiel to help them fight the Saviors, Richard urges Ezekiel to fight the Saviors before things get worse. However, Morgan advises that they must find a non-violent course. The next day, Ezekiel rejects Rick's offer to join the fight as he believes the peace will last and instead offers asylum in the Kingdom to Daryl Dixon who recently escaped the Saviors' custody. Rick explains to Richard that they don't have the numbers to take out even one outpost. Richard realizes it’s not just about the numbers since they're making the Saviors stronger every day by providing food, weapons, and supplies Richard is at the Saviors exchange with Ezekiel and the rest of his court, waiting for Gavin and his band of men to arrive. When the Saviors arrive, Jared says that he wants Richard's gun and the two men face off. Ezekiel tells Richard to hand over his gun, which he reluctantly does. When Jared lunges at Richard, Morgan strikes him with his staff. Jared seizes the staff and hits Richard and Morgan with it, so Benjamin strikes Jared and sends him to the floor. Ezekiel bans Richard from attending future exchanges, but Gavin stops and tells him to keep bringing Richard because he will be the first one of the Kingdomers to die if the fights keep happening. Upon arriving back at the Kingdom, Richard gives Daryl a new crossbow and asks for his help on a mission to attack the Saviors. He takes Daryl to his hidden camper trailer in the woods and explains that they have to hit the Saviors first, before he makes a Molotov cocktail. When Richard tells Daryl his plan to kill the Saviors using a woman named Carol as bait, Daryl refuses to put her in danger and they soon start fighting until Daryl gains the upper hand and threatens Richard that should any form of harm come to Carol he will kill him. Richard says that he would proudly die for the Kingdom. \"Why don't you?\" , Daryl counters before he leaves. As the Kingdomers load cantaloupes onto a truck for their scheduled drop with the Saviors, Richard apologizes to Morgan for their strained relationship. He also warns Morgan that he will have to kill someday. En route to the drop, the group encounters a row of shopping carts blocking the road near an urban lot. As they search the area, weapons ready and move the carts off the road, Richard covers the group from behind. Upon arriving at the supply drop site, Gavin reprimands them for arriving late. After Jerry tells Gavin off for interrupting Ezekiel, he is struck by Jared, to whom Benjamin shows his extreme displeasure towards. As Gavin inspects the Kingdom's share of cantaloupes, he discovers that they are short of one. Their guns are seized and Gavin gives the order to Jared of killing Richard as retribution for not keeping to their deal. However, Jared suddenly shifts his aim and fires, hitting Benjamin in the thigh and severing his femoral artery. After Gavin offers the Kingdomers one more chance, allowing them another day to supply drop in the final melon, the Saviors the Kingdommers to tend to Benjamin. As per Morgan's insistence, they drive Benjamin to Carol's house, figuring that he doesn't have long before he bleeds out. Despite the efforts of everyone present, Richard watches in complete shock as Benjamin succumbs to blood loss and dies on the table. When Morgan confronts Richard after discovering he had intentionally hidden the cantaloupe, and caused Benjamin to die, Richard explains that he planned to provoke the Saviors into killing him, as Gavin had promised he'd be the first to die if anything went wrong. He'd hoped his death over something so petty would motivate Ezekiel to fight the Saviors. Richard then begins to tell his story prior to the outbreak, and proposes they do something to regain the Saviors' trust, and then destroy them with help from Alexandria and the Hilltop . The next day during the supply drop, Richard brings the lonely cantaloupe over to Gavin when Morgan walks up to him and whacks him twice with his staff from behind. After allowing Richard to fall to the ground, Morgan pounces on top of him and begins to strangle him to death with no remorse, before finishing him by throwing Richard's head on to the concrete twice. After Morgan explains to everyone present why he had killed Richard, he puts him down and then buries him with his daughter's backpack in the grave he had dug earlier that day.",
        "Death[]": "Killed By Jared (Indirectly Caused) Himself (Indirectly Caused) After Morgan finds out that Richard had hidden the melon that resulted in Benjamin's death at the hands of Jared, he starts showing signs of his previous PTSD. Gavin (Caused) Morgan Jones During their next delivery to the Saviors, Morgan whacks Richard on the back of his head with Benjamin's stick. Then, he mounts and strangles Richard to death while also bashing his head into the asphalt. Gavin meanwhile, had his men point their guns at Ezekiel and the other Kingdom soldiers to prevent them from stopping Morgan. After the drop ends, Morgan pulls out a knife and stabs Richard in the head to prevent reanimation, and later buries his body in the grave he dug for himself.",
        "Killed Victims[]": "This list shows the victims Richard has killed: Benjamin (Indirectly Caused) Himself (Indirectly Caused) Numerous counts of zombies",
        "Relationships[]": "For a more in-depth look at Richard's relationships, read here; Richard (TV Series)/Relationships",
        "Appearances[]": "",
        "Trivia[]": "The casting call for this character used the name Rogers . Richard was described as \"30s to 40s. A rugged, no-bullshit survivor who's very protective of his way of life. He's straight-laced, no-nonsense, and is as tough on himself as he is on others. He's lost a lot over the years and he may even blame himself for not fighting harder to hold on to the people he's loved. But he's not about to make that same mistake again.\" Richard owned a backpack belonging to Katy, which he kept as a personal memento of her. In a deleted scene for \" Bury Me Here \", Benjamin knocks on Richard's door in one of the Kingdom buildings and asks if he is ready, to which Richard states he will be ready soon. Benjamin questions if Richard is okay, as he senses Richard has been crying. Richard replies that he is fine. He attempts to write a goodbye note, throwing away the first two drafts before settling on the third and leaving it on his desk. He takes a moment and stands in his room, where three large maps are visible on his walls."
    }
]