[
    {
        "Richard Foster": "",
        "Fate": "",
        "Contents": "",
        "Pre-Apocalypse[]": "Little is known about Richard's life prior to or as the outbreak began, except that he has a pet dog, wife , and daughter , who survived along with him. It is possible that he lived in or near Woodbury prior to the outbreak.",
        "Post-Apocalypse[]": "Richard is seen walking around town with his daughter and wife. He and his family also inspect the newly-acquired vehicles taken from the National Guard by the Governor and listen to his speech. Richard is seen walking in the street with his wife and daughter. At the barbeque, Richard relaxes in a chair and enjoys watching his daughter play fetch with the family dog. He holds his daughter as they listen to the Governor's speech during the toast. Afterwards, he continues to enjoy the festivities with his family. Richard watches his daughter ride her bike in the street. Richard is attacked by zombies, who broke into Woodbury through the back gate. Seriously wounded, he is shot in the head to prevent reanimation by the Governor, who then returns to his apartment without uttering a single word. Richard is later mentioned by the Governor along with other Woodbury survivors who were killed when Andrea goes to talk to him.",
        "Death[]": "Killed By Zombies (Caused) While the townspeople of Woodbury are attempting to depart, Richard is attacked by walkers who had breached through the back gate and is bitten several times. Philip Blake (Out of Mercy) Soon after, the Governor comes out of his house and shoots him in the head to prevent reanimation.",
        "Killed Victims[]": "This list shows the victims Richard has killed. Possibly numerous counts of zombies",
        "Relationships[]": "Woodbury Mrs. Foster † - Wife Philip Blake † - Leader and Out of Mercy Killer",
        "Appearances[]": "",
        "Trivia[]": "Richard was bitten by two zombies, one of them being the The Walking Dead 's FX Makeup artist, Greg Nicotero , who enjoys performing zombie acting every season, and the other being an extra, Andrew Jenkins. Richard is dubbed as The Woodbury Guy in the In Memoriam segment of Talking Dead for \" The Suicide King \". Richard and his family were listed as Featured Family in the scripts for the Woodbury scenes in Season 3 . [1]",
        "References[]": ""
    }
]