[
    {
        "Rick Grimes": "",
        "Overview": "Rick is typically a calm, smart man, being both a good friend and a dedicated father. However, he will often stubbornly cling to his strong personal moral code, which has resulted in numerous questionable decisions and extra stress within the group. Rick's greatest fault, perhaps, is his uncanny ability to place responsibility on himself and set for himself goals that are impossible to reach. Despite his faults, his combat skill and general care for all members of the group have led him to be looked up to, and allowed him to take the leadership role within the group. Rick is strongly non-religious, admitting to never have been much of a believer and instead putting his faith in his family and the group members around him. Relying on his former police skills and survival tactics, Rick has evolved into a battle-hardened survivor who will protect his family and group without question. In many ways, Rick has become exactly like Shane; being ready to destroy a threat, living or dead, without a moment's hesitation, not trusting anyone except for his group, and knowing that with the world the way it is now, there are very few good people left and if you don't fight for your survival, then you will die. In addition to picking up some of Shane's ideologies, Rick has displayed similarities to other primary antagonists that he has encountered and killed (or who other members of his group have killed) in the past, particularly the Governor, Joe, Gareth , and most recently Negan (who is currently alive). However, unlike the aforementioned enemy survivors, Rick retains some of his humanity and honor for the sake of his family and friends, looking to them for guidance in making sure that he doesn't completely lose his sanity and devolve into an another antagonist himself. This is in direct contrast to the people he's faced, who have almost completely sacrificed their humanity in favor of personal survival by any means necessary, and who exert unchallenged power and control over other survivors and give into their worst inclinations for their own benefit, rather than the benefit of others. Throughout the first season , while adapting to the new apocalyptic world, Rick maintains his honor and moral code and is shown to be incredibly protective of his group and their well-being as seen when he attempted to return to Atlanta to save Merle Dixon 's life and also refused to surrender Glenn to the Vatos Gang . He is also shown to be willing to use deadly force to protect his group as he threatens Daryl Dixon a few times with his revolver when he acts out. Upon entering the CDC and learning of the severity of the apocalypse, Rick refuses to allow his family and group to die in the exploding CDC and claims that there is still hope and is able to convince Dr. Jenner to let them try for as long as they can. By the second season , Rick is still shown to be extremely protective of his group as seen by his devotion to find the missing Sophia, despite Shane's argument that she is dead and also refuses to risk his group's residency on Hershel 's farm due to Lori's pregnancy by going along with Hershel's views of the Walkers still being people. After the massacre of the walkers in the barn and discovering Sophia, Rick regrets his decisions that put the group at risk. While making amends with Hershel, Rick, for the first time is forced to use deadly force to protect his allies from death as he kills Dave and Tony , two men who attempt to force their way onto Hershel's farm. Despite this, he refuses to leave Randall , a member of Dave and Tony's group behind to die following an attack on him, Glenn and Hershel. Saving Randall's life and deciding to let him go is the ultimate moment in his rivalry with Shane and the two physically fight each other over his life. After learning of the threat of Randall's group, Rick reluctantly decides to execute him, but stops at the last minute after seeing Carl watch. After deciding to once again release Randall to honor Dale 's wishes, Shane attempts to assassinate Rick by killing Randall and luring him out into the woods under the guise that Randall is free and armed, however Rick kills Shane instead, an act the visibly breaks him. Following this and the destruction of Hershel's farm, Rick has become noticeably colder and strains his relationship with Lori, Carl and the group by revealing Jenner's secret of everyone being infected and his killing of Shane. Following this, he declares himself leader of the group. By Season 3 , Rick had become battle hardened after months on the road and is still distant from members of the group, mostly Lori. Despite this, Rick is able to use his leadership skills and combat abilities to keep the group alive for many months and leads the group in taking the abandoned and overrun West Georgia Correctional Facility , using desperate survival tactics they had come to learn on the road all winter. Rick at this point also has no hesitation in killing human threats as seen when he mercilessly killed the prisoners leader, Tomas , for attempting to kill him twice and also locking Andrew in a courtyard of walkers to die. Rick has also shown that he no longer trusts outside members of his group and refuses to allow Oscar and Axel , two prisoners to join his group following the assassination attempt on him by Tomas, showing he's more cruel. He eventually accepts them once they prove their loyalty to him by killing Andrew, who survived being left to die and launched an attack on the prison in order to exterminate the Survivors and nearly killed Rick himself, though Oscar saves him. After Lori's death, Rick becomes very emotionally unstable, and it's not until just before the group learns of the Woodbury threat that Rick comes back to his senses. By this point, Rick has become a ruthless, uncompromising leader of survivors, in contrast to his high moral code and values in previous seasons. After the Governor causes Andrea 's death, Rick seems to regain much of his old self and finally begins to trust other survivors and accept them into the prison. In the six-month jump between the third and fourth seasons, Rick relinquishes his leadership position in order to focus more on raising Carl and making the prison self-sustaining. During the fourth season , many of the other group members ask Rick to step back into a leadership role, most notably Daryl Dixon . After the Governor returns and attacks the prison, Rick becomes distraught and remorseful over the loss of the prison, the death of Hershel and the assumed death of his daughter Judith . He becomes more protective of Carl and gets into a few arguments with him. After Rick reunites with Michonne , he loosens his grip on Carl a bit and allows himself some time to rest, albeit only temporarily. After he, Carl, and Michonne are forced to evacuate a house they were residing in to evade the Claimers , he comes across a poster pointing to Terminus . He decides to take a chance and see the supposed sanctuary. On the way, they encounter the Claimers, who tracked them down in order to exact revenge on Rick for killing one of their group members, Lou . Rick comes to terms with his brutality, which he thought he had put away for good, after he rips out Joe 's jugular with his teeth and stabs Dan , who attempted to rape Carl, to death. The next morning, he tells Daryl he knows of his two different personality traits and how he has settled his mind knowing that his brutality has kept his son and the rest of the group alive. After arriving at Terminus, Rick accepts his leadership position, for which the group respects him. He holds no conflict in his mind anymore and does not doubt his decisions. The wisdom he took from Hershel, who he came to view as a mentor (as well a father figure towards him), Rick now understands that he can retain his humanity by protecting his friends and has stated that he views his group as his family. His darker side is shown through his brutality and he does not hesitate to kill someone who he views as a threat, fearing he or she will come back and harm his family (based on what happened to Lori when Rick failed to kill Andrew , the prisoner who Rick locked in a courtyard of walkers and presumed was killed). During Season 5 , following the group's near death experience at Terminus, Rick grows in confidence but develops massive trust issues towards any strangers that he and his group come across, even if they seem timid and harmless. He has a hard time trusting Gabriel Stokes and Aaron , even threatening to kill them once or twice if they did anything that would harm his family and friends. His trust issues are so strong that he even suspects the applesauce Aaron offers to Judith to be poisoned. Aaron points out that he is tied up and that killing Rick's daughter in front of him would only lead to Aaron getting killed by Rick. Aaron tries telling Rick that his trust issues are exaggerated, but Rick remains stubborn and makes it clear that he is a man who doesn't take chances anymore, and forces Aaron to eat the applesauce to prove that it's safe and still threatens to kill him. In the end, Aaron and Gabriel (for the most part) prove that they are not threats. After arriving in the Alexandria Safe Zone , Rick cautiously allows himself to relax in the comfort of the community, although it is evident that he still does not trust the inhabitants. He becomes actively involved in the community after Deanna Monroe , the safe zone's leader appoints him and Michonne as constables. While he appreciates the job, Rick and his group view the Alexandrians as being weak and unfit to survive and he declares that they will take the community for themselves, showing how his mentality has become one of survival for himself and his group. He is willing to kill members of the community if it means the majority will learn to survive, and tries to make them understand what it takes to live in the new world. When his confrontation with the alcoholic and abusive Pete turns violent, he launches a tirade at the shocked Alexandrians in the street, which nearly seals his exile from the community at the hands of Deanna. He is saved by the intervention of Michonne, who knocks him unconscious. When Walkers manage to get into the community, displaying their defensive vulnerabilities, Rick tells them that they will have to change if they are to survive. When Reg is killed by an enraged Pete, Rick executes him at Deanna's command. In the days following this incident, Rick takes a greater leadership role in the community as Deanna mourns and deals with her overwhelming grief. Although there is distension, Deanna approves of Rick's plans and gives him her support. The two grow closer, and she tries to get Rick to realize that the Alexandrians are all his people now, just as his original group is. Following a massive invasion of walkers into the safe zone, which leads to the death of Deanna, Rick becomes the leader of the safe zone, and his faith in the abilities of the safe zone's residents improves dramatically as together they all boldly face the herd and kill every walker, effectively reclaiming the safe zone. Rick reveals to his injured son Carl afterwards that he is ready to show him the new world. Following this he seems to have cooled down a bit in his desire to kill human threats as he spares the life of Paul Rovia after the latter attempts to steal a van of supplies claimed by Daryl and Rick which leads them to finding the Hilltop Colony . His relationship with Michonne has also caused him to show his lighter side more often, as he is seen relaxed and happier than he was before they started their relationship. Over the course of Season 6, Rick's confidence grows with every successful outcome and threat survived. He believes that not only are his people capable of dealing with any threat, but that the Alexandrians themselves now know what it takes to survive. Rick has shown that he has not lost his ruthlessness, as shown by his desire to exact revenge on the Saviors for threatening Daryl, Abraham and Sasha and kill them all in order to obtain much-needed supplies from the Hilltop Colony, and protect Alexandria, even though the Saviors have technically caused no harm to them. Rick now has a desire to destroy any potential threats before they even happen, showing that he will do just about anything to protect his people from danger (very similar to The Governor in the first half of Season 3 , but on a more heroic scale). Rick has demonstrated that he's now indeed a cold-blooded killer as shown during their attack on the Savior outpost and his killing of Primo and Jiro . He also nearly kills an innocent survivor from the Kingdom, believing him to be a Savior hunting Carol, though Morgan stops him to his visible anger and claims regardless of who he was, he no longer takes chances, showing that he is willing to kill completely innocent survivors. However, his overconfidence and eagerness to destroy the Saviors brings about serious consequences; while on a frantic journey to get a sick Maggie to the Hilltop, he and his group are tricked and ambushed by the Saviors and for the first time in the series, Rick shows extreme fear as he is confronted with an impossible situation over which he has no control. At the sight of his new enemy, Negan , Rick visibly trembles and appears to be almost numb with terror and is helpless as Negan personally selects a member of the group at random and beats them to death with a baseball bat in revenge for Rick's actions. It is revealed that Negan had selected Abraham and preceded to beat him viciously to death with his baseball bat; Rick watches on in horror. Glenn is later killed as punishment for Daryl assaulting Negan moments after Abraham's execution. Rick, with Abraham's blood on his face, quietly threatens to kill Negan. Negan inquires to as to what Rick said and Rick is petrified to look at him but gains the courage to repeat his threat while looking him in the eye. Negan then takes Rick on a \"trip\" where he continuously mocks Rick for thinking of a prosperous future with his group whilst physically assaulting him. Unsatisfied Rick hasn't submitted to him, Negan returns Rick to his group and threatens that if he doesn't severe Carl's left arm his remaining group members will be executed. This pushes Rick to his absolute breaking point as he wails, cries, has mucus run out of his nose and even suggest he suffer the amputation. Just as Rick is about to cut off his son's arm, Negan becomes satisfied claiming the terror on Rick's face was the \"exact look\" he desired. Having been the first man to devolve Rick into a complete loss of power and control, Negan has revealed the extremity of Rick's emotions/actions of absolute fear and subjugation as he becomes horrified for the safety of his remaining group should he provoke Negan again. This fear was later subsided after the deaths of Spencer and Olivia, and finally regains his courage to fight Negan and the Saviors. He attempts to recruit the Hilltop and the Kingdom to help fight the Saviors with little success. Rick's desire to kill other survivors, aside from the Saviors, has subsided as well: this is most likely due to the fallout that came from his attack at the Saviors outpost. Once again, Rick has also shown a reluctance to lead, only wishing to lead Alexandria, not wishing to lead the joint communities once they take out the Saviors. Rick has demonstrated that he is no longer afraid of Negan as while he is once again at his mercy, he tells him that no matter what he does to him he will make it his mission to kill him and all the Saviors and that nothing will change that. This shows Rick will never be subservient to Negan again and will do whatever it takes to stop him, even at the cost of his own life to ensure a prosperous future for his family, group and allies. During Season 8 , Rick along with Ezekiel and Maggie have stepped up to lead their communities in a war against Negan and the Saviors. Rick is shown to have complete faith in the abilities of his soldiers and the Militia and claims that they will win the fight at all cost. Rick has displayed his intense ruthlessness and mercilessness again and is prepared to kill any Savior without hesitation as he single-handily slaughters numerous Saviors brutally. He is also shown to not be willing to take chances with strangers again as he chases a lone survivor named Siddiq away with his revolver, much to the anger of his son, but he justifies it by saying he could be a Savior. In spite of his willingness to kill the Saviors and his threat to Negan in the Season 7 finale , Rick appears to be focused more on just killing his nemesis Negan and ending the conflict without too much bloodshed as he personally offers Negan's lieutenants, including Simon and Eugene , a chance to surrender, while Rick promises he will kill Negan as he has promised him twice, though they all refuse. Throughout the war, Rick has shown remorse for some of his actions, notably killing the father of an infant in a Savior Outpost and also shock at some of his allies' desire for blood, notably Daryl who kills their old ally Morales , despite knowing him and Todd , who Rick promised not to harm, showing that Rick is not completely merciless. In spite of this, Rick is truly dedicated to free his allies from Negan and the Saviors at all cost and is willing to do whatever it takes, as seen when he recruits the Scavengers to help him fight in spite of their betrayal of him, showing that he is desperate to stop Negan. The war however has taken its toll on Rick and he has suffered one of the most personal losses he will ever face: his own son. Carl's death absolutely devastates Rick and pushes him to his absolute breaking point. Following this he appears to be more determined then ever to kill Negan as he recklessly attempts to go after him alone and almost gets himself killed in the process. He is shown to still be somewhat hostile towards Siddiq and appears to hold a slight grudge against him due to his involvement in Carl's death as he rejects his words following the Saviors' assault on the Hilltop and is shown to be emotionally distant from others, even Michonne. Rick has displayed an even colder side as well as he refuses to allow Jadis to return to safety with him and Michonne after learning that the Saviors have massacred her people and shows no remorse for their deaths and blames her for the situation. He is shown to now want to destroy the Saviors entirely again as he mercilessly slaughters more Saviors during the attack on the Hilltop and after he and Morgan are kidnapped by a group of Savior prisoners fleeing from the Hilltop and with a herd approaching, Rick promises not to harm them though even after the Saviors attempt to help him and Morgan fight the Walkers and after one saves Rick from being bitten, the two betray them and brutally slaughter them and Rick even sadistically admits to one before he kills him that he lied all along. This situation shows that Rick is potentially developing into a bloodthirsty killer very similar to Morgan as both have lost their sons and are now venting their trauma and anger on hostile forces threatening them and their allies and also now sees no chance that the Saviors are capable of redemption and that they best be exterminated. However, after betraying the Saviors that helped him, seeing what he had become and reading Carl's letter, Rick is reminded of who he once was and has a change of heart about how to deal with the Saviors. After defeating Negan by slicing his throat, instead of letting him die he asks Siddiq to save him, despite Maggie's protests. He also gives the remaining Saviors a chance to help him and the other communities in creating a new world together. In Season 9 , a year and a half after the war against Negan, Rick has adopted a more peaceful and democratic way of leadership and is seen as a heroic figure among some people. Despite his decision to spare Negan, he still tries to unite all the communities to accomplish Carl's vision of rebuilding a civilization for the future. In an effort to do this, he unites the communities in rebuilding a bridge that will serve as a connecting point between the communities's trade routes, however, despite his best intentions, several events unfold in the camp which leads to several people abandoning his project and breaking his dreams, to the point of making him cry in sadness. In the end, Rick, seeing that the bridge supports a herd coming towards the communities, does what he considers is the right thing and in a selfless way, shoots at some dynamite, causing an explosion and destroying the bridge to save all his loved ones. Despite being rescued, Rick's presumed sacrifice is always remembered as the reason people followed his example and joined together to create a better future, and his legacy will always be carried on by his family and loved ones, including a new son named R.J. , who was conceived shortly before his disappearance. Years later, Rick is brought on as a consignee for the Civic Republic Military where all the time away from his family has left him broken. Rick attempts to escape four times, but he was unsuccessful. One of those attempts resulted in Rick severing his left hand, proving just how determined he was to escape and return home to his family. Eventually, Rick discovers that lieutenant colonel Donald Okafor knows about his family due to one of his escape attempts, which causes Rick to finally submit to the CRM and burns his letters to Michonne. After putting his family in the rear view mirror, Rick contemplates suicide, but doesn't go through with it, proving how being away from his wife and children has broken him mentally. He is eventually reunited with Michonne, much to his complete and utter shock. While overjoyed being in his wife's presence after years away, Rick's excitement quickly diminishes after Jadis threatens to destroy Alexandria if he and Michonne escape. Realizing that returning home isn't an option, Rick desperately attempts to get Michonne to escape herself. This causes a strain in Rick and Michonne's marriage, with Rick even going as far as to tell Michonne that everything they had is broken. It is clear that Rick wants to return home, but knows the danger he will be putting his family and loved ones in by escaping and keeps up the façade with Michonne. Rick's dedication to the CRM becomes blurred when he learns of R.J.'s existence, clearly wanting to return to see not just his daughter, but his new son. However, he eventually confides in Michonne that his memory of Carl has faded and has no recollection of what his first born child looked like. This, coupled with the idea of losing Michonne the same way and feeling that he would be unable to survive losing her, forced Rick to distance himself from his family to avoid losing them like he lost Carl. After a heartfelt conversation with his wife who gifts him an engraved iPhone with Carl on it, Rick reverts back to his old ways, now determined more than ever to escape the Civic Republic entirely and return home to his children. Eventually, with Michonne's support, Rick returns to the CRM to finish what he started by exposing and stopping the organization's genocidal plans. Despite Michonne's belief that Okafor's plan for Rick to work his way up to change things was impossible, Major General Beale recognized Rick's leadership qualities to the point that he predicted that Rick himself could potentially be Beale's successor as the leader of the CRM within the next decade. Jadis also recognized Rick's potential as a leader and the threat that he could pose to the CRM as seen in her dossier where Jadis listed Rick bringing a network of communities together and leading the war against the Saviors as examples of his leadership abilities. However, Beale was too blinded by what he believed was Rick seeing the bigger picture to realize Rick's true purpose in coming back. His old spirit fully reignited, Rick told Beale that he had lost himself, not his son, and that his family had brought Rick back. Although Rick suggested the idea of leaving Portland to its destruction once Beale was gone and simply going home to their family, neither he nor Michonne would be able to live with themselves, knowing that they were the only ones in any position to stop it. After finally being able to return home, Rick was initially somewhat hesitant to approach his children due to how long he'd been away and how much he'd missed. However, both Judith and R.J. warmly greeted their father and expressed how much they had continued to believe in him even while Rick was gone, overcoming any remaining hesitation that Rick had.",
        "Pre-Apocalypse": "Rick was born in 1973 and grew up in Georgia , somewhere near Atlanta . As a child, he shared a close relationship with his father whom he described as a 'profound' man who instilled a strong moral code onto him. [6] His mother often told him the story of \" The Stone in the Road \", which encouraged him to never give up in the face of adversity. [7] He also became inspired by the old tales of his grandfather, whom served during the Second World War. [8] One night, when Rick was seven years old, he discovered his father badly injured in a fire, initially believing his father was a monster; however, his father saved him, telling him to not be afraid. After his father eventually died, Rick's mother revealed that he was the one to light the fire and burn their crops to save the farm, telling Rick that, although his father's actions were wrong, he nonetheless saved his family. He grew up alongside his closest friend Shane Walsh , where the two developed a strong bond together to the point where the pair came to regard each other as 'brothers'. In high school, Rick acted as the more disciplined of the pair and thus experienced very few short-lived relationships with girls, in contrast to Shane whom had many conquests. [9] Academically, Rick and Shane studied at Georgia Central University together, with Rick graduating on June 14, 1994 with a Bachelor's degree in Criminal Justice. Afterwards, they were both employed as deputies stationed at the King County Sheriff's Department , with Shane assigned as his partner. [10] As a young adult, Rick later met a woman named Lori , where the two eventually fell in love with each other and became married where together they had a son named Carl . The trio lived together as a typical family in a single-story house located in King County, Georgia, where Shane became a close friend of the family. [10] Rick took memorable walks with his 3-year-old son around a local farm, where Carl became grateful for the safety and happiness his father provided him. [11] Over time however, Rick and Lori's marriage became increasingly strained due to Rick constantly distancing himself from her, as he generally hesitated to express his feeling regarding their marital issues and thus Rick instead opted to absorb himself through his work. This nature led to various cracks in their relationship, which resulted in harsh words directed from Lori, who once questioned whether Rick cared about his family in the presence of their son. [10]",
        "Post-Apocalypse": "Main article: Rick Grimes (Onslaught)",
        "Killed Victims": "This list shows the victims Rick has killed: Leon Basset (Zombified) Hannah (Zombified) Summer (Zombified) Sophia Peletier (Zombified) Dave Tony Shane Walsh (Alive) Tomas Eisenberg (Alongside Daryl , Maggie , and Oscar ) Bob Adams (Alongside Daryl, Maggie, and Oscar) Pete (Possibly, alongside Daryl, Maggie, and Oscar) Oscar (Indirectly Caused) Erin (Zombified) Charlie (Zombified) The Piglets (Caused) Lou (Alive) Joe Dan Alex (Caused) Bat Smock Man (Alive) Knife Smock Man (Alive) Crazed Man (Caused) Mike Albert Gareth Bob Lamson Pete Anderson Carter (Out of Mercy) Tommy (Before Reanimation) Edward Red Bearded Wolf (Zombified) Young Boy (Zombified, alongside his fellow Alexandrians) Ethan Gabe (Before Reanimation) Primo Jiro Abraham Ford (Indirectly Caused) Spencer Monroe (Zombified) Gordon (Caused, Zombified) Tough Grizzled Savior (Caused) Red Haired Savior (Caused, Zombified) Gracie's Father Yago Bruce (Possibly, Out of Mercy or Before Reanimation) Evan (Caused) Savior POW (Alongside Morgan ) Reilly Lance (Alongside his fellow Militia members) Norris (Zombified) Kathy (Zombified) Nat (Before Reanimation, alongside Michonne ) Dalton (Zombified) Anne (Out of Mercy) Johnathan Beale (Alive; Zombified, alongside Michonne) 1 unnamed criminal (Alongside his fellow officers, Pre-Apocalypse) 1 unnamed Mert County deputy (Zombified) Many unnamed West Georgia Correctional Facility prisoners and guards (Zombified) 4 unnamed Woodbury soldiers (2 Alive, 1 Zombified, 1 alongside Michonne) 1 unnamed prison newcomer (Before Reanimation) 7 unnamed Terminus residents (5 Caused, 2 Direct) 4 unnamed Wolves 22 unnamed Saviors (21 Direct, 1 Caused) 21 unnamed Scavengers (4 Alive, 17 Zombified) 3 unnamed Alexandria residents (2 Before Reanimation, 1 Zombified) 1 unnamed Hilltop resident (Zombified) 1 unnamed Kingdom soldier (Zombified) 5 unnamed members of the little girl 's group (2 Zombified, 3 Possibly, Zombified) At least 2,001 unnamed Frontliners (1 Direct, 1 Alive, Zombified, alongside Michonne, 1,998 Alive, alongside Michonne, 13 Zombified) Many unnamed Greenwood residents (Zombified) All unnamed members of CRM Force Command (Alive, alongside Michonne) Possibly several unnamed criminals (Pre-Apocalypse) 1 deer (Caused) Numerous counts of zombies",
        "Relationships": "For a more in-depth look at Rick Grimes' relationships, read here; Rick Grimes (TV Universe)/Relationships",
        "Quotes": "For more of Rick's quotes, please visit Rick Grimes (TV Universe)/Quotes . The following is a list of some of Rick Grimes' most memorable quotes.",
        "Appearances": "",
        "Gallery": "For more images of Rick Grimes, please visit Rick Grimes (TV Universe)/Gallery .",
        "Trivia": "According to Robert Kirkman , regarding his inspiration behind the character, he stated \"Rick Grimes is really just a bunch of made up stuff that I thought would work. Every writer kind of writes themselves to a certain extent so all the sadistic stuff in Rick Grimes is totally me! Not really. It's just a character I'm pretending exists in my head and then writing the stories down on paper as you do.\" [12] 100 actors auditioned for the role of Rick Grimes, most notably Jamie Bamber , Stuart Townsend , Ethan Embry , Mark Pellegrino , and Thomas Jane . Eventually Andrew Lincoln was officially cast in April 2010 due to Robert Kirkman labeling him as 'an amazing find'. [13] In preparation for the role, Andrew Lincoln stated that he sought inspiration from Gary Cooper from his work in the American western film High Noon (1959), whom Lincoln cited as an influence to his character: \"He's a divided man between his responsibilities and his marriage. He's not like the Clint Eastwood figure, the loner. It's more complicated than that. He's got a softer heart, so that was definitely an inspiration for me as well.\" [14] Andrew Lincoln also noted that he took inspiration from the novel The Road , most notably from \"the man\" portrayed by wikipedia:Viggo Mortensen , who shares several similarities to Rick. Both survivors are southern American and appear to be in their 40s. They both lost their wives during the apocalypse and travel with their sons in search of a safe haven. Rick's signature weapon was his Colt Python until he lost it during the bridge explosion. It was later found by Michonne who later gave it to his daughter, Judith. Just like his comic counterpart, Rick also used a hatchet , the melee weapon that he carried later in the series. After his disappearance during the bridge explosion, the location of the hatchet or who currently possessed it is unknown. Rick is tied with his son for killing the second most amount of members from the original Atlanta Group . Rick himself killed Shane , while Carl put down his mother Lori after childbirth. They are both preceded by Daryl Dixon who has been responsible for three Atlanta Camp deaths ( Dale , Glenn and Morales ). Of these, Rick and Daryl were the only ones who killed still-living characters. Lori had already been dead by the time Carl put her down to prevent reanimation. Rick was awarded the 2014 People's Choice Award for Favorite TV Anti-Hero. Rick has appeared in the third most episodes over any other character, having appeared in 110 episodes, followed by Carol, who appears in 125 episodes, and Daryl, who appears in 148 episodes. Rick does not have any form of religious beliefs, and is shown to be an atheist - this has been supported several times throughout the series. In \" Days Gone Bye \" he reluctantly agrees to say grace during a meal with Morgan and Duane . In \" What Lies Ahead ,\" upon entering a church he claims to have been \"never much of a believer.\" In \" Cherokee Rose ,\" when discussing the theme of religion alongside Hershel Greene , Rick firmly stated \"Last time I asked God for a favor my son got shot. I try not to mix it up with the almighty anymore, best we stay out of each others way.\" Rick also reveals that he sees no divine intervention whatsoever in his waking up from his coma and finding his family in the midst of the apocalypse or Carl's survival from being shot and simply claims that God has a strange sense of humor. In both \" Wildfire \" and \" Judge, Jury, Executioner \" Rick implies that he does not believe in an afterlife while speaking to a dying Jim when he claims he wants to be reunited with his family after his death to which Rick does not understand and states his family is dead and attributes his words to his worsening infection and later while criticizing Carl for insulting Carol over believing that Sophia is in heaven, claiming that Carol wants to believe that Sophia is still alive in some way as way of dealing with her grief over her death. In \" Strangers ,\" through his interactions with Father Gabriel , Rick dryly remarks, \"You only tell your sins to God.\" In \" Heads Up ,\" Rick coldly tears down Gabriel's prayer service notes; however, this could also stem from Rick's hatred specifically toward Gabriel at the time. Rick owns a silver Kenneth Cole Watch, which he keeps as a personal memento of his father . [15] Rick's blood type is A+, the same type as Carl's. [16] Through a deep conversation with Hershel after recalling his encounter with Clara , Rick stated that he nearly became close to her fate implying that Rick may have contemplated suicide after Lori's death. According to Gregory Nicotero , Rick carries the exact bullet that Carl used to kill Lori inside of his pocket (as chosen by Andrew Lincoln while playing the role). [17] Although Rick has primarily shown to be right-handed, he has been shown several times throughout the show to use weapons with his left hand. It is possible that Rick is ambidextrous: This is hinted at in \" Indifference \" when Sam questions if Rick is \"righty or lefty,\" to which Rick does not reply. [18] As shown in his house, Rick owned an American flag painting, indicating that he was patriotic. Interestingly, his grandfather was a World War II veteran. Rick appears to be a fan of Georgian music including Ronnie Dawson \" Action Packed \" as well as Old 97's \"If my heart was a car.\" of which he keeps on a personal CD. [9] Rick's clothes from the third season premiere can be purchased as an Xbox 360 Avatar outfit. Rick is the first character in the television series to directly kill a living person ( Dave ) after the apocalypse. Although Shane was the first character, overall, who caused the death of a living character ( Otis ). Rick has killed the largest amount of living characters in the TV Universe with a total of at least 3,070 victims. With the events of \" The Last Time \", of The Walking Dead: The Ones Who Live , Rick and Michonne hold the highest direct kill count of any character in the TV Universe aside from Donald Okafor , having killed more than 2,526 people at once. It's unclear exactly how many people died as the CRM Force Command was also present, but Andrew Lincoln stated in the Episode Insider that there were 3,000 Frontliners present. Rick has killed the most season primary antagonists in the series, with a total of four: Shane Walsh, Joe , Gareth and Pete Anderson . Rick has also killed the largest amount of named antagonists in the series with a total of 19: The 4 aforementioned characters, Dave , Tony , Tomas , Lou , Dan , Alex , Mike , Albert , Bob Lamson , Ethan, Primo , Jiro , Yago , Evan , and Lance . With the exception of the Governor's Militia , Rick killed at least one antagonistic group member encountered on the show during his duration. In The Walking Dead: The Ones Who Live , Rick kills Major General Johnathan Beale , the primary antagonist of the show, and Jadis , the tertiary antagonist as well as the primary antagonist of Season 2 of The Walking Dead: World Beyond . Rick bears several scars including one located on his left shoulder (after being stabbed by Morgan), as well as gunshot wound on his left leg during the second prison attack. Additionally he later bears one located across his nose alongside another scar located underneath his right eye (which he sustained after his fight against Pete ). Rick also has a scar on his right hand from one of Winslow's spikes piercing it. Rick is one of the two characters (the other being Morgan Jones) who physically appeared in the Pilot and are still alive, though both characters are no longer apart of the TV Series. It was revealed that Rick was originally going to die in Season 8 . [19] As of Andrew Lincoln's departure in \" What Comes After \", there are no members of the first season 's main cast still in the show. Rick is the first character in the show to drop an f-bomb, which can be heard on the Blu-ray release of the series. Ironically, despite being the first to use the f-bomb, every instance of him using it was censored while airing on AMC. Rick is one of the nine TV Universe characters to appear in Fear the Walking Dead , the others being Morgan Jones , Paul Rovia , Carol Peletier , Dwight , Sherry , Jenny Jones , Duane Jones , and Negan Smith . He is also one of the six TV Universe characters to appear in The Ones Who Live , the others being Michonne Grimes , Anne , Aiden , Bailey , and Gabriel Stokes . Rick is also one of three characters to appear in three shows, the others being Carol Peletier, Anne, and Negan Smith. Unlike his comic counterpart , Rick has had another child brought into the apocalypse in the TV Series , R.J. Grimes . He and Michonne are the sixth couple to have a child during the apocalypse - the first being Lori and Shane 's daughter Judith , followed by the two infants from the Kingdom , a Savior 's daughter Gracie , Maggie and Glenn 's son Hershel Rhee , Nabila and Jerry 's children Ezra , Aliyah and Mariam , and Frances ' son Adam . Rick is a playable character in other media such as PlayerUnknown's Battlegrounds Mobile , Magic: The Gathering , Brawlhalla , Fortnite and Call of Duty . Rick and Shane make a cameo appearance in Issue 81 of Invincible , another comic series created by Robert Kirkman. [20] Rick's college diploma, which was officially auctioned by Goldin, revealed his full name to be Richard D. Grimes . [21] Rick appears and is heard in the archival footage shown at the beginning of \" Lockdown \", \" A New Deal \", \" Variant \", \" Outpost 22 \" and \" Faith \" as Judith narrates past events of the show to the audience before the episode's story begins. Rick misspells \"Their faces\" as \"They're faces\" in the notebook he is writing in at the end of \" Rest in Peace \". This may have to do with that, during the apocalypse, he had not practiced writing conventions regularly for about a decade. Rick gets the first and last kills in The Walking Dead , putting Summer down in the opening scene of the series and putting an unnamed walker down in the final scene of \" Rest in Peace \". Like in the TV series, Rick has both the first and the last kill of The Walking Dead: The Ones Who Live and like in the TV series, it's a walker. Rick is the twelfth main character to outlive his comic book counterpart , with the first being Shane Walsh , the second being Carol Peletier , the third being Tyreese Williams , the fourth being Beth Greene , the fifth being Judith Grimes , the sixth being Morgan Jones , the seventh being Abraham Ford , the eight being Rosita Espinosa , the ninth being Ezekiel , the tenth being Alpha , and the eleventh being Gabriel Stokes . Rick is the only character to appear in-person in both the premiere and the finale of The Walking Dead . Andrew Lincoln likes to call his character \"Ricky Dicky Doo Dah Grimes\". Rick is one of six characters to survive the TV Series who died in the Comic Series , the others being Carol Peletier , Judith Grimes , Gabriel Stokes , Ezekiel Sutton , and Maxxine Mercer . Rick, Morgan Jones , Daryl Dixon , and Carol Peletier are the only confirmed survivors of the outbreak introduced in Season 1 to not die in the TV Series . He is the only main character of Season 1 to not die in the TV Series. Rick has the longest lifespan in the show, being introduced in the series premiere and appearing in the series finale . His middle name is never mentioned in the show, however in the video game The Walking Dead: Destinies , there is a tutorial image the player will see when their health falls down to \"broken state\" for the first time where his name above the health bar is Rick D. Grimes , possibly taken from a screenshot of a beta version of the game. Rick is one of the many characters to suffer an amputation during the series. Similar to Merle Dixon, he amputated his left hand as part of an escape attempt. Though his comic counterpart lost his hand much earlier in the apocalypse, he lost his right hand while the TV series Rick lost his left hand. As seen in \" Bye \", Rick held a record number of 68 walker kills at the Harvest Point culling facility, presumably gotten during \" Years \". This record was broken in \"Bye\" by Michonne as mentioned in \" What We \". This record presumably refers to the number of kills gotten in a single day, not the number of kills total. As seen in a behind the scenes photo, Rick was at some point supposed to get a prosthetic that more closely resembles his comic counterpart's prosthetic. As stated by Andrew Lincoln, Rick was apparently stuck in a coma for three weeks. This however contradicts what has been established in the franchise up until that point.",
        "External Wikis": "Rick on the Brawlhalla Wiki Rick on the Call of Duty Wiki Rick on the Dragon City Wiki Rick on the Fortnite Wiki Rick on the Monster Legend Wiki Greymond - Rick's counterpart on the Magic the Gathering Wiki",
        "References": ""
    }
]