[
    {
        "Rick Grimes Jr.": "",
        "Contents": "",
        "Overview[]": "R.J. is a cheerful, amiable, innocent, and benevolent child. After the disappearance of his father, Rick Grimes , R.J. can be seen as part of his legacy that lives on. He is shown to get along with the rest of the kids well, often seen playing with them. He is apparently extremely bright as Sebastian Milton mentions that R.J. has recently jumped two grades in school. According to Michonne, R.J. has inherited both of his parents' stubbornness and Rick's kind heart which is the trait in her son that reminds Michonne the most of her husband. Michonne tells Rick that R.J. and Judith would tell each other the story of what their father did and R.J. nicknamed Rick \"The Brave Man\" and himself \"Little Brave Man\" as a result. Michonne also tells Rick that no one has ever called R.J. \"Junior\" and suggests that R.J. might like a hatchet as a weapon like his father did.",
        "Post-Apocalypse[]": "Rick Grimes Jr., nicknamed R.J., was born in December 2014 to Rick and Michonne Grimes in Alexandria, Virginia . R.J. was named after his father, who was kidnapped by the Civic Republic Military in March 2014 shortly after he was conceived. R.J. was raised by Michonne alongside his older adoptive sister, Judith .",
        "Relationships[]": "For a more in-depth look at R.J.'s relationships, read here: Rick Grimes Jr. (TV Universe)/Relationships",
        "Appearances[]": "",
        "Gallery[]": "For more images of Rick \"R.J.\" Grimes Jr., please visit Rick Grimes Jr. (TV Universe)/Gallery .",
        "Trivia[]": "R.J. is the sixth known child in the TV Series to be born into the apocalypse, the first being his sister Judith Grimes , the second and third being two unnamed infants living at the Kingdom , the fourth being Gracie , and the fifth being Hershel Rhee , the seventh being Ezra , the eighth being Aliyah , and the ninth being Mariam . R.J. is the only member of the Grimes family who did not have his own direct Comic Series counterpart. R.J. is Rick's only known living blood relative in the series. From his older half-brother Carl 's death in \" Honor \" until his revealed birth in \" Who Are You Now? \", Rick had no known living blood relatives. R.J. and Judith are the first adoptive siblings to appear on the show. R.J.'s codename is \"Little Brave Man\". In \" A New Deal \", R.J. is seen reading Invincible , Robert Kirkman's other comic series. This is also a reference to when his older half-brother, Carl , was also reading Invincible in \" The Next World \". As of \" Family \", R.J. is the only member of the Grimes family to not have been shot. His father Rick was shot three times. The first time by an unnamed criminal in \" Days Gone Bye \", the second by Alisha in \" Too Far Gone \" and the third time by Jadis in \" The First Day of the Rest of Your Life \". His mother Michonne was shot in the leg by Merle Dixon in \" Hounded \". Michonne was also shot in the chest by Merle's brother Daryl in a hallucination she had in \" What We Become \". Lori Grimes was shot in the head by Carl to prevent reanimation in \" Killer Within \". His half brother Carl was shot twice, once in the stomach by Otis in \" What Lies Ahead \" and once in the left eye by Ron Anderson in \" No Way Out \". Both times were accidental. His sister Judith was shot in the shoulder by Pamela Milton in \" Family \". While unconfirmed, it's likely that R.J.'s great-grandfather was shot at some point during his time serving in World War II. The original ending of the show had a time-skip of at least 10 years, and an adult R.J. was shown driving in a van with Judith, Gracie, Socorro and Ezra searching for other survivors to bring back to their community. In this deleted scene, R.J. refers to himself as \"Rick Grimes\", and is portrayed by Roland Buck III . [1] In \" Deux Amours \" of The Walking Dead: Daryl Dixon , Daryl lists R.J. as one of his friends that he misses in America when Laurent asks Daryl about his friends. Laurent later names R.J. in his prayers since Daryl doesn't pray. Rick was unaware of his son's existence until \" What We \" of The Walking Dead: The Ones Who Live . According to Michonne in \" Become \" of The Walking Dead: The Ones Who Live , no one has ever called R.J. \"Junior\". Rick had found a decorative license plate with that name in Yellowstone National Park and thought that his son might like it.",
        "References[]": ""
    }
]