[
    {
        "Overview[]": "At first, Roberts seems to be a rather cunning and condescending individual. When Negan tries to cut a deal with him to allow his wife to have less work, he and another soldier, Sanborn , beat him to remind him of his place. However, Roberts deep down is a kind and good-hearted man who hates the brutal treatment of the Commonwealth prisoners, although he doesn't speak out against the sadistic Warden . Notably, during the earlier confrontation, Roberts had tried talking first and had only escalated things when Sanborn did. Roberts cares deeply about his family and can barely hide his anger when the Warden extends his tour of duty at Alexandria rather than letting him go home to see his sick brother, something that Negan notices. When the Warden orders the execution of Negan and Annie, Negan appeals to Roberts, having noticed his caring nature. After Ezekiel and a number of the other prisoners stand up to the Warden, Roberts is inspired to follow suit, convincing most of his fellow soldiers to do so as well. Roberts defects to the point that he turns his own gun on the Warden and kills Sanborn when he tries to stop him and then joins the prisoners in trying to save Kelly from the Warden.",
        "Pre-Apocalypse[]": "Nothing is known about Roberts' life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "At some point during the outbreak, Roberts joined a community in Ohio. While working at the railroad tracks outside of Alexandria , Negan spots Annie nearby and, ignoring Ezekiel , approaches Roberts and offers to pick up a couple of extra shifts so that his wife can have her workload loosened. Negan appeals to Roberts personally who appears to consider it before they are interrupted by Sanborn . After being told that Negan is mouthing off, Sanborn decides that they need to show him his place and hits Negan with the butt of his rifle . Negan attacks Sanborn, but he is knocked to the ground by Roberts and kicked in the gut. Seeing her husband's predicament, Annie rushes in to intervene and shoved to the ground by Sanborn and is dragged away with him after a brief scuffle as Roberts keeps Negan from intervening at gunpoint. Hidden in the bushes nearby, a worried Daryl and Carol observe these proceedings. As Negan and Ezekiel talk with Tyler Davis , Roberts and Sanborn enter and drag Negan to his feet when he refuses to go with them until they tell Negan where his wife is and leave with him. Roberts leads Negan into the Warden 's office where the Warden orders Negan to take a seat. Roberts roughly shoves Negan into a chair, but the Warden stops Roberts before he can leave and informs Roberts that his transfer has been denied. Roberts tells the Warden that his brother has been very sick and he doesn't know how long his brother has left. The Warden callously tells Roberts that he should've told him directly instead of going around the Warden to ask for a transfer. As a result, Roberts' duty at the outpost has been extended six months. Negan notices Roberts clench his fist in anger as he departs. Roberts stands guard outside as Negan talks with the Warden and then takes Negan to see Annie, standing guard as they talk. Roberts later brings Negan back when he has a name for the Warden. As the prisoners lay in their bunks that night, Sanborn and several other soldiers burst in, yelling for everyone to get outside immediately. The prisoners are all led to the windmill where the soldiers shine spotlights on them and the Warden, standing in front of Ezekiel and looking at him, announces that there's a traitor in their midst, someone who thinks that he's above the rules. Roberts and another soldier lead out Negan who has admitted to spearheading a rebellion , although any co-conspirators will be given the benefit of the doubt as the Warden trusts that they were not acting of their own free will. As such, only Negan will be punished, but they all need to see and remember. Annie breaks free and runs towards her husband, sobbing, but she is restrained, and Negan reassures his wife that it's alright. The Warden has Negan put on his knees in front of the windmill to be executed by a firing squad while the prisoners murmur to themselves about how they knew that Negan couldn't be trusted and was a liar and Annie pleads for her husband's life to no avail. However, before the Warden can give the order to fire, he notices Negan smirking and, unwilling to let Negan martyr himself, grabs Annie and adds her to the execution. Negan desperately pleads for the Warden to leave Annie alone and take only him, but the sadistic man is determined to make Negan feel this punishment. Ezekiel is conflicted watching this while Negan pleads with Roberts, who has a family, not to do this, causing a moment of hesitation before he proceeds. Unwilling to allow Negan to be executed, Ezekiel moves in between the firing squad and Negan and Annie, standing in their way. A number of the other prisoners quickly follow Ezekiel's lead, including Magna , Kelly , Princess , Tyler, and Nabila , creating a human wall between the soldiers and Negan and Annie. The Warden admits that he admires their bravery, but he nevertheless orders his men to shoot them all. Noticing most of the soldiers hesitating at being ordered to murder so many people, Ezekiel pleads with them that \"you don't have to do this! This world is broken, but we don't have to be.\" Realizing that Ezekiel is right, Roberts lowers his gun and turns to the rest of the soldiers who follow his lead. Roberts turns his gun on the Warden, but Sanborn aims at him in return, causing Roberts to shoot him dead. The Warden grabs Kelly and tries to escape by using her as a hostage as Roberts and the prisoners try to stop him. However, Daryl and Connie come up from behind the Warden and Daryl stabs the Warden in the back, incapacitating him and retaking Alexandria from the Commonwealth. Negan prepares to kill the Warden with a rock, but he's stopped by Rosita . Rosita demands to know where her daughter is, but the Warden refuses to answer. Seeing Sanborn reanimate, Rosita grabs him and holds the walker over the Warden's face, once again demanding to know where her daughter is. With a smile, the Warden sadistically tells Rosita that she will lose everything, and Rosita furiously shoves the zombified Sanborn into the Warden's face which Sanborn begins devouring, killing the Warden. Rosita walks away, leaving Sanborn to eat the Warden as her friends, the soldiers and former prisoners watch in shock and horror at the brutal death. Roberts remained back in Alexandria and presumably survived the Commonwealth Conflict . [1]",
        "Killed Victims[]": "This list shows the victims Roberts has killed: Sanborn (Alive) The Warden (Caused, Alive) Numerous counts of zombies and possibly unnamed people",
        "Appearances[]": "\" Faith \"",
        "References[]": "",
        "Name": "Roberts"
    }
]