[
    {
        "Overview[]": "Rodney generally seems to be a friendly person, but he is shown to have moments of foolishness. He, Gage , and Addy are all initially welcoming to Henry . However, Rodney immediately shows his juvenile behavior when he and Gage play with a walker they trapped, with Rodney peeing on it. Later, he and Gage make Lydia uncomfortable by lying to her that Addy has feelings for Henry, since Lydia herself has feelings for him. Most of his actions aren't done out of malicious intent and are more due to lack of maturity, as he is still young and growing up in the apocalypse. After being kidnapped by Alpha , Rodney is shown to be terrified and is protected by Tammy .",
        "Pre-Apocalypse[]": "Nothing is known about Rodney's life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "At some point in the apocalypse, Rodney joined a community called the Hilltop Colony . Upon noticing a solitary Henry eating away from the other residents, Rodney and his friends call him to talk with them. He jokingly asks if all the residents at Oceanside are women and shortly after, they invite him to hang with them in the woods. That night, Henry drinks with his new friends in a shed outside of Hilltop. Gage suggests they have some more fun and takes them to a covered hole in the ground with a walker inside. Addy leaves as they throw rope rings at it and Rodney pees on it. Henry jumps in and mercy kills the walker. Gage is pissed at Henry for being a buzzkill and leaves him there. Rodney is part of Tara 's group in charge of clearing a tree from their path to the Kingdom to ensure the roads are cleared for Alden 's convoy carrying the food and trade goods for the fair. Upon finding a downed tree, Rodney remains alert and checks the surrounding area. He keeps on watch as the others help chop the tree into pieces to clear the road. Later that day, a small herd of walkers approaches the group. They get in position and remind themselves to watch for the Whisperers . Suddenly, the Highwaymen ride up on horses and introduce themselves to Tara after helping to take down the herd. They then escort them to the Kingdom, having accepted Carol 's deal. Upon arriving at the Kingdom, Rodney excitedly looks around with Gage and Addy. Rodney watches from the crowd as Ezekiel declares they've finally accomplished Rick , Carl , and Jesus ' dreams of reuniting the communities. “Let the fair of a new beginning begin!” Ezekiel says as everyone celebrates and applauds. When Addy talks with Henry nearby, Rodney and Gage introduce themselves to Lydia and tell her that Addy has a thing for Henry, making her uncomfortable. However, she throws goat feces at them as payback. At some point later that day, Rodney is somehow among the residents kidnapped by Alpha and taken away to a barn in the woods where they are about to be attacked by the Whisperers but are found by Ozzy , Alek , and D.J. , giving the group a chance to fight back. During the fight, a scared Rodney is protected by Tammy. In the middle of the chaos, Alpha arrives and the group is subdued. She then decapitates everyone as Siddiq is forced to watch, only leaving him alive as a witness. Rodney's decapitated head is later put by Alpha on one of the several pikes used for the Whisperers' border. The next day, Daryl , Michonne , Carol, Siddiq, and Yumiko find the border and watch in horror at the victims, a reanimated Rodney being among them. They then put down their zombified heads to properly rest. When the group returns to the Kingdom, Siddiq delivers the tragic news and narrates how Rodney and the others fought together as a family in their last moments. He finishes the story by encouraging everyone to remember the fallen as brave heroes and to honor them.",
        "Death[]": "Killed By Alpha (Alive) In order to mark a border between the land belonging to the Whisperers and the communities, Alpha disguises herself and infiltrates the fair to kidnap several residents. Afterward, she decapitates them and then places their heads on wooden pikes to mark the border, with Rodney being among them. Daryl Dixon , Carol Peletier , Michonne Grimes , or Yumiko Okumura (Zombified) After finding the border, his zombified head is put down by either Daryl, Carol, Michonne, or Yumiko.",
        "Killed Victims[]": "This list shows the victims Rodney has killed: Numerous counts of zombies",
        "Appearances[]": "\" Evolution \" \" Chokepoint \" (No Lines) \" The Calm Before \" \" A New Deal \" (Archive Footage)",
        "Trivia[]": "Rodney is the only pike victim who did not kill a member of the Whisperers , whether that be direct, caused, or assumed. Rodney's death is referenced in \" Silence the Whisperers \" when Margo pressures Gage to attack Lydia. A zombified Rodney appears alongside Andrea Harrison , Milton Mamet , and Gareth in a commercial created by Ryan Reynolds, advertising products such as DoorDash, Autodesk, Ring, and Deloitte. Rodney appears in the archival footage shown at the beginning of \" A New Deal \" as Judith narrates past events of the show to the audience before the episode's story begins. The two children who witness Gregory's hanging in \" A New Beginning \" strongly resemble younger versions of Rodney and Adeline . Whether or not this is them has yet to be confirmed.",
        "Name": "Rodney"
    }
]