[
    {
        "Pre-Apocalypse[]": "Nothing is known about Rose's life prior to or as the outbreak began. It's possible she lived in the Mid-Atlantic states within the United States.",
        "Post-Apocalypse[]": "Sometime in the early days of the outbreak, Rose took shelter in an abandoned warehouse within or near Baltimore. Rose is among the survivors inside a shelter, alongside Dee and her family. She and several survivors listen to an emergency broadcast over the radio, as a nearby pillar reads \"23 days\", indicating how long they've been in the shelter. Nine days later, Rose listens to another emergency broadcast alongside Amanda , Lamar , Frank , Cyrus , and Matias , and discusses about venturing outside to gather supplies. Rose expresses that she thinks they should stay, and remains behind in the shelter with Matias as she watches Cyrus, Amanda, and Lamar leave. Eleven days later, on the 43rd day in the shelter, the chaos outside begins to envelop the outside of the shelter. Shouting and gunfire can be heard in the streets outside, prompting Matias to have a panic attack as Rose attempts to calm him down. Dee, knowing noise could draw them in, suffocates Matias to death, citing that he was too weak to survive this world anyway. Rose is horrified but does not say anything upon Matias' death. A short time later, Rose quietly discusses with Dee, Frank, and the other survivors on what to do with Matias' body. Rose speaks up and suggests waiting until the morning before they dispose of his body outside. Later that night, Rose is asleep in her cot and unaware to the truth about the virus infecting the living, when a reanimated Matias begins to attack the shelter survivors. In the middle of the chaos, Rose is among those killed.",
        "Death[]": "Killed By Dee (Indirectly Caused) Matias (Caused or Direct, Infected) After Matias is suffocated by Dee, he reanimates and attacks the refugees in the shelter. In the middle of the chaos, Rose is either killed by the undead Matias or another reanimated survivor.",
        "Killed Victims[]": "This list shows the victims Rose has killed: Possibly a few zombies",
        "Appearances[]": "\" Omega \" (Flashback)",
        "Trivia[]": "",
        "Name": "Rose"
    }
]