[
    {
        "Pre-Apocalypse[]": "Nothing is known about Ross' life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "In a flashback four months prior, Ross was camping in the woods with a group of survivors when they rescued a man named Dante from walkers. Sometime later, the group is encountered by the Alexandrians and are recruited to join the community. Ross helps clean up the mess left behind by the Whisperers in Alexandria. Ross helps clean up the damage in Alexandria left behind the Whisperers' invasion. Ross helps clean up the mess left behind by the Whisperers in Alexandria, later helps others repair a section of the wall. Ross, Daryl, Rosita, and a team of Commonwealth troopers storm Tyler Davis' apartment in search of rebels. Rosita finds a secret room in the back of a closet filled with propaganda from the resistance. Ross is seen in the Commonwealth station. He is assigned with Douglas to Sector A by Colonel Vickers . Ross is at his desk at the police station when Mercer arrives to speak with Juanita in his office. Later, he witnesses Eugene surrender himself for the death of Sebastian Milton. Ross joins Mercer, Rose, and the rest of his troopers as they enter into a standoff with Vickers and her men. Pamela orders for their arrest, right before the the Coalition arrives. Vickers relents after realizing that Daryl is right that they're all on the same side. Vickers defers to Mercer who places Pamela under arrest for high crimes against the Commonwealth. He then helps with the plan to clear the large herd of walkers.",
        "Killed Victims[]": "This list shows the victims Ross has killed: Numerous counts of zombies",
        "Appearances[]": "\" The World Before \" (No Lines) \" Diverged \" (No Lines) \" Acheron: Part I \" (No Lines) \" Hunted \" (No Lines) \" New Haunts \" (No Lines) \" The Rotten Core \" (No Lines) \" Variant \" (No Lines) \" Rest in Peace \" (No Lines)",
        "Trivia[]": "Marcus Tyler Estes also portrayed two separate Whisperers in Season 10, including a Whisperer killed by Alpha. This character's name was revealed by Colonel Vickers in \" The Rotten Core \". Ross is the only known member of his original group confirmed to have survived the events of the TV Series.",
        "Name": "Ross"
    }
]