[
    {
        "Roy": "",
        "Overview[]": "Roy is an aggressive, brutal, petty, and loyal Savior . He has no qualms with murder, such as going along with beating a worker to death. Like many of his cohorts, he is extremely rude and condescending when dealing with the communities under the Saviors' control, such as his interaction with Enid . He is extremely loyal to his leader, Negan , to the point of being willing to die for him. After Sasha reanimates comes out of the coffin and tackles Negan, Roy saves his leader by getting Sasha off him, but is bitten in the process.",
        "Pre-Apocalypse[]": "Nothing is known about Roy's life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "At some point in the apocalypse, Roy somehow came into contact with a group named the \" Saviors \" which he subsequently joined. Roy aided his group in terrorizing other survivors and communities around the area into subjugating to Negan Smith 's will, where their victims would be forced to give half their supplies in exchange for not being murdered. Roy is at the marketplace and steps in during a confrontation between a worker and a vendor. He and his fellow Saviors then proceed to beat the worker to death after he gets violent. Roy accompanies Simon and numerous other Saviors to the Hilltop to get Dr. Harlan Carson since their own doctor, Emmett Carson , was killed by Negan. Roy attempts to enter the cellar where Daryl and Maggie are hiding, but is distracted by Enid who asks him if he can take a bucket of vegetables to the Saviors’ truck. He refuses and demands that she does it herself, and proceeds to enter the cellar to take more supplies, but he fails to notice Daryl and Maggie and so leaves the cellar. He then leaves the Hilltop with his fellow Saviors. Roy is among the Saviors traveling with Negan to Alexandria . When they come across the fallen trees in the road, he uses a chainsaw to help remove the branches. Upon arriving at Alexandria, Roy pulls the undead Sasha from Negan after he opens the coffin, resulting in Sasha biting into his face, killing him.",
        "Death[]": "Killed By Eugene Porter (Indirectly Caused) Himself (Indirectly Caused) Sasha Williams (Infected) As Roy pulls a zombified Sasha off of Negan, she rips off part of Roy's face, killing him. It is unknown if he was put down following the battle or reanimated thereafter.",
        "Killed Victims[]": "This list shows the victims Roy has killed: Red Haired Savior (Alive, alongside his fellow Saviors) Himself (Indirectly Caused) Possibly numerous counts of zombies and unnamed people",
        "Appearances[]": "\" The Cell \" (No Lines) \" The Other Side \" \" The First Day of the Rest of Your Life \" (No Lines)",
        "Trivia[]": "Roy was not credited for his appearance in \" The Cell \". Roy is the only person in Season 7 who was killed by a walker . He is one of two Saviors named Roy. Similar to Fat Joey and Skinny Joey , the other Roy is called Little Roy. Roy is the last named character to be killed by Sasha Williams in the TV Series ."
    }
]