[
    {
        "Roy": "",
        "Overview[]": "Roy is a helpful and honorable individual. However, he is also shown to be somewhat cowardly, abandoning the group in the subway tunnel and taking their supplies. He later expresses remorse for this act and after being severely wounded refuses to let Daryl patch him up. Even after being a badly hurt, he continues to persevere with the group before meeting his end to the Reapers .",
        "Pre-Apocalypse[]": "Nothing is known about Roy's life prior to or as the outbreak began aside that he may have had kids before the apocalypse.",
        "Post-Apocalypse[]": "At some point following Rick Grimes ' disappearance , Roy joined a community called the Hilltop Colony . As Michonne , D.J. , Siddiq , and Magna's group approach the Hilltop, Roy and another messenger arrive on horseback to meet with the caravan. Michonne questions their spears and if they are from Hilltop. Roy replies that they are and reports that Rosita Espinosa of Alexandria has been found injured in the woods and is being taken care of by Enid . After the meeting, the two messengers continue to Alexandria to deliver the news. Roy is seen walking with his fellow guard through Alexandria as Gabriel asks Barbara who they are. The Hilltop Colony was attacked by the Whisperers with their weaponized horde and flaming arrows, the latter of which caused the fire that quickly engulfed the settlement. Although unseen, Roy is one of the several survivors to escape Hilltop alive. Roy is part of a group consisting of Daryl, Elijah, Maggie, Carol, Alden, Rosita, Lydia, Jerry, Gage, Kelly, and Magna who raid the abandoned Fort Connors military base for food supplies. He remains on watch on the roof as the women make their way into a hangar by rope to collect supplies. When walkers attack the women, Roy joins the others as an archer to protect the women. After the mission, Roy returns to Alexandria with his fellow survivors. Roy joins the mission to salvage food and water from Meridian to feed the large population in Alexandria. Part of a group consisting of Maggie, Daryl, Alden, Cole, Elijah, Gage, Negan, Frost, Duncan, Agatha, and Gabriel, the survivors utilize Negan's familiarity with the DC area to travel to Meridian. Due to the heavy rainstorm , the survivors are forced to head into the subway tunnels to complete the journey. While in the tunnels, they come across hundreds of body bags, many containing walkers in them. At some point while dispatching the body bag walkers, Roy and Gage go missing, along with the group's ammo and supplies. Shortly after this realization, a large group of walkers appear, forcing the other survivors to move forward in the tunnel without being able to search for Roy or Gage. Roy is spotted by Daryl in the tunnel stumbling away from walkers before collapsing. After Daryl kills the walkers, he approaches Roy. Roy explains he went outside in the storm and got hit with debris. He then states he lost Gage and the ammo bag before handing Daryl a grenade and a handgun. He requests Daryl to tell his children he did not die a coward. Eventually, Roy is patched up. Later, when the survivors head outside and witness hanging bodies, the group is ambushed by Reapers and Roy is shot in the head with an arrow, killing him. Roy's corpse lies in the street as the Reapers attack the rest of Roy's group. Roy's corpse is seen lying in the street as Daryl escapes from the Reapers' attack.",
        "Death[]": "Killed By The Reapers Roy was shot in the head with an arrow by a Reaper. It is unclear which Reaper shot Roy. However, due to the fact he was shot by arrow, it would have been either Nicholls , Bossie , Boone , Ira Washington , or Ancheta .",
        "Killed Victims[]": "This list shows the victims Roy has killed: Possibly some unnamed Whisperers Several unnamed U.S. Military soldiers (Zombified) Numerous counts of zombies",
        "Appearances[]": "",
        "Trivia[]": "This character is credited as Hilltop Rider in \" Stradivarius \". In Season 11, this character was given the name Roy . C. Thomas Howell is the real life friend of Michael Cudlitz and was given this role due to his ability to ride a horse at high speed and deliver lines all at once, without needing a stuntman to perform the stunts. One of the conditions C. Thomas Howell proposed that his character have the opportunity to be recurring. C. Thomas Howell was brought back two seasons later for four episode appearances and his character's death. This character was portrayed by photo double and stand-in actor William Michael deArmon in \" Evolution \" as C. Thomas Howell was not available for filming. Ironically, actor C. Thomas Howell played the assassin \"The Reaper\" on Criminal Minds and later on The Walking Dead , Roy is killed by a Reaper."
    }
]