[
    {
        "Rufus": "",
        "Fate": "",
        "Contents": "",
        "Overview": "Rufus is a loyal member of the Whisperers , however he comes to find his loyalties to Beta are misplaced. When he, Beta, and another Whisperer find Alpha 's reanimated head, Rufus makes the mistake of declaring Beta as the new Alpha. Beta tells Rufus to take off his mask, and he is shown to be visibly scared. Beta pushes Rufus closer to Alpha and eventually gets his ear bitten off. Despite causing his inevitable death, Rufus sticks with Beta and doesn't seem to be fazed about dying. Beta then causes Rufus' death again by stabbing him and allowing him to be devoured by a walker.",
        "Pre-Apocalypse": "Nothing is known about Rufus' life prior to or as the outbreak began.",
        "Post-Apocalypse": "At some point following the outbreak, Rufus joined a large group of survivors known as the Whisperers . At the pike border, Rufus, Beta , and another Whisperer discover Alpha 's reanimated head. Rufus deduces that Negan killed her and notes that this makes Beta the \"Alpha\" now. Enraged by his remark, Beta claims that Alpha can still hear him, before commanding Rufus to take off his mask. After doing so, he is asked by Beta if he can hear Alpha and what she is saying to him. When Rufus fails to answer, Beta shoves him closer to Alpha. He continues doing so until Alpha bites him and the other Whisperer flees in terror. After finally relenting, Beta takes Alpha's head off the pike and takes her with him, along with the bitten Rufus. A short time later, Rufus and Beta are walking to an undisclosed location. Reeling from his infection, Rufus coughs, which attracts a nearby walker. Beta stands between Rufus and the walker in an attempt to shield his companion, but when the walker shows no signs of turning away, Rufus gets nervous and prepares to kill the undead assailant. Before he can, however, he is stabbed in the back by Beta, who then lets Rufus be devoured.",
        "Death": "Killed By Himself (Caused, Accidental) After seeing Alpha's head on a pike, Rufus claims that Beta is the new \"Alpha\" now, enraging him. Alpha (Infected, Caused) Beta (Caused) Zombies Beta forces Rufus' head closer to Alpha in order to \"hear her\", which leads to his ear being ripped off. Later, Rufus' infection causes him to cough, which attracts a nearby walker. As Rufus is about to kill the walker, Beta stabs him through the back with a knife and allows him to be devoured.",
        "Killed Victims": "This list shows the victims Rufus has killed: Alex (Alongside his fellow Whisperers) Brianna (Alongside his fellow Whisperers) Quan (Alongside his fellow Whisperers) Troy (Alive, alongside his fellow Whisperers) Himself (Caused, Accidental) 4 unnamed campers (Possibly, Caused or Direct) 2 horses (Possibly, Caused or Direct) Possibly some unnamed members of the Coalition Numerous counts of zombies and possibly unnamed people",
        "Relationships": "",
        "Appearances": "\" Look at the Flowers \"",
        "Trivia": "Rufus is Beta 's last named human kill. He is also Alpha 's last named human kill, albeit as a walker."
    }
]