[
    {
        "Russ": "",
        "Fate": "",
        "Contents": "",
        "Pre-Apocalypse[]": "Nothing is known about Russ' life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "At some point in the apocalypse, Russ joined a community called the Alexandria Safe Zone . Russ is among the militia to listen to the leaders' speeches before they launch their assault on the Sanctuary . After successfully ambushing the Saviors ' headquarters, he and the others leave in their vehicles so the incoming horde may swarm the factory. Russ is among the Alexandrians to ambush the Shepard office plaza outpost from their vehicles. As they continuously fire at the Saviors, they manage to kill off several Saviors in an effort to have them reanimate and overrun their comrades. As the militia returns to Alexandria, Russ and the other survivors disembark from the vehicles and proceed to walk down the street toward their homes to rest and debrief. As the Saviors arrive outside Alexandria, Russ is among the residents to evacuate into the sewers in time before the Saviors attack the community with grenades. Russ and the other Alexandrians travel through the woods towards the Hilltop. When they come upon a swamp, he and the rest of the group rest in the woods while Daryl , Scott , Rosita , and Siddiq clear the walker infested waters. Afterwards, Russ and the Alexandrians arrive at the Hilltop and are welcomed into the community with open arms. Russ is among the survivors to take refuge in the Barrington House during the Saviors' attack on the Hilltop. Having survived the assault, he sleeps with the other residents until victims of the tainted weapon attack reanimate and attack everyone. However, Russ is among the survivors to flee the house unharmed. Prior to the final battle, Russ is cleaning weapons and bullets with Scott at a picnic table at the Hilltop. He later accompanies Rick and the rest of the militia to fight the Saviors in the final battle. After most of the Saviors are wiped out due to Eugene 's faulty bullets, Russ and the others fight the surviving Saviors until they surrender. He then watches on as Negan is defeated and captured while Rick addresses the crowd, declaring peace among all communities. Afterwards, Russ returns to Alexandria to re-establish the previously destroyed community. In a flashback to one year after Rick's assumed death, Russ is murdered by Jocelyn and her group in the middle of the night while on patrol. The next morning, Scott discovers his corpse against the side of a building.",
        "Death[]": "Killed By Jocelyn's Group While on patrol in Alexandria during the night, Russ is killed by a member of Jocelyn's group.",
        "Killed Victims[]": "This list shows the victims Russ has killed: Dino (Alongside his fellow Militia members) Mara (Caused, alongside his fellow Militia members) Possibly numerous unnamed Saviors Possibly numerous counts of zombies",
        "Relationships[]": "",
        "Appearances[]": "",
        "Trivia[]": "While his name has not been mentioned in dialogue nor has the character been credited, the name Russ was given to the actor for the filming of \" Scars \". Despite this extra being killed off in \"Scars\", he reappears alive after the time skip in \" Guardians \". This is an error due to filming not occurring in plot chronological order due to the time skip. Russ appears in the archival footage shown at the beginning of \" Lockdown \" as Judith narrates past events of the show to the audience before the episode's story begins."
    }
]