[
    {
        "Sam": "Sam",
        "Overview[]": "Sam is an optimistic, kind, and trusting individual, a rarity during the apocalypse. He is shown to be inexperienced when dealing with walkers, as Ana has stated it takes about 5 or 6 bullets for them to take out a single walker. Strangely, he believes that the apocalypse brings out the best in people. He has stated that he used to be cynical about people before the apocalypse but now he loves them. This most likely is because he met Ana after the apocalypse and the two became lovers. Ana reveals Sam had saved her life. Wanting to join Rick 's community, Sam and Ana attempt to prove themselves by gathering supplies for them. Unfortunately Ana is killed and Sam goes missing. Later, Sam is found at Terminus and is visibly terrified. Sam meets a cruel fate, having his throat slit by a Terminus butcher .",
        "Pre-Apocalypse[]": "Nothing is known about Sam's life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "Sam survived the early stages of the apocalypse and eventually found himself as member of a group of survivors. There he met Ana and the two grew very close and eventually became lovers. Eventually their camp was overrun and the two escaped on their own. The two eventually took refuge in an abandoned house for shelter after Ana injured her leg. Sam and Ana encounter Rick Grimes , who kills a walker outside of a room in the house which they are trapped in. Rick and his companion Carol Peletier give Sam and Ana guns, and they all split up to find supplies. Rick gives Sam his watch so that he can return on time. Carol and Rick later find Ana's body being devoured by walkers , and Sam never returns. After not returning to Carol and Rick at the house, Sam made his way to Terminus , where he was captured (most likely after refusing to adapt to the cannibalistic lifestyle of Terminus) and held hostage in a container marked D with at least three other survivors. After being captured at Terminus himself, Rick is set at the pig trough and sees Sam at the end of the trough. Sam looks over at Rick and recognizes him from their previous encounter, shaking in fear as two Terminus lackeys walk over to him. Sam continues to stare in fear as one of the guards slams a baseball bat into his head, then the other slits his throat open, killing him instantly. Carol later finds Rick's watch, which was in Sam's possession until his arrival at Terminus, in a storage room for the victims' belongings.",
        "Death[]": "Killed By Gareth (Caused) Terminus Butcher 1 (Caused) Terminus Butcher 2 After being brought to the slaughterhouse, Sam is knocked out by a bat to the back of his head and then has his throat slashed open by a butcher.",
        "Killed Victims[]": "This list shows the victims Sam has killed: Possibly numerous counts of zombies",
        "Appearances[]": "\" Indifference \" \" No Sanctuary \" (No Lines)",
        "Trivia[]": "The casting call for this character used the name Jack . Sam was described as \"Early 20s. Easygoing and extremely thin. He is a bit of a prankster.\" His persona and character is similar to that of Novel Series character, Scott Moon . Sam is the first character to die in Season 5 .",
        "Name": "Sam"
    }
]