[
    {
        "Scott": "",
        "Contents": "",
        "Overview[]": "Scott is a brave, selfless, and caring man of few words, but voices his opinion when he wants to speak up. He initially starts as just another resident of Alexandria . He is among the few to help diverge the herd of walkers. He ends up accidentally being shot by Sturgess and tells the group to leave him behind since he'll slow them down. However, the group refuses and Scott manages to be one of the few to make it home safely. Scott goes on to become a soldier for the Militia . He participates in many of the battles with the Saviors , showing he is willing to put his life on the line for his community. Scott survives the war and even adopts Marcus , a child from the Saviors. Scott also becomes a member of the council and is one of the most reliable allies of the community.",
        "Pre-Apocalypse[]": "Nothing is known about Scott's life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "At some point during the outbreak Scott made his way toward the Alexandria Safe Zone where he settled into the community. Upon being interviewed, Scott was assigned as a supply runner where he met and befriended Heath and Annie where the three became a prominent supply team. After Heath 's team returns to Alexandria, and Heath persuades newcomer Eugene Porter to open the gate and let them in, Heath introduces Eugene to his team, including Scott. He later helps the other Alexandrians construct a wall to deter the zombie horde being led along the route. With the horde on the move, he goes with Annie , Barnes , Sturgess , Glenn Rhee , Nicholas , and Heath to keep zombies from straggling off the road. Scott is seen with Rick 's group to deal with the broken off quarry herd from the loud horn blaring from Alexandria. When Rick splits off with the group to get to the RV at the diversion point, the remaining members head back towards Alexandria but are ambushed by walkers. Scott and David fight off the walkers, and while doing so a panicked Sturgess accidentally shoots Scott in the leg. Scott is almost killed by the walkers until he is saved by the others. The remaining group heads towards a nearby town and take refuge in an abandoned pet store. Scott is tended by Heath and when the group hears gunshots from Alexandria, note that walkers in the town are going to Alexandria as a result. Scott and Annie pressure Heath and Michonne to leave them behind as they would slow them down, but they refuse and take the two with them. Scott watches Annie get devoured by walkers first and later David when they get climb over a fence. He is later seen being helped by Heath and Michonne across a stream and the three make their way back to Alexandria. Scott is recovering at the clinic as doctor Denise Cloyd figures out how to save his life. She is overwhelmed and declares that Scott is going to die. However, Tara is able to calm her down and encourage to go over the medical books once more to find a way to treat Scott. Denise is successful and is able to stabilize Scott and allow him to continue recovering. Scott remains hospitalized at the clinic as Denise continues to care for him. When Denise arrives at the infirmary, she asks about the condition of her patients, and Heath tells her that they took them upstairs, Scott included. Scott is present at the meeting in the church, listening to Rick's speech about the danger of the Saviors . When Rick asked if anyone objected to the idea of attacking the Saviors, Scott remained silent. Scott is on gate duty with Francine and allows Rick and the others in the RV leave to get Maggie Greene medical care at the Hilltop Colony . Scott is outside near the front gate with Bruce and Anna watching the Saviors enter Alexandria. Later, Scott is among the townspeople present at the church when Rick informs them that he is no longer in charge and that all guns need to be turned over to the Saviors. Scott is among the townspeople to witness Spencer and Negan play pool and the former's death at the hands of Negan. After Rosita attempts to shoot Negan but hits Lucille instead, Scott is horrified as Arat guns down Olivia on his command to kill a resident. Scott accompanies Rick and his fellow Alexandrians to Oceanside where they set up explosives outside the walls and assume positions among the trees. After the residents are herded up by Scott and the others, he helps dispatch a herd of walkers drawn to the noise of the explosions and gunfire in Oceanside. Afterwards, he helps collect weapons from the armory and prepares to return to Alexandria. Scott is stationed at the front of Alexandria by the garbage trucks with fellow residents and several Scavengers. When the bombs fail to detonate, the Scavengers take everyone in Alexandria hostage. After Carl opens fire on several Scavengers, he joins the firefight, running through Alexandria shooting at the Scavengers alongside his fellow Alexandrians. He is seen again later when the Kingdom and Hilltop arrive in Alexandria and helps rescue the captured residents in the street. As the Saviors flee in their trucks, Scott runs and shoots at them towards the front gate. After the firefight, he is seen at Sasha 's funeral and listens on at the leaders' speech. Scott is present and listens to the speeches given by Ezekiel , Maggie, and Rick before their first attack. He travels with Rick and everyone to the Sanctuary to attack Negan and the Saviors. He is later seen with Rick and other members of Alexandria after the assault, regrouping. Scott is among the group of Alexandrians to ambush a Savior outpost from their vehicles. When Scott raises his concern about the Saviors spreading out, Aaron reiterates that the plan is to keep them penned in. As they continuously fire at the Saviors, they manage to kill off several Saviors in an effort to have them reanimate and overrun their comrades. Scott continues to assault the outpost with the other Alexandrians. At one point, he and Tobin realize that the Saviors are retreating into the outpost and try to continue firing on the Saviors, but are continuously shot at. After the battle is over, he helps prevent reanimation of the deceased Saviors and Alexandrians. He also helps move the dead Alexandrians and cover them with sheets as they await transport back to Alexandria. As a distraught Aaron attempts to go after his zombified boyfriend, he tells him it's too late and they must keep moving to avoid the herd. Scott returns to Alexandria with the others after their successful ambush on the Savior outpost set up at the Shephard Office Plaza . He and another resident remove and carry the body of one of the killed Alexandrians from the back of a truck. At one of the gates to Alexandria, Scott is among Tobin, Daryl , Bruce, and several other residents packing cars with weapons and supplies as members of the militia prepare for their assault on the Sanctuary. That night, Scott is outside in the street with Tobin, Daryl, Rosita , Tara, and Bruce as Negan and a group of armed Saviors arrive at one of Alexandria's gates. Scott, Tobin, and Bruce, are instructed by Carl to get to the infirmary and help evacuate the injured residents to the sewers. Later, Scott is seen safe in the sewers with the surviving Alexandrians. Scott remains in the sewers with the other Alexandrians as the Saviors' grenades continue to blow apart Alexandria above them. After the explosions subside and the remaining Saviors leave, Scott and the others prepare to head to the Hilltop for refuge. Scott and the other Alexandrians evacuate through the woods towards the Hilltop. He sits near Tobin, Bruce, Barbara , and Judith as Dwight suggests the group cut through the swamp to the Hilltop. He volunteers to help clear the swamp of of zombies with Daryl, Rosita, and Siddiq . He successfully arrives at the Hilltop with the Alexandrians and is welcomed into the community with open arms. He hangs with Daryl, Bruce, and Judith by some vehicles as they rest from their journey. Later, Scott, along with Jerry , Dianne , and Oscar , accompanies Maggie to the makeshift prison and listens on as Maggie declares the Saviors will be let out for a few minutes a day in pairs and under close watch of the guards. Scott is among the lookouts who blares their horns to signal to the Hilltop that the Saviors are en route to the town. He, along with Rick, Daryl, Jesus, and Bertie, arrives at the Hilltop during the battle to provide cover fire as they enter through the gates. He and the others manage to survive the attack as the remaining Saviors flee. He also survives the subsequent outbreak that killed several more people. As Ezekiel and Jerry discuss the impending battle, Scott and Russ are at the picnic table behind them, cleaning their weapons. A short time later, Scott accompanies Rick and the rest of the militia to fight the Saviors in the final battle. After most of the Saviors are wiped out due to Eugene’s faulty bullets, Scott and the others fight the surviving Saviors until they surrender. He watches on as Negan is defeated and captured while Rick addresses the crowd, declaring peace among all communities. Afterwards, Scott returns home to Alexandria. As Rick and Michonne read a book to Judith, Scott is seen running down the street towards them. He reveals to Rick and Michonne that Justin was found dead by Maggie and they don't believe it was an accident. As Michonne spends time with Judith, Scott comes to her house to inform her that Maggie has arrived in Alexandria. In a flashback, Scott and Rosita return to Alexandria with survivors they found out in the wild, including Mitchell , Winnie , and Jocelyn . In the present, Scott and D.J. are riding horses in Alexandria as they approach Aaron while Michonne watches from afar at the infirmary. He informs Aaron his finding regarding checking Daryl's tracks in the wilderness to see if anyone else was following his group. In a flashback, Scott enjoys a bonfire with the other Alexandrians and the children in Jocelyn's group. The next morning, he, along with Frankie , Michonne , and Jonah 's par ents , head over to the house where Jocelyn's group was staying to pick up their kids from a sleepover. After finding the house empty and the kids missing, he frantically calls out his son's name, to which gets no answer. He and the other parents frantically search Alexandria. He checks the pantry and finds it ransacked and informs Michonne of what he found just as they find Russ murdered by the pantry. In the present, Scott opens the gates as Daryl and the others depart Alexandria at night. In a flashback, Scott watches as Michonne and Daryl return to Alexandria with the kids. He immediately runs towards them to hug his son . Scott is among the Alexandrian convoy to visit the Hilltop to help out the community after a tree has fallen down. On the way, Michonne spots Ezekiel riding on his own and tells Scott and the group to continue while she investigates. Later that day, the group catches up and they continue their travel to Hilltop. That night, Scott and the convoy arrive to help the Hilltop residents fight off the invading walkers. The following morning, Scott attends the council meeting where Michonne announces she will be delivering supplies to Oceanside after receiving reports of potential Whisperer activity. Later that day, Scott and a group prepare their convoy and head out on their journey towards Oceanside. Scott and the group continue their journey towards Oceanside when they stop briefly after he comes across recent footprints on their path. He comments to Michonne that he doesn't believe they are from a walker or Whisperer since they are clean and not dragging. When the group stops at a library along the way, he heads inside to help look for anything worth taking with them. Upon being told by Luke that a stranger saved him, Scott runs outside to find the man to no avail. Later that day, the group arrives at Oceanside where Scott witnesses as the residents bring the man that saved Luke to the camp and accuse him of being a Whisperer. When walkers suddenly invade, he helps take out the threat and secure the community. The next day, Scott assures Michonne that he will inform the Council about her mission to bring back weapons in exchange for helping Virgil get back home. He also promises to look after Judith and then bids her farewell before he and the rest of the group travel back to their communities. Scott is at the meeting hall with Gabriel, Rosita, and Laura discussing a possible plan and listens to Mary sharing everything she knows about the cave and its entrances. When Gabriel proposes to Scott and Laura that they send two rescue teams, Rosita says she doubts the authenticity of Mary's words. Scott tells Gabriel if he is confident Mary is telling the truth, he believes her and in the plan. He then listens as Gabriel encourages his fellow Alexandrians to not be afraid of the Whisperers since they are cowards putting on an act. Sometime later that day, Scott listens as Echo Post informs Alexandria of an incoming hundred-walker herd and wonders why would the Whisperers send forces to the gates. While starting to draft people for the scout team, Gabriel changes the plan at the last minute and chooses Scott to be part of his team on the recon mission. That night, the scout team finds the two militia at Echo Post murdered and realizes the Whisperers forced them to give false information about the herd so they would leave Alexandria and weaken the inner defense. They immediately rush back to the community. On their way back to the town, they ambush Beta escorting a captured Mary and Scott watches as Beta flees into the woods and as Mary tries to convince them she hasn't betrayed Alexandria. The following morning, Scott reports to Gabriel that Beta had infiltrated Alexandria through Cheryl's grave, which was connected to a tunnel system. He then hugs Aaron when he arrives and listens when he tells them not everyone escaped from the cave. As the Whisperers and their horde surround the hospital, Scott and the others quickly get ready to defend the hospital. He is among the archers stationed at the windows to help shoot Whisperers going after the group of survivors with the music wagon equipment. After the Whisperers breach the hospital, he helps Gabriel, Dianne, and Rachel defend until it is time to evacuate, in which he is able to escape via the elevator shaft. He is among the survivors to escape the hospital in time and make it to the rendezvous point in the woods, where he helps tend to the wounded survivors. As a group of residents discuss the current situation in Alexandria regarding the storm and the undead wandering the streets, Carol mentions that Scott and several others are by the cul-de-sac checking for any other breaches in the wall. Many months later, Scott has not been seen. It is possible he is still living in Alexandria or moved to the Commonwealth after Milton's regime.",
        "Killed Victims[]": "This list shows the victims Scott has killed: Dino (Alongside his fellow Militia members) Mara (Caused; Before Reanimation or Zombified, alongside his fellow Militia members) At least 1 unnamed Savior (Before Reanimation) 1 unnamed Scavenger At least 1 unnamed Whisperer (alongside Coalition Archers) Numerous counts of zombies",
        "Relationships[]": "",
        "Appearances[]": "",
        "Gallery[]": "For more images of Scott, please visit Scott (TV Series)/Gallery .",
        "Trivia[]": "Showrunner Scott Gimple revealed during an unaired bonus scene of the pre-Season 6 Talking Dead special that Kenric Green has signed on to play Scott , a character from the comics. [1] Scott is one of the guards on rotation that watches over Negan in prison, according to Nora in \" The Obliged \". Scott is the second supporting character to outlive his comic book counterpart, with the first being Ed Peletier , the third being Tobin , the fourth being Kal , the fifth being Bruce , the sixth being Luke Abrams . Scott appears in the archival footage shown at the beginning of \" Lockdown \" and \" Variant \" as Judith narrates past events of the show to the audience before the episode's story begins. Scott appears in the final flashbacks of the last episode \" Rest in Peace \".",
        "References[]": ""
    }
]