[
    {
        "Sean": "",
        "Fate": "",
        "Contents": "",
        "Overview[]": "Sean is a brutal and aggressive individual, shooting at Rick , Hershel , and Glenn after he finds out his allies Dave and Tony are dead. Though initially, Sean seems to want to leave, Nate beckons them to fight and get revenge on Rick's group. Later, Sean is seen shooting at Hershel and Glenn but misses. He ends up being shot by Hershel and lays in agony. Despite having just tried to kill him, Hershel attempts to save Sean by shooting the walkers getting him, but he's too late. Sean meets a cruel death, being devoured by walkers.",
        "Pre-Apocalypse[]": "Nothing is known about Sean's life prior to or as the outbreak began, except that he had a brother named Willie .",
        "Post-Apocalypse[]": "At some point following the outbreak, Sean encountered a group of about 30 survivors known as \" The Living \" and became a member afterwards. Sean assisted the group in various missions such as scavenging, scouting, and as well protecting the group. After the rest of Dave and Tony's gang (Randall, Nate, and Sean) had heard gunshots, Sean and his party arrived to the town and start investigate. As Sean and Randall were searching the buildings and killed some walkers, they found a car that belongs to Dave and Tony but they're nowhere to be find. Once Sean and his party realized they weren't alone, they asked the survivors inside the bar if they have seen their friends. Rick Grimes answers that they're both dead, which causes a shoot-out to erupt between the two groups. Outside, when Glenn Rhee attempts to head to the car, Sean tries to kill both Glenn and Hershel Greene , but Hershel was able to open fire first, and Sean is hit in the lower body. After several minutes of moaning in agony and calling for help on the ground, Sean is ultimately eaten by the advancing Walkers. Hershel attempted to save Sean by shooting the nearest walkers despite his actions of attempting to kill them at first, but more arrived and ultimately overran him.",
        "Death[]": "Killed By Hershel Greene (Caused) Zombies After Hershel shoots Sean in the lower chest, he falls to the ground in extreme agony, before being torn apart and devoured by walkers.",
        "Killed Victims[]": "This list shows the victims Sean has killed: Numerous counts of zombies and possibly unnamed people",
        "Relationships[]": "",
        "Appearances[]": "\" Triggerfinger \"",
        "Trivia[]": "In the Social Game , he has a brother named Willie . Sean is the only named character whose death was caused by Hershel Greene in the TV Series ."
    }
]