[
    {
        "Sebastian Milton": "",
        "Fate": "",
        "Contents": "",
        "Overview[]": "Sebastian conveys many of the same personal traits of a typical spoiled brat. He is self-absorbed, rude, quick to anger, arbitrary, judgmental, ungrateful, overconfident and self-righteous. He displays several sociopathic tendencies, including a seeming inability to empathize with anyone besides himself, an aggressive, if not compulsive need to control and belittle others, impulsive and rash decision making, and lying for his own benefit. Due to living safely within the walls of the Commonwealth , along with his spoiled nature, Sebastian is very incompetent when it comes to surviving in the apocalypse. He's egotistical and self-absorbed, to the point where he'll even get angry at someone for saving his life. In his introduction, Sebastian has to be saved by Eugene and \" Stephanie \" from walkers due to him being too distracted making out with his girlfriend and rather than thanking them, he instead berates them for disrupting their date, all of which leads to Eugene being arrested after he punches Sebastian in the face, making him out to be the bad guy. Later, during his \"advanced military training,\" he has no respect for what he is provided, playing around with the weapons like their toys and throwing a sword away that isn't good enough for him. Though he is able to take out one walker, he misses the brain when stabbing the second walker, and the incident with Eugene almost repeats again with Daryl after he saves him, causing him to go on another angry rant. Due to his high status, Sebastian manages to go mostly unpunished for his actions. Mercer even advises Daryl to get on Sebastian's good side so he can get an easier life, prompting Daryl to start sucking-up to Sebastian. Sebastian often abuses his power and is willing to use those of a lower status for his own personal gain and has no care for the lives of others. It is revealed that after Pamela had cut off his allowance, he sent 30-40 people who were in debt to a house swarming with walkers just so they could get him money, which led to all of them being killed, including April Martens . When he finally gets his money, he arrogantly congrats everyone and himself for getting it, despite him not contributing at all and seems to show no remorse for his actions. However, eventually after his crimes are exposed in an article written by Connie , the people of the Commonwealth take to the streets and protest for him to be punished in order to finally getting comeuppance after getting away with his crimes for so long. It is implied that Sebastian is the way he is due to being spoiled and neglected his whole life by his mother. It appears his relationship with his mother is distant at best. Sebastian himself believes that Pamela cares more about the community rather than him. When Sebastian says that his allowance has been cutoff, he refers to his mother as a \"bitch\" . At one point, a drunken Sebastian reveals that he is trying to get ahold of his mother but is getting no response. Despite his apparently disdain for his mother, he does seem to genuinely love her and actually longs for her affection. While Sebastian is in the middle of one of his spoiled rants, insulting Daryl for saving him, when he notices Pamela watching from a distance, he immediately stops and his facade fades. When he and Pamela reunite after Sebastian's crimes are exposed, the two embrace each other and are happy to see they are okay, though this is immediately followed by Pamela slapping him in the face. While alone with Max , Sebastian reveals his true entitled and cynical view of life in the Commonwealth and that his deceased older brother was actually supposed to be his mother's heir, not Sebastian. However, Max suggests that Sebastian just chooses to be a spoiled asshole because if everyone else expects it, who's left to disappoint. Max's words appear to have an impact on Sebastian who discards his pre-written speech, and he publicly acknowledges that the people don't like or trust him and he probably deserves that, but he wants to earn their trust and live up to his legacy, seeming to show some genuine remorse for his actions. However, this may have simply been just a political maneuver on Sebastian's part by feigning remorse and going off-script in order to gain the trust of the people that he's supposed to one day lead, a tactic that's at first successful until Max and Eugene expose him for what he really is. After Max and Eugene expose Sebastian's views on the people of the Commonwealth to its people, Sebastian reverts back into his usual personality and chases after Max for revenge . Sebastian goes so far as to shove Max into the arms of a zombie and gleefully watch as it tries to devour her. However, this proves to be his downfall as Eugene shoves the zombie off of his girlfriend to save her life and it lands on Sebastian who begs for help. Despite being surrounded by a crowd of people, nobody lifts a finger to help Sebastian due to their hatred of him for Sebastian's treatment of the people of the Commonwealth and their loved ones.",
        "Pre-Apocalypse[]": "Nothing is known about Sebastian's life prior to or as the outbreak began except that he came from a political dynasty family, similar to the Kennedy family and the Bush family , with his grandfather serving as President of the United States at some point in time.",
        "Post-Apocalypse[]": "At some point during the outbreak, Sebastian began living along with his mother in the community in Ohio that she and his grandfather presumably founded. Sebastian is first seen with his girlfriend Kayla being escorted by Mercer through the area Eugene 's group is clearing of walkers. He comments on the 'putrid' smell of the area, looking at the workers. Later, as Eugene and Stephanie are moving on to the next area to clear, they notice several walkers approaching a distracted Sebastian and Kayla. After the two defend the couple from the walkers, Sebastian yells at Eugene for 'ruining their date', causing the two to argue. When Stephanie accidentally splatters Kayla with blood while defending her from another walker, causing her to scream in horror, Sebastian becomes more aggravated with the two, provoking Eugene into punching him in the nose. Mercer, Lance Hornsby , and a group of Commonwealth soldiers quickly arrive at the scene. Sebastian claims Eugene \"attacked\" them, and berates Mercer for being absent during the situation as the soldiers take Eugene into custody. Sebastian is seen undertaking \"advanced military training\" alongside Mercer, with Daryl and Rosita brought along by the Commonwealth General to assist. The two soldiers-in-training are bothered when they find their weapons, many of which hold great sentimental value, have been brought along for Sebastian to use, without their permission. Mercer explains that this is because Sebastian always receives the newest weapons for his training, due to his status as the Governor's son. As Sebastian examines and tests out the weaponry in various disrespectful and juvenile ways, including calling Judith 's katana a \"toothpick\" and throwing it aside, he selects his equipment and orders them to let walkers out of a nearby container for him to kill. Sebastian manages to take out the first walker with relative ease, but fails to properly drive a knife into the second one's skull, resulting in a struggle with the still-active target. After several seconds of watching, Daryl grabs his crossbow and shoots the walker in the head, much to Sebastian's anger. He then complains to Mercer, beginning to insult Daryl, until he notices Pamela watching him disapprovingly before moving on with her armed escort. Sebastian's smug façade fades, and he walks off to join his mother without another word. Later, at the formal Halloween cocktail party back in the walls of the Commonwealth, Sebastian arrives as a guest of honor. As Daryl and Rosita watch him silently from behind the velvet ropes leading into the event, Sebastian stops and sardonically fixes Daryl's collar, giving him what Rosita describes as a \"hate smile.\" As the festivities progress, the party is interrupted when Tyler Davis begins accosting Pamela's leadership, declaring that the Commonwealth elites do not actually care for the welfare of its citizens. Sebastian watches in silence as Tyler supports this claim by telling the room he tried endlessly to talk with Pamela one on one, only to be routinely ignored, and that he lost his job as a trooper and place of residence after making one \"mistake\": being overpowered and beaten by a prisoner . After Tyler manages to escape the party, Sebastian furiously orders Mercer to go after him. Later on, after Daryl manages to find Tyler in the now-empty Halloween fair's haunted house, convince him not to kill himself, and apprehend him, Sebastian shows up, Sebastian walks in, sarcastically Daryl for having captured him. Daryl, however, hands Tyler over to Sebastian, and bitterly tells him that 'he' did it himself, and follows the two back to the party. Upon arrival, Sebastian is applauded for his apparent arrest of Tyler, and is congratulated by his mother. Sebastian watches as Tyler is taken away and declares that there are thousands like him who want fair and reasonable treatment amongst the Commonwealth's workforce. Sebastian stops by the trooper station with Kayla. Sebastian brags to troopers about fighting walkers and invites Daryl to comment on his abilities. Daryl half-heartedly claps, eliciting chuckles from troopers. Alves and Castle take Daryl and Rosita to the northern perimeter. Sebastian joins them and orders Daryl and Rosita to retrieve a stash of cash hidden in a house on the other side of the herd. He says he needs money because Pamela cut off his line of credit. He can't send in Alves and Castle because the military tracks when rounds are fired. If the troopers use their guns, it will raise questions. When Daryl refuses and begins to leave, Sebastian threatens their kids. Daryl draws his knife and holds it to Sebastian's throat. Alves and Crowe pull their guns as Daryl warns Sebastian not to threaten the kids again, or he will cut him down. Sebastian states he never said anything about hurting the kids, but that he can make them both orphans if Daryl and Rosita don't accept the job. Daryl and Rosita begrudgingly agree to help. Daryl's group meets up with Alves and Castle and learns that Sebastian has already sent 30 or 40 people to look for the cash. Mercer shoots Alves and Castle dead, then instructs Rosita and Daryl to give the cash to Sebastian or else he'll come after them, as they can't win a fight against him. Daryl and Rosita deliver the cash to Sebastian at the trooper station. Sebastian praises them for their effort and asks what happened to Alves and Castle. Mercer nonchalantly reveals that they didn't make it back alive. He brushes the news off, and gives each of them a small cut of the money before leaving. After Pamela leaves, Max looks through files to find evidence to expose Sebastian. Just then Sebastian enters the room and appears to be drunk. He asks Max if Pamela is mad at him because he's been asking for her but is getting no response. Max tells Sebastian she can get word to her for him, to which he gets angry saying it's bullshit. Sebastian tells Max that she doesn't stop working and knocks down the files she is holding. Both of them grab hold of it and after a few seconds, Sebastian lets go and leaves. With Sebastian's crimes having been exposed, he goes into hiding as a massive crowd of protestors calls for Sebastian to be punished . Carol and Negan manage to locate Sebastian passed out in a hidden room of Union Station with plates of food nearby and several bottles of alcohol . Carol wakes up Sebastian who reaches for a gun before Negan steps on his hand and takes the gun from Sebastian. Sebastian demands to know if Negan knows who he is, but the former leader of the Saviors is unimpressed. Carol orders Sebastian to get up and that they're taking him home to his mother . However, Sebastian refuses to go anywhere until this thing blows over, believing that Pamela doesn't care anyways. Carol insists that Pamela does as Sebastian's her kid, but Sebastian believes that he's just a prop while the Commonwealth is Pamela's kid. Amused, Negan tells Sebastian that he should rethink his options and that Negan has seen Carol pull off seemingly impossible things before, \"so if for whatever reason she is throwing you a life raft, well then I'd recommend you jump in that sucker and save yourself from drowning.\" After a moment, Sebastian asks if Carol really thinks that she can help. Outside, Carol and Negan lead Sebastian through the angry crowd, dressing him up in a hoodie to hide his face. However, one of the protestors recognizes Sebastian and yells to everyone else that Sebastian is there. As Negan intercepts the man, Carol hurries Sebastian away. As the protestors call for Sebastian's head, the Commonwealth Army disperses them with tear gas. The next day, Carol leads Sebastian to his mother's office where Pamela hugs her son and then slaps him, telling Sebastian that he has humiliated both her and himself. Sebastian angrily tells Carol that he shouldn't have come here, but Pamela pulls him back to face her and demands to know what he's had to do with all of this. Sebastian claims that the story is a lie and that people want someone to blame and he's an easy target. However, Pamela isn't buying her son's lies, telling him that she will need more than that to save him. Carol speaks up, telling Pamela that she thinks that they can help each other. Carol reveals that she works for Lance Hornsby who is out hunting for her friends under the Commonwealth's flag and Carol needs Pamela's help to stop him. Pamela doesn't know anything about this and doesn't see how it helps her, but Carol states that if Sebastian didn't do the things that he's accused of, someone did, implying that they pin Sebastian's crimes on Lance. Following Lance's arrest, Sebastian watches from a balcony as his mother pins Sebastian's crimes on Lance. Disgusted, Max stares at Sebastian as she stands next to Eugene . Listening to a recording of his grandfather , an annoyed Sebastian asks why he has to give a speech if the people are going to hear this. Stopping the recording, Pamela tells her son that there's certain things that Sebastian needs to do if he's ever going to lead the Commonwealth. Pamela has Max provide Sebastian with a copy of the speech that has been written for him, but Sebastian calls it crap, telling his mother that he doesn't need it and will lead because he's a Milton. Pamela angrily states that Sebastian has jeopardized enough with his stupidity and the people need to see that he has nothing to hide and be reminded that Sebastian is President Milton's grandson. Pamela demands that Sebastian show both the Commonwealth and her that he is, and Sebastian begrudgingly looks at the speech, promising his mother that he will. Pamela admits that politics wasn't her first choice either, but she believes that Sebastian was born to lead this place. Later, as Pamela prepares to leave her office, Sebastian complains that his speech makes him sound like a douchebag and is bullshit. Pouring them both a drink and secretly starting recording on the tape containing William's speech, Max asks if Sebastian is really going to do it, but Sebastian doesn't think that he has a choice. While Max thinks that they all have a choice, Sebastian states that they don't according to his mother. Sebastian admits that it should be his older brother, not him, but Sebastian is the only one who is still here. Max suggests that Sebastian could be more than that, but Sebastian just accuses Max of being his mother's lackey who is getting him to do whatever Pamela wants. Max reminds Sebastian that she doesn't just work for Pamela, but she's a citizen too. Max suggests that, rather than leadership being telling people Pamela's words, some truth might be the way to go which people respects. Sebastian gives Max his deeply cynical and entitled view of life in the Commonwealth which Max notes sounds like he believes it. However, Max suggests that Sebastian might just be choosing to be a spoiled asshole because \"if everyone else expects it, who's left to disappoint.\" Max leaves and Sebastian appears to consider her words. Alongside his mother, Sebastian attends the wrestling match and enjoys the spectacle. When one of the wrestlers is thrown out of the ring in front of Pamela and Sebastian, Sebastian laughs with delight in contrast to his shocked mother. After the match, Sebastian begins reading his speech, before suddenly stopping and starting to speak from, apparently, the heart. Sebastian acknowledges that he knows that the people don't like or trust him, and he probably deserves that, and it will take a very long road for Sebastian to earn their trust and live up to his legacy. Lacking the words to describe how much the Commonwealth means to him, Sebastian invites the Commonwealth to join him in listening to the wise words of President Milton, the founder of the Commonwealth. However, on Max's signal, Eugene instead plays on a loop Max's recording of Sebastian's cynical and entitled view of the Commonwealth and its people and his disgust for the poor. As the crowd turns on the Miltons, he becomes enraged, realizing what Max did. Sebastian furiously chases Max through the crowd, intent on getting revenge . Even as ten reanimated Commonwealth janitors attack the crowd, killing several people, Sebastian continues his chase of Max. Finally catching up to Max, Sebastian grabs her and calls Max a stupid bitch, stating that she's nothing. As one of the walkers approaches, Sebastian shoves Max into its arms and gleefully watches as the walker tries to devour Max. However, Eugene shoves the walker off of Max and it lands on Sebastian, knocking him to the ground. Struggling with the walker, Sebastian desperately begs for help from the surrounding crowd, but no one lifts a finger to help Sebastian and just watches his struggle. Sebastian eventually manages to throw the walker off of him, but it grabs him again from behind and bites into Sebastian's neck twice before the walker is finally put down by Judith Grimes . Choking on his own blood, Sebastian dies moments later as his speech continues to play in the background on a loop. Sebastian's corpse is strapped to a table in the Commonwealth morgue and, reaching for one of his blades, Mercer suggests that they should put him down. However, Pamela refuses, ordering that no one is to touch Sebastian until she says so. Addressing her son's corpse, Pamela tells Sebastian that she wasn't blind to what he was and, that despite what he thought, she was trying to help him, but she may have been too late. While they had their issues, family is a complicated thing. Pamela orders Mercer to find and arrest Eugene , intending to put him on trial for Sebastian's murder and to have him stand as an example to all of the Commonwealth. Left alone with Sebastian, Pamela cleans up the blood on his face. Pamela knows that Sebastian always complained that she chose the Commonwealth over him, but there never really was a choice. Pamela doesn't know if she was ever capable of giving Sebastian what he needed, of controlling him. Crying, Pamela wonders what, after all of this struggle and sacrifice, they are left with now, but \"at least we don't have to disappoint each other anymore.\" Sebastian begins to reanimate and, composing herself, Pamela leaves the morgue, ordering a soldier outside to take care of Sebastian. Confronted by Pamela, Lance admits that he had Roman and Shira kill the Commonwealth janitors in order to get her attention, but Lance insists that he never intended for Sebastian to die. On Pamela's order, two Commonwealth soldiers lead a zombified Sebastian into the cell. Sebastian is led in on a leash with his hands chained to his waist. Sebastian is released from the leash and his leg shackles and growls at his mother who reminds Lance that he's at the family's disposal and, thanks to him, this is all that's left of it. Roman's corpse is dragged in and Lance is given a machete . Telling a horrified Lance that the body is still warm, Pamela orders him to \"feed my son, Lance,\" intending to have Lance cut up Roman's corpse and feed it to Sebastian. Pamela and the soldiers depart, leaving Lance alone with Sebastian and Roman's corpse. Eugene later turns himself in and confesses to his role in Sebastian's death. However, he claims sole responsibility for the recording that Max had made in order to protect her from punishment for her role in the events. Daryl and Carol break into the Commonwealth Jail in search of Lance in order to find their missing friends . In Lance's cell, they find the still bound zombified Sebastian laying in the middle of Roman 's dismembered remains and Lance in the corner muttering to himself about there always being a way out. Although shocked by the scene, Daryl draws one of his knives and stabs Sebastian in the head, putting him down. Later, Pamela is called to Lance's cell after his, Daryl and Carol's escape. Pamela discovers that, before he left, Lance smashed open Sebastian's head and left his lucky coin behind in Sebastian's spilled brains as a calling card for Pamela. During this time, Pamela prepares to prosecute Eugene for the murder of her son, blackmailing Yumiko into being the prosecutor in order to give the appearance of a fair trial . Instead, after learning of her friends' escape, Yumiko publicly announces that she will be acting as Eugene's defense attorney at trial and that Eugene has been wrongly and unjustly accused by Pamela and the Commonwealth. Pictures of a young Sebastian and his mother are on a table in Pamela's home in the Estates and are destroyed when the Estates are blown up to destroy a massive horde.",
        "Death[]": "Killed By Lance Hornsby (Caused) Roman Calhoun (Caused) Shira (Caused) On the orders of Lance, Roman and Shira kill ten Commonwealth janitors and leave them to reanimate. Maxxine Mercer (Indirectly Caused) Himself (Caused) Eugene Porter (Caused) Unnamed Commonwealth resident (Infected, Alive) While trying to save Max from a walker that Sebastian had pushed her into in an attempt to kill Max, Eugene shoves the walker onto Sebastian. The walker bites into his neck before being put down by Judith and Sebastian dies of the wound moments later. He later reanimates. Daryl Dixon (Zombified) After finding the undead Sebastian in Lance's cell, Daryl stabs him in the head, putting Sebastian down.",
        "Killed Victims[]": "This list shows the victims Sebastian has killed: April Martens (Caused) Alves (Indirectly Caused) Castle (Indirectly Caused) Himself (Caused) 30 to 40 unnamed Commonwealth residents (Caused) Numerous counts of zombies",
        "Relationships[]": "For a more in-depth look at Sebastian's relationships, read here; Sebastian Milton (TV Series)/Relationships",
        "Quotes[]": "The following is a list of some of Sebastian's most memorable quotes.",
        "Appearances[]": "",
        "Trivia[]": "Sebastian is one of nine characters to die, who does not die in the comics, with the other eight being Sophia Peletier , Mikey , Carl Grimes , Paul Rovia , Siddiq , Laura , Earl Sutton and Lance Hornsby . According to Angela Kang , Sebastian's death in the show and departure from the source material was \"slated to [happen] from the start.\" [1] Sebastian's death is ironic as in his first scene where he is saved by Eugene and \" Stephanie \" from walkers, he is ungrateful for the two of them helping him, while in his death scene no one comes to his aid as he begs for help with a walker that was ironically pushed onto him by Eugene after saving the real Stephanie . His death is also ironic in that he is a high status individual killed by a low status worker, along with his speech about the Commonwealth 's system being rigged against the poor and good for the rich playing in the background. On the Talking Dead \"In Memoriam\" for \" What's Been Lost \", Sebastian is credited as Walker Sebastian . In the Comic Series, Sebastian is arrested and put in jail for killing Rick Grimes . However, in the TV Show, this fate is instead given to his mother, Pamela , who is arrested for shooting Judith as well as high crimes against the people of the Commonwealth. Teo Rapp-Olsson stated that when portraying Sebastian, he looked to spoiled and arrogant characters for inspiration, such as Joffrey Baratheon from Game of Thrones and Patrick Bateman from American Psycho . Originally, Sebastian was supposed to die in the series finale instead of \" A New Deal \". He would have been \"sent into battle\" by his mother which would have put him into a situation that she knew would lead to his death. [1] This was changed because the writers felt there needed to be a big turn in the final part of the season. Sebastian is the final tertiary antagonist of the TV Series .",
        "References[]": ""
    }
]