[
    {
        "Pre-Apocalypse[]": "Little is known about Shawn's life prior to or as the outbreak began. He likely moved onto the farm following Annette's marriage to Hershel. Shawn was just a newborn child when he moved to the Greene family farm . His biological father is likely to have been out of the picture, since Shawn has his stepfather's last name.",
        "Post-Apocalypse[]": "Sometime after the initial outbreak, Shawn was killed by walkers. Before his initial reanimation, however, Hershel or Otis placed him inside of the barn, along with his mother, Annette. Maggie relates her sadness over Otis' death to her sadness over the deaths of Shawn and Annette. We later see pictures of him and Annette hung on the refrigerator in the farmhouse. Shawn and Annette are revealed by Hershel to be zombies in the barn. Maggie brought up his name, along with those of Annette and some of their neighbors, to Glenn Rhee when they were gathering supplies at Steve's Pharmacy . Toward the end of the episode, Shane Walsh opens the doors of the barn. As the zombies exit, the remaining Atlanta camp survivors proceed to kill all of them, Shawn included. Shawn, along with his mother, Annette , and Sophia Peletier are buried under the trees that can be found near the barn. At the Manhattan Tribespeople 's base, Maggie looks through a box of old photos of her family, including Shawn.",
        "Death[]": "Killed By Zombies (Alive) Shawn and his mother are both somehow bitten by walkers. Sometime later, he reanimates and is put in the barn. Shane Walsh , Andrea Harrison , or Theodore Douglas (Zombified) After Shane forces the barn open, the walkers inside proceed to exit. Systematically, they are shot and killed by the group of Atlanta Survivors. It is unclear which survivor put down a zombified Shawn. However, due to the fact his head-shot was executed by one a single bullet from handguns rather than the scatter-rounds from the shotguns, it would have been either Shane, Andrea, or T-Dog.",
        "Killed Victims[]": "This list shows the victims Shawn has killed: Possibly a few zombies",
        "Appearances[]": "",
        "Trivia[]": "Shawn is the first of two character to have his ancestry changed from comic to show, as instead of being Hershel's biological son, he is Hershel's stepson. The other example of this is Kenneth Sutton . Shawn appears in the archival footage shown at the beginning of \" Lockdown \" as Judith narrates past events of the show to the audience before the episode's story begins.",
        "Name": "Shawn Greene"
    }
]