[
    {
        "Shiva": "",
        "Overview[]": "Shiva is a loyal, brave, and domesticated tiger. Before the outbreak, Shiva fell into a concrete moat and badly injured her leg. Ezekiel , who was just a worker, jumped in and saved Shiva, something she was quite grateful for, and because of this never showed any aggression or hostility towards Ezekiel. Generally, tigers are unable to be tamed under most circumstances since they are solitary animals, making Shiva an anomaly among others. To her allies, Shiva is friendly and non-aggressive and is able to distinguish friend from foe. To her enemies, Shiva is ferocious and unrelenting. Right before Negan is about to kill Carl , Shiva saves him by jumping on a Scavenger and kills him. Later, most of the Kingdom soldiers are slaughtered leaving Ezekiel, Jerry , and Carol as the only survivors. Due to Ezekiel's injury, they are forced to go at a rather slow pace, allowing walkers to catch up. Right as it seems Ezekiel will sacrifice himself, Shiva jumps in and saves her owner, fighting off the walkers so the three can escape. However, this costs her life and the walkers proceed to devour her. Years after her death, Shiva is still remembered fondly and is a symbol of the Kingdom's strength. In \" New Haunts \", it's revealed that Ezekiel reveals still possesses Shiva's leash, and gives it to Ezra as a gift.",
        "Pre-Apocalypse[]": "Shiva was an exhibit in a zoo where Ezekiel Sutton worked as a keeper. Shiva once fell in a concrete moat in her enclosure and badly injured her leg. With no veterinarians around, Ezekiel came to her rescue, wrapping his shirt around her open wound and stopping a hemorrhage. Grateful, Shiva never showed any signs of hostility towards Ezekiel afterwards.",
        "Post-Apocalypse[]": "Shiva is shown with Ezekiel as he sits on a throne in a theater auditorium chained at his side. She growls at Carol , but Ezekiel manages to calm her down, as she is not a threat. Shiva proceeds to sit down while Ezekiel introduces himself to Carol and welcomes her to the Kingdom . Ezekiel and Shiva later visits Carol. He offers her a pomegranate. She smiles. Shiva appears with Ezekiel when he grants Rick Grimes and Jesus an audience. Shiva is shown in her cage, Daryl is seen accompanying her and pets her before being met by Morgan . Shiva is lounging around with Ezekiel as he observes the Kingdom from a second-story balcony. Nabila approaches him and is cautious due to Shiva being near him and keeps her distance. When Ezekiel takes a regiment to aid Alexandria , Shiva joins them. As Negan Smith is about to kill Carl Grimes , Shiva appears and attacks a Scavenger standing near Carl, killing him and saving Carl's life. During the battle, Shiva kills a Savior, causing Negan to complain about her as he, the surviving Saviors and the Scavengers are forced to retreat. Shiva is seen on the truck as the Militia prepare to attack the Sanctuary . She is later seen taken outside of a school bus by Alvaro , before he and the Militia head to battle. As the Militia chases a Savior through the woods, Shiva appears and kills him. However, they discover that it is too late as the Saviors already know that they are coming. Shiva is seen with Ezekiel after he and the Kingdommers killed the Saviors. Prior to leaving the Kingdom with the others to assault the Sanctuary, Shiva is seen next to Ezekiel as he addresses the people. After the attack, there is no sign of Shiva and Alvaro hasn't seen her since before the Kingdommers were slaughtered. Later, Ezekiel, having slowed the group due to his injured leg and inability to walk, tells the group to leave him, as they are surrounded with no way out. Suddenly, Shiva shows up and grabs a walker, killing it and throwing it into a barrel. The walkers then change focus to her instead of the group. Ezekiel cries out to her in horror, telling her to run, but it was too late, as she is brought down and devoured by the walkers. However, her sacrifice enables Ezekiel, Carol and Jerry to escape.",
        "Death[]": "Killed By The Saviors (Indirectly Caused) Ezekiel Sutton (Indirectly Caused) Carol Peletier (Indirectly Caused) Jerry (Indirectly Caused) Herself (Sacrifice) Zombies As Ezekiel, Carol and Jerry are escaping, they are slow to escape due to carrying Ezekiel, as he is injured. Shiva appears just in time to help them, taking down at least 3 walkers before she is overrun and devoured.",
        "Killed Victims[]": "This list shows the victims Shiva has killed: Nelson Herself (Sacrifice) 1 unnamed Scavenger 1 unnamed Savior Numerous counts of zombies and possibly unnamed people",
        "Appearances[]": "",
        "Trivia[]": "Shiva is The Walking Dead ' s first and only character that is not portrayed by a live actor. However, her actions are created by visual CGI effects embedded on a stuntman in a blue suit. Shiva is both the first animal to kill living survivors and walkers on-screen. In the episode \" Chokepoint \", the Kingdom is shown to have a banner and stuffed tiger on display in memorial to Shiva. Shiva is the first animal character in the series to appear in more than one season. In the episode \" New Haunts \", it is revealed that Ezekiel still possesses Shiva's leash, although he later decides to gift it to Ezra as a present. The same episode features Jerry , Ezra and Aliyah dressed up as tigers for Halloween, presumably in homage to Shiva. Shiva appears in the final flashbacks of the last episode \" Rest in Peace \".",
        "References[]": ""
    }
]