[
    {
        "Shumpert": "",
        "Overview[]": "Shumpert is a quiet and stoic individual. He initially is a loyal ally to the Governor . He participates in the Governor's killing of the National Guard and attacking of the Prison. However, when he witnesses the Governor kill the Woodbury militia, he abandons him with Martinez. According to Caesar Martinez , Shumpert became depressed and guilty about what happened with Woodbury. He became reckless and cared little about his well-being leading to his death by a walker.",
        "Pre-Apocalypse[]": "Nothing is known about Shumpert's life prior to or as the outbreak began. It is unknown how he acquired his archery skills but it is possible that he gained this skill while living in Woodbury or was skilled with a bow prior to the outbreak.",
        "Post-Apocalypse[]": "Armed with a bow and arrow, Shumpert accompanies the Governor , along with Crowley , Martinez, and Merle Dixon, as they inspect the helicopter crash site and find Andrea Harrison and Michonne Hawthorne . That evening, he stands guard in the infirmary as the two are examined by Dr. Stevens . As the Governor bring Andrea and Michonne outside to show them the town, Shumpert heads over to the wall and mans a spotlight while Merle kills the walkers outside the gate. Later when Andrea and Michonne are walking down the Woodbury street, Shumpert follows them around and observes from afar. He also participates in the ambush of the National Guard soldiers, wielding a rifle which he uses to kill them. One morning while the Governor is having breakfast with Milton, Andrea, and Michonne, Shumpert knocks on the door and whispers something to him, which causes him to cut their meal short due to the hidden matter's urgency. Shumpert is later part of the team to gun down the soldiers, then witnesses the Governor gunning down an injured soldier who attempts to flee, giving a look of sorrow to Merle Dixon . Afterwards, Shumpert, along with the other henchmen, gathered the weapons and armored vehicles before driving them home to Woodbury and presenting their findings to the townspeople. At night, Shumpert follows the Governor and Andrea to the arena for the fight between Merle and Martinez. At the arena, Shumpert, along with Crowley and another man, serve as guards during the fight to ensure the undead don't get out of control as Tim referees the fight. Shumpert keeps watch along the wall with his bow, when Rick Grimes , Daryl Dixon , Oscar , and Michonne hide outside of the Woodbury perimeter. Shumpert shines a spotlight on the outskirts of Woodbury, before walking off the wall and into the streets of town where Andrea walks past. Shumpert was present at the meeting in Milton's laboratory before the firefight between the Woodbury guards and Rick's group. Shumpert is part of the search team, looking for Rick's group. He is seen participating in the shootout between the two groups, taking cover behind a bench alongside Martinez. Upon the capture of Daryl Dixon and the abandonment of former ally Merle in the arena, he is shown wielding Daryl's signature crossbow and commanding two guards to remove Merle's knife and pistol. During the attack on Woodbury by Rick's group, Shumpert is seen shooting a walker with Daryl's crossbow before Daryl snatches it out of his hands. Shumpert is then seen getting knocked down by Merle as the two brothers flee from Woodbury. He is later seen on the settlement's wall, when Andrea is attempting to defuse the tensions between residents and the guards. While on the wall, Shumpert helps kill the walkers clawing on the wall. When a scream is heard on the opposite side of town, Shumpert runs over there with the other residents and see walkers eating Richard Foster . He witnesses Andrea kill the walkers attacking him and also watches as the Governor mercy kills Richard. Shumpert keeps the citizens of Woodbury away from the zombies, Richard, Andrea, and the Governor. When the Governor attacks the prison , Shumpert is armed with an assault rifle and takes cover behind the driver door of his car while he shoots at where Rick and Hershel Greene are standing. Shumpert and the Governor are shot at by Michonne, but he dives to the ground for cover and is uninjured. However, he is unable to kill anybody and gets back into the vehicle with the Governor. Shumpert is on guard duty along the wall with Martinez when suddenly a car approaches the gate. Both men aim their guns at the vehicle as Andrea steps out, in which they realize who she is and cautiously lower their weapons. Shumpert is first seen with Martinez in Woodbury collecting weapons from the town residents, following the Governor's orders. After putting all the weapons in a basket, Martinez, Shumpert, and newcomers Tyreese , Sasha , Allen , and Ben head out for the biter pits and gather walkers for Woodbury. When getting ready to pull the biters up, Shumpert tosses a hook to Allen. A few moments pass, and Tyreese and Allen get into an altercation as Martinez and Shumpert observe. They return to the town not long after. In the morning, Shumpert drives out to the biter pits by himself and sees that the walkers there are all burnt and stuck together. He raises his assault rifle about to kill them when he hesitates and puts it back down. He returns to town and informs Martinez that a saboteur has burnt down the biter pits. Martinez then visits the Governor and tells him what happened. As Shumpert and the rest of the Governor's men gather at the mill, the designated meeting spot where Michonne would be apprehended, loud music suddenly erupts, attracting a group of walkers to the mill. As Merle, the one responsible for the distraction, hides in a building, Shumpert and the other men run over and begin taking out the walkers with their guns. However, a bunch of men are sniped off by Merle, but the shooter is caught by Shumpert and the others before he could kill the Governor. Shumpert is among the soldiers drafted into the Governor's army to attack the prison. He mans the machine gun on one of the military Humvees and opens fire on the prison once arriving in the yard, causing damage to the prison buildings and fences. After not being met with any counterattack, Shumpert and the other Woodburians make their way inside the prison where they are ambushed by the prison survivors. He is among the Woodburians to escape the tombs alive and drive away in the vehicles, albeit being one of the last people to do so, along with Martinez and the Governor. Their truck speed up to the front of the convoy and cuts off the leading car to stop the Woodbury soldiers from fleeing any further. He looks on in disapproval at the soldiers, but he is quickly horrified as the Governor opens fire on the crowd, killing everyone. He backs away in terror as his friends are gunned down, but willingly gets back in the truck when the Governor orders him to. He, the Governor, and Martinez drive off into the unknown. The night of the Woodbury massacre, Shumpert's tent is seen while the Governor sits by the fire. The morning after that, Shumpert and Martinez steal the truck and abandon the Governor. Martinez mentions that Shumpert was bitten by a walker near the camp's defensive pits sometime after the prison assault and abandoning the Governor, stating that after Woodbury he wasn't the same. He explains that it seemed like Shumpert wanted to die as he was acting recklessly and didn't move out of the way when the walker came at him. Martinez adds that he put Shumpert down himself straight after he was bit.",
        "Death[]": "Killed By Zombies (Alive) Himself (Caused) Caesar Martinez (Before Reanimation) After abandoning the Governor, Shumpert became reckless, and one day at camp, he got bitten by a walker. Martinez claimed that he didn't even try to avoid the walker. He also said that he was the one who put him down.",
        "Killed Victims[]": "This list shows the victims Shumpert has killed: Wilson (Alongside his fellow survivors) Welles (Alive, Possibly, Direct or Caused) Himself (Caused) 5 unnamed U.S. Military soldiers (Alongside his fellow survivors) Numerous counts of zombies and possibly unnamed people",
        "Appearances[]": "",
        "Trivia[]": "Shumpert is credited as the Bowman until \" Welcome to the Tombs \" when he is finally credited under his name. Travis Love also portrayed a Vatos thug in \" Vatos \", although there is no indication that both of these characters are the same person. Travis Love confirmed that Shumpert did appear in Season 4 but the scenes he was in were cut, so they had Martinez say he died."
    }
]