[
    {
        "Stacy": "",
        "Pre-Apocalypse[]": "Nothing is known about Stacy's life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "At some point in the apocalypse, Stacy joined a community called the Alexandria Safe Zone . Stacy witnesses the fight between Aiden and newcomer Glenn at the town's gates with Olivia and several other residents. Stacy is on a front porch chatting with Erin , newcomer Carol , and another woman . That night, she attends Deanna 's welcoming party for the new arrivals and socializes with the other residents and the new arrivals. As Sasha is overwhelmed by the party guests, Stacy talks with Barbara about their hopes of a dentist arriving at the community. Stacy is out talking with Natalie and Bob on their front steps. After running towards the commotion in the street, she watches in horror as Rick and Pete are engaged in a bloody brawl. Stacy is among the townspeople present at the community forum to discuss Rick's fate. She is seated near Jessie and Francine and listens to her fellow residents as they speak. Stacy and the other residents are shocked when Rick suddenly arrives with the corpse of a walker as Tobin was speaking. She also witnesses the murder of Reg Monroe , which she is horrified at, and the subsequent execution of Pete Anderson . Stacy attends the meeting at Deanna's house regarding how to handle the mega herd at the quarry. In the following days, she is among the volunteers to help build the wall on one of the roads to deter the mega herd in the operation to lure it away from Alexandria. Stacy is killed outside in the street when the Wolves invade Alexandria and start ransacking houses and murdering residents. The next day, Stacy's body is gathered by Tobin and Bruce and buried along with the other slain Alexandrians. Her name is then added to the memorial wall by Betsy and two other women .",
        "Death[]": "Killed By Aaron (Indirectly Caused) Aaron leaves his backpack at Del Arno Foods, which causes the Wolves to locate and attack Alexandria. The Wolves As the Wolves make their way into Alexandria, Stacy is one of the many residents to be killed.",
        "Killed Victims[]": "This list shows the victims Stacy has killed: Possibly a few zombies",
        "Appearances[]": "",
        "Trivia[]": "While never credited, the actress confirmed that she was killed in \" JSS \" and her name was written on the wall in \" Now \". Stacy, along with Michael , were filmed fleeing from the Wolves, but the scene did not make the final cut."
    }
]