[
    {
        "Sturgess": "",
        "Fate": "",
        "Contents": "",
        "Overview[]": "Sturgess is an incompetent, cowardly, panicky, and inexperienced survivor. Against walkers, he is shown to be utterly useless. Though he does seem to want to do some good since he joins the group in keeping the walkers on the road. However, when the plan starts to go wrong, he becomes quite pessimistic. When walkers attack again, he tries to shoot them with his gun but he is extremely nervous and shaky. All he ends up doing is accidentally shooting Scott in the leg which made the trip back to Alexandria even harder. Sturgess panics after doing this and runs away into the woods. Later it's revealed that he didn't make it far and is devoured by walkers.",
        "Pre-Apocalypse[]": "Nothing is known about Sturgess' life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "At some point in the apocalypse, Sturgess joined a community called the Alexandria Safe Zone where, upon being interviewed by Deanna , he was appointed as one of the gardeners. Sturgess is among the volunteers to help build the wall on one of the roads to deter the mega herd in the operation to lure it away from Alexandria. One day as they are in mid-construction, he and the other Alexandrians are almost bitten by walkers until Morgan saves them as opposed to Rick 's suggestion of forcing the scared residents to learn how to defend themselves. When the walkers break free from the quarry and the plan is set into motion, Sturgess goes along with Scott , Annie , Glenn , Nicholas , and Heath to keep walkers from straggling off the road with flares. When a part of the herd ventures away from the road into the woods due to a blaring horn coming from Alexandria, the group runs through the woods in an attempt to return to the community. As they are attacked by walkers, Sturgess tries to fight them off but accidentally shoots Scott in the leg. He then panics and runs away from the group on his own, however, he is ambushed in a nearby town and devoured by several walkers. A while later, the group finds Sturgess' hat lost on the streets of the town, followed by his lifeless corpse, still being eaten by the walkers.",
        "Death[]": "Killed By Zombies Shortly after having abandoned the group, Sturgess is ambushed in a nearby town and devoured by several walkers.",
        "Killed Victims[]": "This list shows the victims Sturgess has killed: Possibly numerous counts of zombies",
        "Relationships[]": "",
        "Appearances[]": "\" First Time Again \" (No Lines) \" Thank You \"",
        "Trivia[]": "His signature hat, that was used during shooting, was given as a gift to a fan on Talking Dead ."
    }
]