[
    {
        "Tamiel": "",
        "Fate": "",
        "Contents": "",
        "Overview[]": "Tamiel is an unemotional, controlled, cunning, and crafty individual. One of the most loyal Scavengers , she is extremely trusted by Jadis . She is the first Scavenger introduced, spying on Alexandria and kidnapping Gabriel . Tamiel rarely shows any emotion, even when her life is in danger such as Gabriel holding a knife to her throat, she keeps the same blank expression. Later, she and the Scavengers betray Rick 's group, showing she is willing to resort to underhanded tactics for her group. Rick attempts to get the Scavengers back on their side, but Tamiel is distrusting of him, though they briefly help him attack the Sanctuary . However, later Simon gets revenge on the Scavengers for this. In her final moments, after Simon shoots her fellow lieutenant Brion , Tamiel is shown to be shocked and horrified, something quite rare to see, before she herself is killed. Jadis is distraught over her demise, looking at her with sadness before she is put down.",
        "Pre-Apocalypse[]": "Nothing is known about Tamiel's life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "At some point in the apocalypse, Tamiel somehow came into contact with a group called \"the Scavengers\" which she subsequently joined before becoming a lieutenant. They survived by making homemade weapons from junk and scavenging the nearby areas for supplies. Tamiel was present when Jadis made a deal with an unknown group in possession of a helicopter in exchange for supplies. Throughout the following months, she and her fellow Scavengers would kidnap people, marking them as an \"A\" or \"B\", and then deliver them to the helicopter to be taken to an unknown location and to an unknown fate. After seeing how two strangers struggle and eventually take over a dozen supplies from a boathouse in a lake full of walkers, Tamiel follows them to their community, Alexandria . That night, she heads for the gates and watches Gabriel with binoculars as he is on lookout. [1] Tamiel swiftly kidnaps Gabriel and forces him to take all the supplies from Alexandria as well as a car so they could drive back to the Heaps . Before they leave, Gabriel writes the word \"boat\" on a piece of paper, leaving it as a hint, to where Rick and his group need to go to find him. Tamiel is among the Scavengers to round up Rick Grimes and his group at the Heaps when they arrive looking for the missing Gabriel. When Rick asks for his friend's whereabouts, Jadis commands Tamiel to retrieve Gabriel. As a fight breaks out between the two groups, Gabriel holds Tamiel at knifepoint but eventually lets her go after making a speech. After Rick kills the walker covered in spiked armor, Tamiel and the Scavengers agree to help fight the Saviors in exchange for goods and more guns as payment. Tamiel observes the 63 guns Rick and Michonne found at an overrun refugee camp and watches Rick and Jadis negotiate over the guns and being ready to fight. Tamiel and the Scavengers arrive at Alexandria in a caravan of garbage trucks and bicycles. Later that day, Brion alerts everyone that the Saviors are coming. When Rick gives Rosita the signal to detonate the explosives to destroy Negan Smith 's caravan, they discover that the Scavengers had deactivated the explosives. Before Rick can reach for his gun, Jadis leaps up and aims her gun at Rick. Simultaneously, the Scavengers all turn their guns on the Alexandrians. After Negan is attacked by a zombified Sasha, the Alexandrians take their chance and attack the Scavengers and Saviors. Tamiel joins the fight with the Saviors. After the Kingdom and the Hilltop arrive and join the fight and many Scavengers are gunned down, Tamiel scales the walls and runs out the gate on foot with the remaining Scavengers. Tamiel is among the group of Scavengers surrounding Rick as he attempts to persuade Jadis and everyone else to abandon Negan and join the winning side in the war against the Saviors. However, Tamiel shows her full distrust of Rick and his plan and watches as he is taken to a container. After Rick overcomes a walker and finally convinces Jadis to join his side, Tamiel is among the Scavengers that travel to the Sanctuary to validate Rick's claim that it is surrounded by a herd. Upon arriving at the Sanctuary and finding it empty from walkers, Tamiel is shocked to find that the Sanctuary wasn't depicted as shown in the photographs provided by Rick. When the Saviors start shooting at the Scavengers, Tamiel retreats with Jadis and the others. Tamiel watches with Brion and the other Scavengers as Simon addresses the crowd and demands an apology from Jadis for her attempts to attack the Saviors. Dissatisfied with her first attempt, Simon shoots Brion in the chest, killing him, much to Tamiel's horror. Jadis attempts to apologize again and still dissatisfied, Tamiel is shot and killed next. After the rest of the Scavengers are massacred, Tamiel eventually reanimates. Later that day, she is among the zombified Scavengers lured by Jadis to a metal crushing machine where she steps into the machine and is pulverized to a pulp. After making a deal with the helicopter pilot for relocation, Anne retrieves her most loved belongings, a picture of Tamiel being among them.",
        "Death[]": "Killed By Negan Smith (Indirectly Caused) Negan orders Simon and his men to go to confront the Scavengers and take their weapons and kill one in order to get the others in line. Simon (Alive) After taking all the Scavengers' guns and killing Brion because Anne didn't apologize for her actions, Tamiel is fatally shot in the chest before the rest of the Scavengers are gunned down. Anne (Caused; Zombified) After Rick and Michonne leave her behind, Anne leads all of the zombified Scavengers up a hill and into a metal grinder, crushing them into pulp. Amongst them is Tamiel, who Anne watches get crushed sadly.",
        "Killed Victims[]": "This list shows the victims Tamiel has killed: Possibly numerous counts of zombies and unnamed people",
        "Relationships[]": "",
        "Appearances[]": "",
        "Gallery[]": "For more images of Tamiel, please visit Tamiel (TV Series)/Gallery .",
        "Trivia[]": "Tamiel is the first member of the Scavengers to appear. Coincidentally, she is also the last named member of the Scavengers to die, both alive and zombified. Tamiel is also Jadis ' last named character kill in the TV Series, albeit zombified.",
        "References[]": ""
    }
]