[
    {
        "Tanya": "",
        "Contents": "",
        "Overview[]": "Tanya is generally an enthusiastic and kind person, such as with Eugene . However, like the rest of the wives, she has an immense hatred for Negan . At one point, Tanya and Frankie try to convince Eugene to make pills for Amber to commit suicide. However, in actuality, the pills are to kill Negan, something Eugene figures out. Tanya is among the most civil at the Sanctuary and after the All Out War is over, she is friendly with Rick 's group and is fine with them helping rebuild the Sanctuary.",
        "Pre-Apocalypse[]": "Nothing is known about Tanya's life prior to or as the outbreak began, except that she was skilled in culinary and had a career as a chef.",
        "Post-Apocalypse[]": "At some point in the apocalypse, Tanya somehow came into contact with a group named the \"Saviors\" which she subsequently joined upon where she volunteered to become one of Negan 's \"wives\" in order to avoid working for points. While Negan gives Carl a tour around the Sanctuary , Tanya spends her time in a well-furnished room with Sherry , Amber , Frankie , and a couple of Negan's other wives. As soon as Negan leaves the room, Tanya and the other women comfort an upset Amber. Later that day, Tanya stands with the other wives and witnesses Mark 's face being ironed. When newcomer Eugene gives a solution to preserving the walkers used at the gates, Negan allows him to spend that night with his wives but with the only condition of not having sex with them. At night, Tanya, Frankie, and Amber watch Eugene as he plays video games when Tanya jokingly asks if he knows how to make a bomb after becoming interested in his knowledge. Shortly after, the wives accompany Eugene outside and watch as he makes a homemade bomb. The next day, Tanya and Frankie convince a reluctantly Eugene to make some pills so a depressed Amber can commit suicide. She is later present on the factory floor when Dr. Carson is accused of freeing Daryl and is thrown into the furnace and burnt to death as a result of his actions. After watching the grizzly scene, Tanya and Frankie visit Eugene in his apartment where he refuses to hand them the pills after correctly guessing they are for Negan instead. Tanya shows up at Eugene's apartment with a bottle of wine, asking that her radio be fixed soon as a part of their previously agreed upon deal. Eugene asks for the second bottle of wine now, stating that he needs it to sleep at night due to the current station. She replies that she's scared too but she and Frankie approached him with a solution that he turned down, and now he must deal with the repercussions. Having moved to Eugene's new outpost to serve as a personal chef for Eugene and all the workers, Tanya and Frankie criticize Eugene's request for a sardine and mac n' cheese dish, with Tanya stating that she can't believe garlic was wasted for that dish. Later that day, she listens to Eugene's speeches about making enough bullets to aid Simon and Negan in the battle against the survivors. Tanya walks around with Frankie and Amber at the Sanctuary as the Saviors prepare for the final assault. After the war ends and Negan is defeated, Tanya starts to dress in normal clothing. She and Frankie greet Tara and Rosita at the Sanctuary when they arrive to fix the glass that was shattered previously by the Militia . During the year and a half that passed since the end of the war , Tanya started to work on the Sanctuary under Daryl 's orders. When Rick and the survivors arrive at the Sanctuary to deliver farming equipment, Tanya stands by the stairs and applauds with the other Sanctuary residents, who are all pleased to see Rick Grimes visiting their community. At some point following Rick's assumed death, the Sanctuary eventually falls as a community, with most of its residents integrating into Alexandria, Hilltop, and the Kingdom, though some chose not to join any of the communities. Since then, Tanya has not been seen among the communities after the Sanctuary fell, leaving her fate unknown. Tanya appears in Dwight's flashbacks of the Sanctuary .",
        "Killed Victims[]": "This list shows the victims Tanya has killed: Simon (Possibly, Zombified) Possibly numerous counts of zombies",
        "Relationships[]": "For a more in-depth look at Tanya's relationships, read here: Tanya (TV Series)/Relationships",
        "Appearances[]": "",
        "Gallery[]": "For more images of Tanya, please visit Tanya (TV Series)/Gallery .",
        "Trivia[]": "In a deleted scene from \" Wrath \", Tanya is present with Frankie and Amber and hundreds of other Saviors in the Sanctuary as they listen to Negan's speech about wiping out the survivors with Eugene's bullets. Tanya's lines were cut from \" A New Beginning \"."
    }
]