[
    {
        "Theresa": "",
        "Fate": "",
        "Contents": "",
        "Pre-Apocalypse[]": "Nothing is known about Theresa's life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "Theresa is seen eating Bob Stookey 's leg. Theresa continues to eat Bob's leg, and as Bob starts to laugh hysterically she gets up with the others, commenting that she didn't think Bob would last this long. After Bob says that he's tainted meat, she spits what food she has in her mouth out and asks why Gareth didn't check Bob first. Martin replies, saying that Bob looked fine. Later, Theresa travels along with the other Hunters to the church, after Rick Grimes leads the stronger survivors out to finish off the remaining Terminants. Theresa, in the church searches it with the others, and when they are about to open the door where the remaining group members are hiding, they are ambushed by the other half of Rick's group who quickly dispatch Mike and Albert , and shoot two of Gareth's fingers off when he continued to threaten the hiding group. Theresa surrenders under Gareth's order, the latter whom which began to beg for mercy. However, Rick does not let any of them go free. As Rick hacks at Gareth with a machete, Michonne with the butt of her assault rifle, smashes in Theresa's head. After Theresa's death, Michonne finds her katana in a bag of supplies. Theresa can be seen eating Bob's leg in a flashback sequence when Sasha Williams is having a panic attack after arriving at the Alexandria Safe Zone .",
        "Death[]": "Killed By Michonne Hawthorne After surrendering in the church, Gareth tries getting Rick to spare them, but Rick refuses and starts to hack at Gareth with his machete. Theresa is then bludgeoned to death by Michonne with the butt of her assault rifle.",
        "Killed Victims[]": "This list shows the victims Theresa has killed: Possibly numerous counts of zombies and unnamed people",
        "Relationships[]": "",
        "Appearances[]": "",
        "Trivia[]": ""
    }
]