[
    {
        "Overview[]": "Tim is a loyal soldier to the Governor and follows any order he is given. He helps carry out ruthless acts, such as aiding in gunning down the National Guard. Later, while tracking down Michonne , he shows no fear, in contrast to Gargulio , and even finds humor in Michonne's \"biter gram.\" However, he'd ultimately meet a brutal end moments later, after Michonne comes out and impales him with her sword. Tim is then accidentally shot twice by Merle, killing him.",
        "Pre-Apocalypse[]": "Nothing is known about Tim's life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "Tim resided in Woodbury. He accompanied the Governor on a mission to a helicopter crash scene, where he stood guard, armed with a silenced Walther P38 pistol, as the others dispatched walkers, and took one US soldier prisoner. He accompanied the Governor on an ambush of a National Guard group, assisting in taking out the soldiers and recovering their weapons. After a surviving soldier was seen limping away from the carnage, the Governor shot him in the side and handed Tim a knife, ordering him to put an end to the soldier's life. Tim was first seen at the Woodbury celebration. He was walking with some buddies when Michonne turned and ran into him, causing him to call out. Then he saw Michonne find out who killed the zombie arena. Tim is later seen in a truck with Martinez , Milton Mamet and Merle Dixon. They searched for zombies to use for the Woodbury arena event. Tim managed to trap some of the zombies and they transported them back to Woodbury. He is not seen again until nightfall during the arena fight between Merle and Martinez. It appeared that Tim was the referee of the arena fights, allowing the walkers to move closer and blowing the whistle at certain times. Tim, Merle, Crowley , and Gargulio were sent out to search for Michonne. However, their target ambushed them, and Crowley was decapitated. Tim was then impaled by her sword before being used as a shield for Merle's bullets. A few moments later, Merle walks over to Tim's corpse and stabs his head before he could reanimate.",
        "Death[]": "Killed By Michonne Hawthorne (Caused) After being sent out to kill her, the group is ambushed by Michonne, who had snuck up behind Tim and Crowley. Crowley is quickly decapitated, while Tim is stabbed by her sword. Merle Dixon (Accidental; Before Reanimation) Tim is then used as a shield and is shot twice by Merle. Later, Merle sinks his bayonet through his eye socket, and into his brain to prevent reanimation.",
        "Killed Victims[]": "This list shows the victims Tim has killed: Wilson (Alongside his fellow survivors) Welles (Alive, Possibly, Direct or Caused) National Guardsman 5 unnamed U.S. Military soldiers (Alongside his fellow survivors) Numerous counts of zombies and possibly unnamed people",
        "Appearances[]": "",
        "Trivia[]": "He wore a necklace with a bullet. During the Talking Dead for \" Say the Word \", Tim is dubbed as Evil Glenn by Chris Hardwick . For unknown reasons, Tim's death was not included in Talking Dead's In Memoriam segment for \" Hounded \".",
        "Name": "Tim"
    }
]