[
    {
        "Dr. Tomichi Okumura": "",
        "Overview[]": "Tomichi is a sensible, intelligent, and good-natured individual. Before the apocalypse, Tomi was a surgeon. However, he reveals that he was miserable due to the stress of having people's lives on his hands. At the start of the outbreak, he joined the Commonwealth and became a baker, keeping his medical experience a secret. However, when his sister Yumiko accidentally outs him, Tomi is forced to become a surgeon. After this, Tomi is visibly unhappy and disheveled. Despite this, he still tries his best and cares for his patients. He is still shown to be distraught whenever one of his patients dies. After helping Theresa , Tomi seems to be reinvigorated and happier in his job. It's also shown that he is highly respected and liked in the Commonwealth to the point that Pamela can't make Tomi disappear without serious repercussions. Tomi is generally cautious and sticks with the status quo for survival, even encouraging Yumiko to do the same after her friends disappear. Tomi admits that he's not happy about it, but he just doesn't feel that there's any other choice. However, Tomi shows signs of a rebellious streak similar to his sister's at times, suggesting that life in the Commonwealth under Pamela Milton 's tyranny has forced him to suppress it. Tomi shows great enjoyment at breaking the rules to help Ezekiel out and implies that he was a serious rule-breaker when he was younger. He also helps Mercer , his people and the Coalition while they are trying to take down Pamela, apparently siding with them without hesitation over taking the safer path of siding with Pamela.",
        "Pre-Apocalypse[]": "Not much is known about Tomi's life prior to or as the outbreak began, except that he had a sister named Yumiko and grew up with a father who has high expectation from his children and wanted him to study medicine. Judging by his accent, he was born and grew up somewhere in England. At some point, Tomi moved to the United States and became a thoracic surgeon. He and Yumiko hadn't spoken in years even before the world ended. Tomi was miserable as a surgeon. It was a profession that he never wanted to be a part of, but was forced into due to the unrelenting pressure of overbearing parents. And as much as Tomi wished he could save every patient, it's impossible. The losses weighed heavily on him and he also never felt comfortable with the bureaucracy of the health care system prioritizing one socioeconomic group over another. The pressures and discontentment of the job took their toll on Tomi and culminated in him abusing drugs and alcohol . [1] [2]",
        "Post-Apocalypse[]": "Upon the outset of the Trials , Tomi left a voicemail for Yumiko and drove east out of Chicago. Running out of gas in northern Ohio , he eventually met some good people and joined the secured city twenty miles south. The secured city was transformed into a civilized community known as the Commonwealth, established and led by former U.S. President William Milton . Assignments in the Commonwealth were based on previous occupations. Tomi, no longer wanting to be a surgeon, lied and listed himself as a baker. He was assigned to be a baker at Elodie's Treats - becoming the happiest he had been in years despite the world ending. Sometime after, Tomi posted a photo of Yumiko on the Wall of the Lost in the Commonwealth's Processing Center, alongside a message that reads: \"Have you seen my sister Miko? Contact Tomi at H .\" As Yumiko, Eugene , Ezekiel , and Princess are about to escape the Commonwealth Processing Center , they come across the Wall of the Lost. Princess notices Tomi's post and points it out to Yumiko, who stares at her brother's message in shock before deciding that she has to stay. Yumiko enters Elodie's Treats and tells one of the employees that she’s looking for someone. Tomi enters from a back room holding a cake. Yumiko greets him and he drops the cake, shocked to see his sister. As the siblings catch up, Tomi explains that he found the Commonwealth very early on, and that he's happy working as a baker instead of a surgeon. Yumiko asks if there's any possibility of bringing her people to the Commonwealth. Tomi says anything is possible if you follow the rules. Yumiko meets Tomi at the train station and marvels that he chose not to be a doctor. Tomi tells Yumiko that he's happy with his life, and makes Yumiko promise to keep his true profession a secret. Yumiko mentions that she has a meeting with Governor Milton. Soldiers come out of nowhere and haul Tomi away. When Carol sneaks into the hospital and looks up Ezekiel 's medical record, Tomi enters the room to grab a file and finds her. After Carol explains that she's worried about Ezekiel, a sympathetic Tomi asks what she wants to know. Showing him Ezekiel's file, Carol tells Tomi that she knows Ezekiel needs surgery for his thyroid cancer and is in line and she asks Tomi how long it will be before he gets to number 147. Tomi admits that it will be too long and asks her to keep that information to herself because patients aren't aware of their place in line. Crying, Carol agrees and asks if Ezekiel knows how bad his chances are. Tomi tells Carol that Ezekiel knows that the odds aren't good, but he doesn't know that he won't get the surgery unless, by some miracle, Ezekiel moves up the line. Tomi apologizes, wishing that he could do more for Ezekiel. An uncomfortable Tomi later attends Pamela Milton 's masquerade ball with his sister, causing him to drink multiple glasses of wine. Tomi visits Ezekiel in the Commonwealth hospital where Ezekiel is having blood work done. To Ezekiel's surprise, Tomi reveals that they are preparing him for surgery to remove his cancer. Although Ezekiel had thought that he was still on the list, Tomi states that he is now at the top of the list while Theo calls Ezekiel lucky because some people have to wait years. When Jerry asks about Ezekiel's bill, Theo states that it's been paid and Tomi states that he's thrilled and they are going to take good care of Ezekiel. With an order to rest up, Tomi leaves, promising to see Ezekiel on Friday at nine o'clock. Ezekiel is later wheeled into surgery with Tomi to remove his tumor. As Tomi prepares to drink in his office, Ezekiel , recovering from his successful cancer surgery, approaches Tomi for help with secretly treating Ezekiel's friend Theresa who needs an appendectomy. Tomi is hesitant as appendectomies are dangerous under the best of circumstances and he reveals that he has just lost a patient, something that bothers Tomi greatly. Ezekiel eventually succeeds in convincing Tomi to help his friend. Ezekiel and Tomi steal supplies from the hospital, surprising Ezekiel with the ease with which Tomi is breaking the rules. An amused Tomi tells Ezekiel to ask his sister about how much Tomi used to break the rules. However, as they sneak out, Ezekiel and Tomi are caught by a Commonwealth soldier and they are detained. The two are later released thanks to Carol using her influence from her new job with Lance Hornsby . After being released, Ezekiel leads Carol and Tomi to the Commonwealth's petting zoo, worrying Tomi that his patient is actually an animal. However, Ezekiel reveals a secret clinic that he has set up with Theo 's help for those who can't afford the Commonwealth's healthcare. Tomi operates on Theresa with Theo's help, but her appendix bursts in the middle of the surgery and Tomi sends Theo back to the hospital for more antibiotics. Tomi enlists Ezekiel and Carol's help and he successfully manages to remove Theresa's burst appendix. After finishing the surgery, a pleased Tomi tells his friends that while they will know more over the next 24 hours, it looks good for Theresa. At the Commonwealth Hospital , Yumiko finds Tomi who is treating a patient. Once the patient is gone, Yumiko reveals to her brother that her friends have been taken and removed from the Commonwealth. Tomi is shocked by the news, and Yumiko confirms that Magna , Connie , Kelly and all of the rest are gone on Pamela 's orders, and she is now demanding that Yumiko prosecute Eugene if she wants to see them again. Tomi recognizes that Pamela had likely threatened him too, but Yumiko promises to not let anything happen to him. However, that's not what Tomi is worried about. Tomi knows that Pamela expects Yumiko to fold and that she's stacked the deck that way, and if she doesn't, who knows what will happen to Yumiko. Yumiko is sure that there has to be another way and she seeks her brother's guidance on what to do. Even though it's not what she wants to hear, Tomi suggests that the best for Yumiko to protect her friends and herself is to give Pamela what she wants even though it means sacrificing Eugene. Tomi doesn't think that Yumiko has any other choice, pointing out that Pamela is still standing despite everything that's happened. \"There isn't some kind of justice just waiting around the corner,\" Tomi concludes. Yumiko is shocked that her brother can just accept that, but he sees it as survival, not acceptance which is what Yumiko wants for her friends and them for her. Later, Tomi is amongst those who are present for Yumiko's press conference announcing her intent to prosecute Eugene for Sebastian 's murder. Yumiko begins to read her prepared statement, but Yumiko begins to pause and have visible second thoughts while talking about how she was given a second chance to uphold the sacred ideals of the old world of justice, and how regardless of the personal cost, we must always seek justice if who we are as a people is to be preserved. Suddenly stopping, Yumiko publicly thanks Tomi and reminds the entire Commonwealth of his invaluable and irreplaceable importance to them as their thoracic surgeon, thus protecting Tomi from Pamela being able to retaliate against her by making Tomi disappear. although Tomi is visibly confused, and a bit displeased by his sister's actions. Turning the tables on Pamela, instead of finishing her prepared speech, Yumiko announces that \"I'd also like to take this opportunity to thank my people for always having faith in me. And now I'd like to show my faith in them, and also honor the pursuit of justice by announcing my intent to defend Eugene Porter who has been wrongly and unjustly accused by Pamela Milton and the Commonwealth. We look forward to our day in court. Thank you very much.\" Amidst the uproar of the crowd, Yumiko drops her prepared speech at Pamela's feet and sarcastically quips to the shocked and furious governor that \"there's your speech,\" and walks away. Along with the rest of the doctors, nurses and essential personnel, Tomi is evacuated to the Estates as a massive herd overruns the Commonwealth . At a safehouse, Tomi treats Judith 's gunshot wound. Tomi successfully treats Judith's wound, and she survives. He presumably also treats Lydia after Aaron and Jerry were forced to amputate her arm earlier due to a walker bite. Tomi later attends a celebration in Alexandria with his sister and her friends.",
        "Killed Victims[]": "This list shows the victims Tomi has killed: 1 unnamed Commonwealth resident (Before Reanimation, Assumed) Possibly numerous counts of zombies",
        "Appearances[]": "",
        "Trivia[]": "Tomi putting Yumiko on the Wall of the Lost , is similar to Elodie putting Michonne on the wall . Both Yumiko and Michonne were lawyers pre-apocalypse. Both of them were members of Eug ene 's group to go meet Steph anie . Tomi is described as a \"long-time member of a group recently discovered by our heroes,\" referring to his sister Yumiko and her allies. [3] Tomi is the second British character in the TV Series and the fifth one in The Walking Dead franchise. The first being Oak , the second being Mac , the third being Tomi's sister, Yumiko Okumura , the fourth being Elizabeth Kublek , and the sixth being Lara Croft . Tomi suggests to Ezekiel in \" Trust \" that he was a serious rule-breaker in his youth. Tomi and Theo are the only named doctors to survive the TV Series . The name Tomichi means \"wealth, abundance\" (富) ( tomi ) and \"one\" (一) ( ichi ). His nickname Tomi is written in katakana (トミ), which has no special meaning. However, when written in kanji (富 or 都美), it could possibly mean: 富 - \"wealth, abundance\". 都美 - \"metropolis, capital \" (都) ( to ) and \"beautiful\" (美) ( mi ). Tomichi's surname Okumura means \"back, inner part, heart, interior\" (奥) ( oku ) and \"town, village\" (村) ( mura ). Tomi is one four characters to be bilingual in both English and Japanese. The other three characters are Yumiko Okumura , Nat , and Benjiro .",
        "References[]": ""
    }
]