[
    {
        "Tommy": "",
        "Fate": "",
        "Contents": "",
        "Pre-Apocalypse[]": "Nothing is known about Tommy's life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "At some point in the apocalypse, Tommy joined a community called the Alexandria Safe Zone where, upon being interviewed by Deanna , he was appointed as a member of the construction crew. Over time, Tommy aided his crew in gathering materials from a nearby mall construction site to be used for the upcoming expansion of the community's walls, which lasted for around eight weeks. Tommy attends Deanna 's welcoming party for the new arrivals and socializes with the other residents and the new arrivals. When Sasha snaps at Maya , he and the partygoers become stunned. Tommy is working at the Woodlands Mall construction site gathering materials with the construction crew when the site is attacked by a herd. He helps fight off the walkers after witnessing Abraham rescue an injured Francine , who was abandoned by Tobin . Moments later, Tommy remains working after Abraham starts leading the team. Tommy is among the townspeople present at the community forum to discuss Rick 's fate. He also witnesses the murder of Reg , which he is horrified at, and the subsequent execution of Pete . He consoles a woman who tears up after witnessing such brutality. Tommy attends the meeting at Deanna's house regarding how to handle the mega herd at the quarry. In the following days, he is among the volunteers to help build the wall on one of the roads to deter the mega herd in the operation to lure it away from Alexandria. When the walkers break free from the quarry and the plan is set into motion, Tommy heads out to his assigned location to keep walkers from straggling off the road While in the woods, Tommy hears someone calling out for help, prompting him to turn back to find the source of the cry. However, he trips in the woods and severely injures his leg. He manages to make his way back to the road but is overcome by some walkers. [1] A short time later, Rick finds Tommy's body and prevents him from reanimating.",
        "Death[]": "Killed By Zombies After the herd in the quarry breaks free, Tommy heads out to his assigned location. However, he hears a cry for help while in the woods, prompting him to turn back, tripping and injuring his leg in the process. He makes it back to the road but due to his injured leg he is overpowered and devoured by walkers. Rick Grimes (Before Reanimation) Rick finds Tommy's body soon after and stabs him in the head to prevent reanimation.",
        "Killed Victims[]": "This list shows the victims Tommy has killed: Numerous counts of zombies",
        "Relationships[]": "",
        "Appearances[]": "",
        "Gallery[]": "For more images of Tommy, please visit Tommy (TV Series)/Gallery .",
        "Trivia[]": "According to the actor, the name Tommy was assigned to his character, but was never mentioned on the show. [2] Tommy, along with Betsy , are absent from the memorial wall, despite being Alexandrians who recently died.",
        "References[]": ""
    }
]