[
    {
        "Overview[]": "Although he only appeared in one episode, Tony was shown to be an impetuous, unstable, hostile, and dangerous individual. It is very likely that he was a rapist, as shown during his questioning of Rick about whether there were females located at the farm and going on to say that he \"hasn't had a piece of ass in weeks\". Throughout his short conversation with Rick , Hershel , and Glenn , it appears he was more than willing to kill the three of them and take over their farm, revealing he was also greedy and likely a murderer. This was further shown during his failed attempt to kill Rick before his violent demise.",
        "Pre-Apocalypse[]": "Almost nothing is known about Tony's life prior to or as the outbreak began, except that he went to college for two years and that he was born in a city, possibly Philadelphia. However, the word \"college\" has been used as a slang term for prison, so it is possible that he was actually in prison for two years, not college.",
        "Post-Apocalypse[]": "During the early stages of the apocalypse, Tony, Dave, and possibly others fled Philadelphia and attempted to reach Washington, D.C. , after hearing of a supposed refugee camp located there. However, they never reached their destination due to the roads being heavily jammed with vehicles, and they decided to settle into the countryside to protect themselves. Moving from place to place, they encountered many other survivor groups, each with its own claims about proposed solutions to the apocalypse, and they also discovered that Fort Benning had been overrun. Eventually Dave and Tony became members of a group consisting of 30 other survivors known only as \"the living.\" The group was very mobile, never staying in one place for too long, and was responsible for committing numerous atrocities, including raping two girls in front of their father. Tony and his group eventually arrived in Georgia at some point, shortly before the events of \"Nebraska\". Tony and Dave arrive at The Carriage Bar , which is already occupied by Hershel Greene , Glenn Rhee , and Rick Grimes . Dave comments on the fact that they are all still alive. They all begin drinking as soon as they introduce themselves. Rick mentions that Hershel lost \"people\" on that day, referring to his wife and step-son, who were killed, as walkers, earlier on. The conversation, which is mainly between Rick and Dave, continues on as to why each group is there and to where they are heading, with Tony interjecting small bits of information every now and then. Tony, in the middle of the conversation, gets up, walks over to a corner, and begins to urinate on the floor. Dave, who is still questioning Rick, asks where Rick and his group are staying, as he previously noticed that their vehicle outside had no personal effects inside it. Dave then guesses that Rick and his group are staying at a farm by Rick's reaction to his question. This leads Dave to ask then what kind of resources Rick and his group possess there. Tony then laughs and asks if they have women at the farm, because he \"hasn't had a piece of ass in weeks\", implying that he may want to rape them (it is later revealed by Randall that their group has done so before). Rick refuses to discuss any further details about the farm with Dave. Rick also indicates to Dave that he would not even consider letting Dave and Tony's group join them. Some tension then rises between Rick, Dave, and Tony, and Tony becomes quickly aggravated after Rick tells him to calm down. In response, Tony says he will kill Rick, Hershel, and Glenn, and then take their farm too. Dave diffuses the situation by jumping over the bar, pouring himself another drink, and then placing his gun on the bar in front of himself. The conversation continues, but Rick soon realizes that Dave and Tony are preparing to ambush him. Rick knows this because of Tony immediately grabbing his gun behind his back and becoming very tense. When Dave reaches for his gun, Rick draws his holstered revolver and shoots Dave in the head. Rick quickly spins around and shoots Tony three times: in the shoulder, then in the stomach, and finally in the head. As Tony lay dead, Rick retrieves his shotgun and shells and proceeds to leave the bar.",
        "Death[]": "Killed By Rick Grimes After Dave is shot by Rick, Tony tries to point his shotgun at him but is shot twice in the chest by Rick, before being shot in the head.",
        "Killed Victims[]": "This list shows the victims Tony has killed: Numerous counts of zombies and possibly unnamed people",
        "Quotes[]": "The following is a list of some of Tony's most memorable quotes.",
        "Appearances[]": "\" Nebraska \" \" Triggerfinger \" (Corpse)",
        "Trivia[]": "Tony, along with Dave and Randall , were announced in a casting call that was put out to the public in December 2011. He and Dave were shown in a preview clip of \" Nebraska \" that aired on January 16, 2012. Due to scheduling conflict, a body double, Ray Wessels, was hired to play Tony's corpse in \" Triggerfinger \". Tony shares a lot of similarities with the Claimer of the same name. They both are named Tony, are secondary antagonists, are most likely rapists, and are killed via gunshot.",
        "Name": "Tony"
    }
]