[
    {
        "Nelson": "Nelson",
        "Overview[]": "Nelson is a good-hearted man, however his loyalty to the Commonwealth Army has forced him to do horrible things he doesn't want to. He seems to be quite conflicted about his actions, as Gabriel says he often attended his sermons and seemed to want to talk about something, but always stopped himself, likely out of fear. When being interrogated, he initially remains defiant and refuses to answer Daryl 's questions. Although angry and desperate enough to resort to torture, Daryl quickly recognizes that Nelson is likely a good man who joined the army to support his family, much like Daryl himself did. After Gabriel recognizes him, Nelson opens up and asks him if God forgives people like him and expresses remorse and regret for his actions. Gabriel points out that although Nelson is a coward, he is trying to do the right thing and was just following orders. After some convincing, Nelson does the right thing and gives information about their friends, redeeming himself. Nelson admits that he wished that he had talked to Gabriel earlier rather than letting fear stop him and has Gabriel pray with him as he dies.",
        "Pre-Apocalypse[]": "Nothing is known about Nelson's life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "At some point during the outbreak, Nelson joined a community in Ohio. He was a member of the First Christian Church of the Commonwealth and often considered talking to Father Gabriel Stokes , but he always changed his mind at the last minute. Following their escape from the Commonwealth convoy, Rosita , and Gabriel overhear Nelson talking on the radio to another soldier from Outpost 41. The other man reports that there's no sign of the dead soldier that was killed by Rosita, Gabriel and Maggie or the escapees. Nelson reports in that he has found a set of boot tracks that might be from the dead soldier. Realizing the danger, Rosita and Gabriel take off down the road before the Commonwealth forces can find them. Walking along the tracks, Maggie follows the sound of the train whistle, but she is forced to quickly hide in a ditch as a motorcycle approaches at a railroad crossing. Nelson stops and reports in that the crossing is clear and that he's moving on to the next area for their sweep. As he is distracted by an approaching walker, Maggie takes the opportunity to ambush Nelson, successfully stabbing him in the armpit and critically wounding him. Daryl Dixon finds a wounded Nelson and presses him for information about the train. As Carol Peletier and Gabriel arrive, Gabriel recognizes Nelson as one of his parishioners and how he would attend Sunday service and always acted like he wanted to confess something but never would. Nelson asks Gabriel if God forgives him for being a coward, which Gabriel does not know the answer to, although he states God will acknowledge him if he helps the group by saying where the train is heading. Nelson informs them that he doesn't know where the train is going and that the group must follow the train to know exactly where it is heading. Daryl asks what Designation 2 means as his friend Connie was designated that. Nelson informs him he knows about Designation 2 only from rumors and that those under that designation never return. As Nelson starts succumbing from his wound, he asks Gabriel to pray with him while he dies who accepts his offer, and begins to pray with him as Daryl and Carol leave. Nelson then dies and Gabriel then stabs him in the head to prevent reanimation.",
        "Death[]": "Killed By Maggie Rhee (Alive) During a struggle, Maggie stabs Nelson in the armpit. He later dies of his wound. Gabriel Stokes (Before Reanimation) After Nelson dies, Gabriel stabs him in the head to keep him from reanimating.",
        "Killed Victims[]": "This list shows the victims Nelson has killed: Numerous counts of zombies and possibly unnamed people",
        "Appearances[]": "\" Outpost 22 \"",
        "Trivia[]": "This character is referred to as Trooper 141 by fellow soldiers in \" Outpost 22 \". Nelson shares many similarities with Nicholls , a member of the Reapers . Both men are mortally wounded and ask Gabriel to pray for them before their deaths. However, while Nicholls is seemingly delusional about his actions and how he tried to kill Gabriel's friends, Nelson shows genuine remorse and helps Gabriel and his group by giving them information about where their friends are. Both of them were also soldiers, though while Nelson became a soldier in the post-apocalypse, Nicholls was a soldier in the pre-apocalypse. Nelson is the last named character directly killed by Maggie Rhee in the TV Series . He is also the last named character to be directly killed by Gabriel Stokes , who put him down before reanimation.",
        "Name": "Nelson"
    }
]