[
    {
        "Pre-Apocalypse[]": "Not much is known about Troy's life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "At some point in the apocalypse, Troy joined a community called Hilltop Colony . Troy walks around Hilltop with another guard. In Hilltop, Troy is on guard duty atop wall, armed with a spear and keeping a lookout for any incoming threats. Troy walks in front of the Barrington House with another man. Troy and Quan escort Connie and Kelly back into Hilltop when the Whisperers suddenly arrive. Troy watches from the crowd as Ezekiel declares they've finally accomplished Rick, Carl, and Jesus' dreams of reuniting the communities. \"Let the fair of a new beginning begin!\" Ezekiel says as everyone celebrates and applauds. The next day, Troy listens from the crowd as Siddiq delivers the tragic news about the fate of the missing fair attendees, tells them how brave the victims were in their final moments and how he was intentionally kept alive to tell this very story. He encourages everyone to remember the fallen as brave heroes and to honor them. Troy is on guard duty at one of the gates and quickly opens it when Yumiko and a group of Hilltoppers decide to go out and dispatch zombies that have congregated outside the walls. After it is decided that the Coalition will evacuate the children and make a stand at Hilltop, Troy helps prepare for the battle against the Whisperers. He joins several dozen soldiers and militia on the frontlines and helps kill as many zombies as he can along the barbed wire fences. After getting the call to retreat, he and the others flee back towards the gates but are quickly stopped in their tracks as fire arrows ignite the walls and ground around them. Troy helps defend the Hilltop from the Whisperers and their horde as the settlement burns. However, Troy is among the Hilltoppers to have been killed in the battle and reanimate. The following morning, an undead Troy was seen shambling around the destroyed settlement as Whisperers scavenged nearby. When Aaron , Jerry , Carol , and Lydia return to Hilltop to scavenge for supplies, the undead Troy is found lodged underneath debris. Upon noticing him, Jerry alerts the others of Troy's presence, when the group realizes that among the zombies at Hilltop are their former friends and fellow Coalition soldiers. After the charred zombies are put down, a somber Aaron stabs the undead Troy in the head, putting him down for good.",
        "Death[]": "Killed By Alpha (Caused) Beta (Caused) The Whisperers (Alive) During the attack on the Hilltop Colony , Troy was burned alive by the Whisperers. Aaron (Zombified) Aaron puts down a zombified Troy by stabbing him in the head.",
        "Killed Victims[]": "This list shows the victims Troy has killed: Possibly some unnamed Whisperers Numerous counts of zombies",
        "Appearances[]": "",
        "Trivia[]": "Andrew Douglass and fellow Hilltop extra John Prozny were both chosen to portray the undead soldiers in \" Out of the Ashes \" as they were recurring core extras in Season 10 frequently seen as part of the coalition militia.",
        "Name": "Troy"
    }
]