[
    {
        "Tyler Davis": "Tyler Davis",
        "Overview[]": "Tyler is a rebellious individual who generally seems to have good intentions. He was a soldier for the Commonwealth and was quite friendly and open to Princess , helping to convince Princess to be honest about her group and their intentions. Tyler was respected and liked by General Michael Mercer who recommended him for early promotion, as noted by Connie . However, after getting beat up by Princess, Tyler is dishonorably discharged instead. He reveals that after this he had lost everything and could no longer provide for his family. He tried to contact Pamela but didn't get a response. Later, Tyler is seen trying to talk with Pamela face to face, but she ignores him. Tyler becomes angered by the inequality and corruption in the Commonwealth and causes a ruckus at the party. He takes Max hostage and confronts Pamela on who she truly is. Tyler immediately shows remorse and apologizes to Max before fleeing. When Daryl finds him, Tyler almost commits suicide but stops himself at the thought of his family. When Tyler later resurfaces at the Commonwealth prison camp at Alexandria , his enslavement seems to have driven all of the fire and hope from the young man and he refuses to join Negan and Ezekiel 's brewing revolt. Tyler suggests that he's been involved in or at least seen other revolts in the past which ended with good people dying, convincing Tyler that the only choices are survival by cooperating or dying by fighting back. However, after Ezekiel makes a stand to protect Negan and Annie , Tyler bravely joins a number of other prisoners in risking their own lives defending them, convincing Roberts and most of the soldiers to stand down. After joining the Coalition , Tyler expresses remorse for his past actions and does his best to help his new friends take down Pamela and find their missing children. While Princess is uninterested in Tyler's apologies, Magna , Kelly and Connie, who are pleased to have finally found Tyler, are more forgiving and understanding. Tyler ultimately dies redeemed for his mistakes, bravely leading the charge into Union Station where he meets his demise. Even though Tyler ultimately meets his demise, his efforts to help prove successful posthumously as Rosita , Eugene and Gabriel are able to find the missing children right where Tyler thought that they might be and rescue them. His dream of getting equality for everyone in the Commonwealth is also fulfilled with the overthrowing of Pamela and the creation of a new government led by Ezekiel.",
        "Pre-Apocalypse[]": "Nothing is known about Tyler's life prior to or as the outbreak began, other than he had a sister who may have had a child or children before the apocalypse.",
        "Post-Apocalypse[]": "At some point during the outbreak, Tyler joined a community in Ohio called the Commonwealth, along with his sister and possibly her child or children. Tyler appears at the Southern Train Yard where Eugene , Ezekiel , Yumiko , and Juanita are waiting for Stephanie . He and other members of the Commonwealth Army rush in pointing their weapons at them, demanding them to put their hands in the air and drop their weapons. Tyler and his fellow soldiers proceed to take Eugene's group into custody, splitting them up into train cars. Later that day, Tyler brings lunch to Juanita's train car when he is suddenly ambushed by her. Caught off guard, Tyler is disarmed and handcuffed before being questioned by Juanita. He explains that everything going on is standard procedure and to ensure the members of her group are trustworthy individuals before being brought back to their massive community . After beating Tyler, the hallucinating Juanita snaps out of her episode and apologizes for her actions, explaining that she has been suffering from PTSD, ADHD, and other disorders. He tells her that it doesn't matter anymore and that her group is being rejected, to which she pleads for another chance. Tyler agrees to try and help their case if she answered his boss ' questions. After listening to her answers, Tyler tells her that she can see her friends now and opens the train car door, revealing Eugene, Yumiko, and Ezekiel standing outside with black hoods over their heads. Tyler then suddenly puts a hood over Juanita's head and handcuffs her. Tyler appears at Pamela Milton 's private ball for the upper class of the Commonwealth as a waiter serving food, having been dishonorably discharged from the Commonwealth Army . Juanita immediately recognizes him as the soldier that she had ambushed in the train cars. During Pamela's speech where she states she cares for all the citizens of the Commonwealth, Tyler angrily interrupts her and accuses her of not protecting the lower class. When guards attempt to intervene, he holds Max at knifepoint. Pamela is able to talk him into releasing Max, and he flees the ball. Daryl Dixon catches up with him in the Halloween maze. Despondent over what happened, Tyler laments that he just wanted to talk to Pamela, but he was ignored for months. He states that him \"breaking protocol\" and being assaulted by Juanita resulted in him losing both his home as well as his job, leaving him with nothing to help provide his sister or her children with. He attempts to slit his throat with his knife, but Daryl is able to convince him not to do it, stating that his sister and her children are his biological family, something that not many people have anymore, and that he shouldn't abandon them. Tyler relents, and drops the knife. Daryl places him under arrest, and as he is being escorted back to the ball by Sebastian Milton so he can be taken away by the guards, Tyler shouts, \"resist the Commonwealth! Visibility for workers, equality for all!\" , and that there are thousands of resistors just like him in the Commonwealth, prompting Pamela to order a search in the lower class areas of the Commonwealth for potential rebels. While working for the Commonwealth's newspaper, Connie attempts to run a story about Tyler's actions at the ball. Her boss rejects the idea, and tells Connie to drop it. Later, Connie and Kelly visit the Commonwealth's hospital in an attempt to get an interview with Tyler, who is supposedly being treated for psychological issues, but are kept from entering his room by Commonwealth soldiers. Mercer looks at them through the door before shutting it. Connie and Kelly are sent out to report on Mercer and his soldiers' efforts to control a nearby herd of walkers. When Mercer finishes clearing the last of them, he walks over to Connie for a brief interview. Connie asks what Tyler has been charged with to warrant him being in the hospital for a month under armed guard. Mercer refuses to answer the question, as it isn't one of the questions \"they sent you.\" Later that day, when Mercer returns to the hospital, he finds that Tyler is no longer in his room, his bed vacant. When he is informed by the nurse that Tyler was moved to an undisclosed location without his authorization, Mercer angrily punches the wall and leaves. That night, while in their apartment, Connie and Kelly are slipped a piece of paper under their door with a list of names on it, the last of which is Tyler's. While working at the Commonwealth labor camp outside of Alexandria , Princess recognizes Tyler, who now has longer hair, amongst the workers. Princess points Tyler out to Ezekiel , reminding Ezekiel that Tyler had been at the railyard with them. Ezekiel remembers Tyler taking Max hostage and Princess tells Ezekiel that while she didn't say that she likes Tyler, \"he's got balls. Might be useful.\" Later, Ezekiel and Negan approach Tyler in the mess hall as he eats. Ezekiel tells Tyler that they know that he stood up to Pamela and wants out of there just as much as they do. However, Tyler tells them that he wants to live, but Negan tells Tyler that this isn't living, it's barely surviving. Ezekiel suggests that they can take the guards, their people and Tyler's and take control, but Tyler reveals that they've tried that before and \"the same thing always happens: people who shouldn't die end up dead.\" Tyler believes that they have only two choices: survival or death and that if they try this, they all die. Ezekiel tries to convince Tyler that they can try this and live and that they only have each other. If they lose faith in the idea that they change things, they're as good as dead anyway. After Negan is dragged away by two soldiers, Tyler tells Ezekiel that he's on his own and leaves. That night, Tyler and the other prisoners are brought before the mill to witness Negan's execution for plotting a rebellion with the Warden adding Annie in order to prevent Negan from becoming a martyr. When Ezekiel makes a stand to protect Negan and Annie, Tyler, despite his earlier refusal to help, joins a number of the other prisoners in standing with Ezekiel, positioning himself next to Nabila . The Warden orders them all to be executed, but Ezekiel is able to talk down a majority of the soldiers with Roberts killing Sanborn and Daryl subduing the Warden, retaking Alexandria from the Commonwealth. Alongside the other former prisoners, Tyler watches as Rosita feeds the Warden to a zombified Sanborn in revenge for the Warden refusing to tell Rosita where her missing daughter is. The morning after the rebellion, Gabriel asks Tyler if he knows anything that he can help them find the missing children. Tyler reveals that, when he was a soldier, kids without parents were taken to the city's children's home . However, Tyler doesn't know where it is and Gabriel orders him to find out so Tyler heads over to the captured soldiers to question them. On the train to the Commonwealth , Tyler helps Princess as she works on the long-range radio. Tyler recalls the last time that he was in a situation like this with Princess and apologizes for what he did, but Princess doesn't have time for it and she directs Tyler to hold the radio antenna through the roof of the boxcar. Watching Tyler, Connie has Kelly tell Tyler that she's happy that they found him. Kelly explains that they have been looking for Tyler ever since he disappeared after Pamela 's party. Sympathetic, Magna tells Tyler that society had thrown him away and he was just desperate and mad which she can relate to. Tyler admits that he had wanted Pamela to hear him, but that he shouldn't have hurt people to do it along with a lot of other things that he shouldn't have done. Through Kelly's translations, Connie tells Tyler that he can fix his mistakes. While Pamela wouldn't listen to him, soon the people in the Commonwealth will which cheers him up slightly. Tyler and Princess' efforts with the radio ultimately prove successful and Princess manages to contact General Michael Mercer on the radio. Tyler listens as Mercer agrees to help them and reveals that, if Tyler and the other prisoners can be brought to him, Mercer can use them as witnesses to have legal grounds to remove Pamela from power. Tyler joins the group that enters Union Station through Tunnel H. However, Daryl quickly deduces that something isn't right when no one is around and the doors are chained shut. Tyler calls out that they're almost there, but Daryl, realizing the trap, yells for everybody to get down. Pamela's men open fire, killing Tyler, an Alexandrian , and two former Commonwealth prisoners standing near him as everyone else scatters.",
        "Death[]": "Killed By Pamela Milton (Caused) Unnamed Commonwealth resident While leading the Coalition forces into Union Station , Tyler is shot in the chest and killed by a Commonwealth resident in a trap set by Pamela.",
        "Killed Victims[]": "This list shows the victims Tyler has killed: Possibly numerous counts of zombies and unnamed people",
        "Quotes[]": "The following is a list of some of Tyler's most memorable quotes.",
        "Appearances[]": "",
        "Trivia[]": "Tyler is credited as Trooper in \" Splinter \". In \" Trust \" and \" Acts of God \", Tyler's name can be seen on the list of names retrieved by Max from Pamela Milton's office. In \" Faith \", it's revealed that Tyler disappeared because he was forced to work at the labor camp in Alexandria . In \" Rest in Peace \", the information that Tyler had shared with Gabriel allows Gabriel, Eugene and Rosita to find and rescue the Coalition 's missing children. Tyler is the final named living character to be killed in a way that does not involve walkers in any way, shape, or form, as he was shot several times and died.",
        "Name": "Tyler Davis"
    }
]