[
    {
        "Overview[]": "Vickers is a stoic and brave woman who initially blindly follows orders. However she eventually chooses to do the right thing. At first, she is loyal to Pamela Milton and does whatever she tells her to, including arresting Michael Mercer . Vickers doesn't listen to Mercer's warnings about Pamela and the herd at first, although she eventually starts to see Pamela's dark side. When Pamela orders Vickers to lead the herd to the lower wards, Vickers questions her since it would lead to the deaths of many innocent civilians, showing a great deal of horror at the idea despite ultimately going through with it. When the citizens escape and try to get into the Estates , Vickers is ordered to shoot anyone who attempts to let them in and allows her men to shoot a few of the people that try to climb over the gates. However, after Gabriel and Daryl try to make everyone see sense by pointing out that the true enemy is the undead, not each other, Vickers realizes that they're right and stands down, deferring to Mercer's command once again. Following Pamela's defeat and arrest, Vickers puts aside any animosity towards the Coalition to work side by side with her former enemies to save the Commonwealth.",
        "Pre-Apocalypse[]": "Nothing is known about Vickers' life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "At some point during the outbreak, Vickers joined a community in Ohio. As Daryl and Carol chat outside the police headquarters, Colonel Vickers walks by and asks Daryl if he's reporting to work, suggesting that he's late. Once inside, Colonel Vickers addresses a group of soldiers on what their assignments will be for the day. After her announcement, she returns to her office as soldiers head out on patrol duty. During the press conference, Vickers stands beside Pamela Milton who asks her if Vickers has any updates on the escapees. Vickers reassures Pamela that the Commonwealth Army has their best people on it and teams are sweeping every quadrant, something that Yumiko overhears. As Yumiko walks past Vickers to the podium, she overhears a transmission on the Colonel's radio revealing that Alpha Squad has been found dead in Quadrant 3 and that Daryl , Carol and Lance Hornsby have escaped. Vickers silently watches Yumiko's speech and her departure. An angry crowd gathers outside of Union Station , demanding answers from the government. In her office, Pamela is furious that Mercer has no idea how Eugene got away and Mercer simply states that Eugene clearly had help. Looking towards the window, Mercer notes that a lot of people are unhappy about the guilty verdict, leaving a large possible suspect list that will take some time to narrow down. Mercer pointedly tells Pamela that there have been reports of people going missing in the Commonwealth for awhile which they don't have many answers for, but maybe they'll get lucky this time. Pamela orders Mercer to just do his job before more people get hurt and he departs without another word. Left alone, Pamela orders Vickers to keep an eye on Mercer and to begin a door-to-door search for Eugene. If Eugene is found, he is to be shot on sight. Vickers asks if Pamela wants the army to try to disperse the crowd, but Pamela refuses, stating that they'll find some bones to throw them instead and options are in place to deal with it if things escalate. Once Vickers is gone, Pamela grabs a radio and simply orders \"B17.\" In Mercer's office at the Police Department of the Commonwealth Army , Yumiko is interrogated by Mercer and Vickers about Eugene's escape. Yumiko plays along with Mercer's questions while defiantly telling Vickers that if she knew where Eugene was, she'd be with him rather than being interrogated by the two. A confused Lieutenant Rose interrupts with the news that someone named Aurora is trying to raise Mercer on the radio and he states that he will take it in his office, dismissing Yumiko and Vickers. Outside, while the Commonwealth Army is preparing to fight an incoming herd , Mercer notices Vickers patrolling nearby as he talks with his sister and sends Lieutenant Rose to distract her. Mercer tells Max that he was supposed to go meet them himself, but if Mercer can get them in, Max and Yumiko have to go meet them in Union Station. Anton brings the news that the vehicles are ready to roll and asks if this is everyone which Mercer confirms it is for now. Hugging his sister, Mercer orders her to keep the others hidden until he gets back and drives off with his men. Staying behind, Vickers looks between Mercer and Max suspiciously. Pamela receives a report from Vickers that Mercer has only seen his sister and then reported to the wall. Although Mercer just pulled additional backup to deal with the horde, Vickers considers it to be nothing unusual. Intrigued, Pamela asks where Mercer took them from and Vickers informs her that it was from Sector 7, Processing and Tunnel H. Claiming that she's sure that Mercer has his reasons, Pamela rejects Vickers offer to recall those troops. As Mercer gives orders to his men, Vickers arrives with some of Pamela's private forces, announcing that Mercer is under arrest for treason. As Mercer's men move to defend their general, Vickers warns that any resistance will be met with life in prison or death. Mercer orders Lieutenant Rose and his men to lower their weapons and agrees to go, but he tells Vickers that she needs to fortify the city's defenses before the herd reaches the perimeter. Vickers tells Mercer that Pamela insists that the walls will hold, but Mercer tries to warn his former subordinate that there's something strange going on outside and she has to listen to him because this is bigger than Pamela's bullshit. Mercer is led away, calling to Vickers that she has to stop the dead before it's too late. In her office, Pamela cleans her face of blood when Vickers arrives with the news that the perimeter has been breached, Section F is overrun with the undead and they've lost 15 troopers and more civilians. \"The dead are in the Commonwealth, Governor,\" summarizes Vickers. Pamela is confused as this was only meant to be a standard lockdown while the walkers were cleared out, but Vickers reveals that the dead are climbing the walls and flooding in. As Pamela is overwhelmed by shock, Vickers suggests making a stand to stem the spread and maybe save a big portion of the city, although Vickers admits that it's a long shot. However, Pamela orders Vickers to pull all of their forces back to the Estates instead and to place additional troops at her home and secure the surrounding area. Pamela instructs Vickers to divert the herd towards the lower wards which will buy Vickers time to gather essential personnel, selfishly prioritizing saving the Commonwealth's elite and essential personnel over protecting her people as a whole. A horrified Vickers points out that that would leave thousands of people unprotected and it will be a death sentence for them, but Pamela is only interested in saving herself and a select few. Pamela orders only the Estates to be protected and for the rest of the city to be sealed off and left to the undead. Vickers commands the soldiers protecting the Estates as the Commonwealth is overrun by the herd . When the Coalition and Mercer 's loyal troops arrive, they enter into a standoff with Vickers and her men, but Vickers relents after realizing that Daryl is right that they're all on the same side. Vickers defers to Mercer who places Pamela under arrest for high crimes against the Commonwealth. After Pamela is overthrown, Vickers joins Ezekiel , Jerry , and some of her men in retrieving the fuel they need from the depot for the plan to destroy the horde.",
        "Killed Victims[]": "This list shows the victims Vickers has killed: Numerous counts of zombies",
        "Appearances[]": "",
        "Trivia[]": "Vickers is the last named character to become an antagonist, the last named character to reform from their antagonistic ways, and the last secondary antagonist of the TV Series . She is also the only secondary antagonist to survive the series.",
        "Name": "Vickers"
    }
]