[
    {
        "Virgil": "",
        "Overview[]": "Virgil is described as \"a highly intelligent and resourceful man who is desperately trying to get home to his family.\" [1] Despite initially coming off as well meaning, Virgil is actually in quite a fragile state of mind, consumed by the loss of his family. Driven to insanity by grief and guilt, Virgil went as far as to imprison his former colleagues to prevent them from leaving him, although he later realized that his actions were wrong and wished to release them. To cope with his loss, Virgil began to consume large amounts of hallucinogenic tea, which allowed him to see his family again. Following his encounter with Michonne , Virgil becomes remorseful for his actions and, despite initially deciding to stay on Bloodsworth Island , he eventually returns to Oceanside in search of other survivors. He later cares for Connie and even tries to sacrifice himself so that she can survive the Ferals . Virgil's selfless efforts to help Connie keep her alive during a rough time in her life, eventually allowing Connie to reunite with her friends and family.",
        "Pre-Apocalypse[]": "Nothing is known about Virgil's life prior to or as the outbreak began, except that except that he was married to Lisa and had two children, Jasmine and Bobby . He also worked as a researcher on Bloodsworth Island alongside Jeremiah and Celeste .",
        "Post-Apocalypse[]": "At some point after the outbreak, Virgil and his family settled in a naval base on Bloodsworth Island in Tangier's Sound in Chesapeake Bay. Being fairly isolated, the island began to thrive as a community for survivors. Unfortunately, as more and more people began to show up, supplies started to run low. This eventually led to a fight where someone was stabbed to death. Panicking, Virgil locked all the doors of the building where the riot was taking place, not realizing his family was trapped inside as well. Accidentally causing the death of his family drove Virgil mad, leading to him locking his former colleagues in a room so they couldn't leave him. At some point after the riot, Virgil left the island to look for supplies, but was left stranded and had been looking for a way to return back ever since. Virgil searches for a boat he can use to sail back home until he eventually finds a community on a nearby beach. He tampers with the security system and spies on the residents while coming up with a plan to steal one of the boats. Virgil looks for supplies in a library and finds a book titled \"The World Before\", which he decides to take along for his daughter. When Luke is attacked by a couple of walkers, Virgil saves his life and then flees from the place in a rush. Later that day, he is captured in Oceanside by the residents and begs he simply wants to get back to his family. While Rachel threatens to kill him for messing with the security system, Luke tries to defend him for saving him earlier that day. Michonne Grimes draws her sword and demands he answers her questions. When walkers suddenly invade, Virgil tries to escape but is slashed in his leg by Judith and falls. He is then tied up to stop further escape attempts. That night, Virgil wakes up after being stitched and attempts to stop Judith from reading the book he is bringing for his daughter before Michonne arrives to question him. He claims he was only looking for supplies and now wants to return home. When she asks why he saved Luke, Virgil says that mercy is in short supply these days, which triggers a memory in her. He then reveals to live with his family on a fortified island that is hard to find. They make a deal in which Michonne will help him get back to his family in exchange for weapons. The next day, Michonne gives Virgil the backpack he had left behind in the library and tells him that the weapons will pay off his debt to Oceanside. He accepts the offer and they introduce each other before shaking hands. They then sail away on a boat towards the island. Virgil and Michonne have finally arrived to Bloodsworth Island after 5 hours of travel. Virgil complains about being tied to the railing during the trip, but Michonne pays him no mind. Virgil takes her inland, where he claims both the weapons and his family are located. On the way, he stops to pick flowers and herbs to make tea, much to Michonne's annoyance. Wishing to retrieve the weapons as soon as possible, Michonne asks if there are any in the building adjacent to them, but Virgil says this is just an old lab, adding that it's best to stay away due to the wildlife infestation. Further on, the pair arrive to an empty camp. Suspicious, Michonne notes that none of Virgil's family is there. When Virgil becomes evasive, Michonne pulls her sword on him and threatens him into telling the truth. Virgil obliges and takes her to three empty graves, revealing his family to be dead. Angry at Virgil's half-truths, Michonne storms off to find the weapons herself, but stops when Virgil blurts out the island isn't clear. He claims that the island was invaded by a group who brought violence and disease, the latter of which killed his family. He asks for Michonne's help to put his family down, explaining that he never really got good at killing walkers since the island is quite isolated. Michonne reluctantly agrees. The pair sneak into the walker-infested building through a back door. It isn't long before they are forced to squeeze through a makeshift barricade. While Michonne is successful, Virgil gets stuck and accidentally knocks the barricade over, alerting the walkers to their location. Michonne pushes the walkers back with a stretcher, before instructing Virgil to stay behind it while she takes care of the walkers. After Michonne successfully kills all of the undead, Virgil finds his reanimated family hanging from the ceiling in another room with a bunch of others, having committed mass suicide. Virgil tearfully puts his wife's shoe back on, then allows Michonne to put his family down. After Virgil buries his loved ones, Michonne expresses her condolences, but is anxious to resume the search. Virgil says that it's late, meaning the tide is too low for the boat to travel though the channel. When Michonne remains adamant, he adds that its getting dark and some of the buildings aren't safe. He offers to resume the search in the morning, which Michonne reluctantly agrees to. When she enters a room, Virgil suddenly appears behind her and slams the door, locking her inside. He chastises Michonne for breaking their trust, before slamming the shutter on the door's window and walking away. Later, Virgil opens the shutters and tells Michonne he is glad she ate. Michonne orders him to open the door, but Virgil declines, as he knows she will kill him if he does so. He tells her that he doesn't want to fight, just wants her to understand, explaining that the island has a gift and that it can help her the same way it helped him. At this point, Michonne begins to hallucinate. When asked what he did to her, Virgil reveals that he made her hallucinogenic tea using Jimsonweed. He believes Michonne to be in pain like himself, and wishes to cure her. Michonne denies being like Virgil, but the latter cuts her off, revealing that they've already had that conversation three times. Michonne pleads with Virgil to think about her daughter and son, but Virgil says that no one listened to him when he said the same thing, and goes on to state that everything he did was for his family. Michonne laughs at this and makes a snide remark, but is surprised when Siddiq replies to her instead and asks about his child. As Michonne's hallucinations continue to get worse, Virgil smiles and tells her she is no angel. Finally sobering up from the tea, Michonne throws up in a bucket. Virgil asks if she is feeling better while offering a glass of water. Michonne drinks, before grabbing a fork off the tray and suddenly stabbing Virgil in the calf. As they struggle, Michonne is able to disarm Virgil, but he is able to get away. Michonne quickly frees the other prisoners. Together, they run to the boat, only to find that Virgil has set it ablaze. It isn't long before the former captives catch up with Virgil. As Michonne tackles him and puts a knife to his thorat, Virgil explains that he was originally going to ask Michonne to help him release the prisoners, as he wanted to let them go but needed Michonne to keep them from killing him. Once Michonne discovered them on her own, however, Virgil realized she would join forces with them to kill him, so he needed to take her captive as well. Virgil apologizes, but Jeremiah doesn't accept his apology and spitefully steps on his injured leg. Virgil goes on to state how he was lost after his wife died and couldn't let the prisoners leave, but didn't want to kill them either. The prisoners urge Michonne to kill Virgil. Michonne considers it, but seeing the sorry state of her former captor, she ultimately relents. She tells the others that Virgil owes them more than he can ever repay, but by killing him, they will lose more of themselves. Showing mercy, however, will bring them peace. Lucy proceeds to knock Virgil out. Virgil wakes up in one of his cells. Michonne brings him some water and angrily tells him that she checked every building on the island and found no weapons. Virgil points out that he never lied to her about the weapons, and only said that he'd show her the spots where they could be stored, although he admits he never went inside these buildings because he didn't need to, adding that he never found anything other than a stray shell here and there. He offers Michonne a chance to take anything else she wants instead. Michonne spitefully throws him a bottle of water, before asking him what he sees when he is tripping on his tea. Virgil says that he sees his family alive again, which he describes as heaven. He tells Michonne that he wanted her to experience something similar. Michonne, however, reveals that the tea took her family from her, and she saw hell instead. Virgil apologizes, explaining that the only world he ever wanted to live in was the one with his family in it, but doesn't know how to go on without them. Michonne tells him he needs to try, like everyone else, before ordering him to show her his stuff. Obliging, Virgil takes her to a closet with various equipment inside. As she looks through the shelves, she spots a pair of boots, which she immediately recognizes as Rick's. After a moment of shock, Michonne suddenly pins Virgil to the wall and interrogates him about where he got the boots. Virgil takes her to a boat that washed up ashore during a big storm. Michonne frantically searches through the journals aboard, before discovering an iPhone with an engraving of her and Judith. Michonne cries tears of joy upon realizing Rick survived the explosion, but turns her attention towards Virgil a few moments later. She thinks he came to find them at Oceanside because of the engraving, despite Virgil's claims that he'd never seen it. Furious, Michonne interrogates him about what he did to Rick, but Virgil has no idea who she's talking about. After Michonne relents, Virgil offers help restore the boat to working order if the others would help him. Later, as the others pack up, Michonne informs Virgil that the others are willing to let him come along. Virgil is surprised by this, and considers it for a moment, but ultimately decides to stay on the island to be with his family. Virgil arrives at Oceanside only to find the community abandoned. He wanders around the area and eventually finds a horse. Sometime later, Virgil now on horseback encounters a worn out Connie who has managed to survive the cave collapse and Alpha's horde of walkers. Virgil and Connie flee from something in the woods. Virgil suggests they seek refuge in a nearby house, but Connie insists they keep running. They sense something approaching and run. Virgil and Connie race up to a house. Connie pushes the front door open, and they hide inside. Walkers swarm the front door. Virgil and Connie search the house and reconvene in the living room. Virgil tells Connie that the house is empty, but Connie shakes her head. Virgil reminds Connie that she hasn't slept in days and urges her to sleep, but Connie worries that the house is unsafe. She decides to search the house again. Connie searches the house. She opens a medicine cabinet and sees a pair of wild eyes staring back at her through a slot in the wall. She races back to Virgil and tells him they're not alone. Virgil checks the medicine cabinet and doesn't see anything. He wonders if Connie was hallucinating. Connie refuses to stay in the house and leaves the room. Someone slams a door behind her, cutting her off from Virgil. A feral human scrambles toward her on all fours. Connie flees into a room and slams the door behind her. The feral bangs against the door. Virgil escapes into a room and slams the door shut. A feral pummels the door on the other side. Connie peers through a hole in the wall and sees Virgil in the next room. She pounds on the wall, drawing Virgil's attention. A feral sneaks up on Virgil and attacks him. Virgil fights the feral. \"Hungry!\" it screeches. Connie pounds on the wall, momentarily distracting the feral. Virgil stabs it in the chest. Connie continues pounding on the wall. Virgil plunges his knife into the wall, nearly stabbing Connie. Connie punches her arm through the wall. Virgil realizes that it's Connie and pulls her through. Injured and weak, Virgil gives Connie his knife and urges her to make a run for it. Connie refuses to abandon him. They hear the creatures stir upstairs and rush out the room with weapons blazing. Ferals attack from all directions and Virgil is stabbed by one of them. Getting an idea, Connie covers herself in walker guts then flings the front door open, letting all of the walkers inside. The walkers devour the Ferals while ignoring Connie, who is blocking Virgil in a corner with her own body, and Virgil due to the walker guts. Virgil and Connie stumble outside and collapse. Two ferals escape from the house, but Kelly kills them with her slingshot and reunites with her sister. At night, as a storm rages outside, Connie tends to the injured and sleeping Virgil. Later, after the storm blows down a panel of the defense wall and starts a fire that is drawing a herd , Virgil offers to help Aaron and Magna fix the wall. However, the others object since Virgil can barely stand with his injuries. Instead, Rosita convinces Virgil to stay in the house with her and help to keep anything from getting in. Later, sitting across from Judith , Virgil tells Judith that Michonne would be proud of her. Judith asks if Virgil knows where her adoptive mother went, but he doesn't. Judith wishes that Michonne were there, having not heard from her in a long time. Virgil tells Judith that he can see Michonne in how Judith holds her sword and in her courage and he reassures Judith that her mom is still with her \"and you can bet that wherever she is, you're with her.\" Virgil's words cheer up Judith slightly before Gracie 's practice with Judith's sword draws walkers to the house. Judith and Virgil put the walkers that reach through the window for Gracie down and Lydia , Dianne , and Rosita quickly rush in to board up the window. As walkers swarm the house and Rosita heads outside to buy them some more time, Virgil keeps Judith and Gracie behind him in an effort to protect the two girls. Later, as everyone retreats upstairs, Judith goes to help Virgil, but he insists on Judith worrying about everyone else. Judith refuses to leave the injured Virgil to make the trek himself and begins helping him upstairs before Dianne takes over. Several months after the storm in Alexandria, and following most of the group moving to the Commonwealth, Virgil has not been seen or mentioned in that timeframe, or even a year later after Pamala's defeat. He is not shown living at the Commonwealth, nor is he seen at Alexandria, leaving his status unknown. Given his state at the time of the storm, Virgil may have ultimately succumbed to his injuries from the Ferals .",
        "Killed Victims[]": "This list shows the victims Virgil has killed: Lisa (Caused, Accidental, Alive) Jasmine (Caused, Accidental, Alive) Bobby (Caused, Accidental, Alive) 27 unnamed Bloodsworth Island residents (Caused) 2 unnamed feral survivors Numerous counts of zombies",
        "Appearances[]": "",
        "Trivia[]": "In an early draft of \" On the Inside \", Virgil would've been secretly bitten and eventually reveal it to Connie, using his little time as his motivation to get her out of the house.",
        "References[]": ""
    }
]