[
    {
        "Overview[]": "Very little is known about Wade, except that he is a high-ranking member of the Saviors and is very loyal to them. He is the Savior to lead the hunt for Dwight , Sherry , and Tina and is extremely condescending when they find them. However, he does seem to care about the lives of his men and is willing to retreat if it means saving them. After one of his men, Cam , is bitten by a walker, Wade quickly comes to his aid and amputates his arm, before calling off the mission despite how close they are to capturing Dwight's group. He also has a somewhat sarcastic and monotone attitude, telling the Savior on the radio they're leaving because, \"Cam got a boo-boo,\" and tells Cam to walk it off.",
        "Pre-Apocalypse[]": "Nothing is known about Wade's life prior to or as the outbreak began.",
        "Post-Apocalypse[]": "At some point in the apocalypse, Wade somehow came into contact with a group named \"the Saviors\" which he subsequently joined upon where he was appointed as one of Negan's personal lieutenants. Over time, Wade aided his group in terrorizing other survivors and communities around the area into subjugating to Negan's will, where their victims would be forced to give half their supplies in exchange for not being murdered. Wade is the leader of the search party hunting for Dwight , Sherry , and Tina . While looking for them, Cam , a member of his party, is distracted by Daryl and gets bitten on the forearm by a walker. Wade then amputates Cam's arm and takes him away after taking his watch as well. In the many skirmishes against the Saviors, including the various battles during the All Out War, hundreds of Saviors have been killed. While Wade has not been seen since the incident in the woods, it can be assumed he was killed during the war at some point by the Militia.",
        "Death[]": "Killed By The Militia Wade is among the Saviors killed by the Militia during either, the Hilltop counterattack or during Eugene's bullets malfunction.",
        "Killed Victims[]": "This list shows the victims Wade has killed: Cam (Alive) Numerous counts of zombies and unnamed people",
        "Appearances[]": "\" Always Accountable \"",
        "Trivia[]": "Oddly, his face is never seen in any shot, despite his on-screen presence. According to Darin Cooper , Scott Gimple promised that he would make a return as Wade in Season 7 . However, this never happened. [1]",
        "References[]": "",
        "Name": "Wade"
    }
]