[
    {
        "Overview[]": "Welles is a brave soldier who wants the best for his men. During the initial outbreak, Welles mentions the traumatic experience he and his fellow soldiers had to go through, such as being forced to abandon their post after a man got bit. Later, after his helicopter crashes, Welles ends up being the only survivor and is taken back to Woodbury . He is saddened to hear the deaths of his fellow soldiers Sean and Franklin , and also gives the location of his group's camp to The Governor so he can take them back to Woodbury. Though Welles did this with good intentions, this ends up getting his men killed since the Governor instead has all of them gunned down.",
        "Pre-Apocalypse[]": "Little is known of Welles' life prior to or as the outbreak began. He was in the National Guard.",
        "Post-Apocalypse[]": "Sometime after the initial outbreak, Welles, among other National Guardsmen, was stationed at a fortified refugee center to help protect those inside. Days before the events of the episode \" Walk With Me \", one National Guardsman was bitten by a walker inside the encampment. Panicked individuals opened one of the gates to escape, allowing walkers to overrun the encampment. Welles and ten other National Guardsmen, among them being Sean , Franklin , Wilson , and Brady , escaped the chaos and traveled for about sixty miles before they were blocked by a jammed highway (which may have been the same highway that prevented Rick Grimes ' group from reaching Fort Benning and detoured them to Hershel Greene 's farm ). Welles, Sean, and Franklin then took their helicopter out to scope the landscape ahead. Welles is first seen piloting a helicopter, with Sean and Franklin also on-board. Mid-flight he loses control of the helicopter and it crashes, killing his two passengers and severely wounding him. The Governor arrives at the scene and, with his crew, drags him out of the wreckage and brings him, along with Andrea Harrison and Michonne Hawthorne , who were watching the scene nearby, to Woodbury . He is then placed in a hospital bed and put into the care of Dr. Stevens , while the Governor questions him about where he came from and where his group is located. Welles informs the Governor about the events surrounding the overrun encampment, his convoy, and the helicopter crash. Welles reveals to the Governor the location of his convoy after being assured by the Governor that they would be rescued and brought to Woodbury, but is betrayed and later killed, with his decapitated zombified head being placed in one of the Governor's fish tanks , along with several other peoples' decapitated heads. Welles is amongst the heads that Michonne discovers in the Governor's fish tanks. Noticing the zombified Welles, Michonne realizes what kind of man the Governor is. Later, Andrea notices the fish tanks, though it is unknown whether or not she notices that the head of Welles is part of the collection.",
        "Death[]": "Killed By Helicopter Crash (Caused) Welles is found alive, though severely injured, after the helicopter he was piloting crashed into the woods. Philip Blake (Alive, Direct or Caused) Woodbury Soldier (Alive, Possibly, Direct or Caused) Welles is taken back to Woodbury and is interrogated by the Governor. After he tells him the location of his fellow soldiers, Welles is killed on the Governor's orders or by himself personally. His decapitated head is then placed into one of the Governor's fish tanks, where he then reanimates. Andrea Harrison (Zombified) Welles' zombified head was presumably put down by Andrea following the Governor's fight with Michonne, as it is never seen again afterwards.",
        "Killed Victims[]": "This list shows the victims Welles has killed: Franklin (Alive, Accidental) Sean (Alive, Accidental) Wilson (Indirectly Caused) Brady (Indirectly Caused) 6 unnamed U.S. Military Soldiers (Indirectly Caused) Possibly numerous unnamed enemy combatants (Pre-Apocalypse) Possibly numerous counts of zombies and unnamed people",
        "Appearances[]": "\" Walk With Me \" \" Made to Suffer \" (Zombified)",
        "Trivia[]": "This character is incorrectly credited as Sgt. Welles on the AMC website for \"Walk With Me\", despite being referred to as a lieutenant in the episode. In the novel The Fall of The Governor , a Fox News producer named Christina appears whose fate is similar to that of Lieutenant Welles'.",
        "Name": "Welles"
    }
]