[
    {
        "William Milton": "William Milton",
        "Pre-Apocalypse[]": "Nothing much is known about William's life prior to the outbreak, except that he was from a family political dynasty similar to the Kennedy family and the Bush family . William and his brother reportedly had reckless, irresponsible behavior in young adulthood before shaping up into the men they would become. William later had his daughter, Pamela , and was elected President of the United States in 1980. His chauffer's son, Lance Hornsby , grew up alongside Pamela and became close. After his presidency, William and his family relocated back to Ohio . Pamela attended Harvard and became an influential socialite that participated in political and philanthropy circles, often working with Ohio Senator Deanna Monroe . She later gave William two grandsons, including Sebastian . William's brother served in Congress, but was engaged in corruption and possible other crimes. Shortly before 2010, investigative journalist Connie exposed his brother's corruption and had him removed from office and imprisoned.",
        "Post-Apocalypse[]": "As the world quickly fell to the undead, William was placed within a secured city in Ohio along with his daughter, Pamela, and her two sons. With his political ambitions, William quickly founded and led what would later be called the Commonwealth . Society was soon reestablished, but with it the same societal issues from before such as classism and police brutality within a capitalist, autocratic oligarchy. At some point during the post-apocalypse, William died. Pamela then took over as Governor of the Commonwealth. At the Halloween masquerade ball in the train station for the city's wealthy class, a painting of the former US President by resident Alexa Park was unveiled as Pamela gave her speech honoring her father. When server Tyler Davis takes the Governor's secretary Max Mercer hostage with a knife, he slashes at the painting, ruining it. William's voice is heard when Pamela and Sebastian are listening to his speech. Pamela scolds Sebastian to live up to the Milton legacy and show he is William's grandson. Later, William's speech is supposed to be played after Sebastian's, however it is instead swapped out with Sebastian ranting about the true corruption in the Commonwealth.",
        "Death[]": "Killed By Unknown Cause William died through unknown causes.",
        "Appearances[]": "\" A New Deal \" (Voice Only) \" Rest in Peace \" (Photograph)",
        "Trivia[]": "William Milton is the first President of the United States mentioned in the TV Series ; albeit fictional. It is assumed that he has served between 1981 and 1989, and was succeeded by his Vice President, who won the subsequent election, but was then defeated by Bill Clinton. It is the second time in The Walking Dead Television Universe that a President has been mentioned, with Madison Clark mentioning she voted for Bill Clinton in Fear the Walking Dead . President William Milton is featured on a coin, presumably a quarter, from the year 1982 in \" Acts of God \". Seeing how William was president in the year 1982, it's possible he was elected president instead of Ronald Reagan, who likely served as an inspiration for William Milton and his policies regarding capitalism and class within the Commonwealth. William Milton's death is the first known death to occur at the Commonwealth for a named person, albeit off-screen.",
        "References[]": "",
        "Name": "William Milton"
    }
]