[
    {
        "Yumiko Okumura": "Yumiko Okumura",
        "Overview[]": "Yumiko is a weary, yet capable, fearless warrior, skilled with a bow. She is a fighter and a protector, but she's thoughtful and knows how to keep a level head. She is fiercely loyal to her ex-girlfriend Magna and the rest of her group whom she considers family and would do anything for their well being, including putting herself in danger and breaking the rules, acting as a motherly figure to them. After moving to the Hilltop , Yumiko starts exhibiting leadership qualities. She's very pragmatic, able to keep calm and collected come up with a reasonable solution. After the fair massacre, due to Tara 's death, there is a severe lack of leadership in Hilltop. This prompts Yumiko to step up and become a member of the council . However, this leads her to butt heads with Magna, the former leader of their group. Unlike Magna, who still refuses to completely trust the Hilltop, Yumiko fully trusts her new comrades, and becomes displeased and disgusted at Magna stealing some supplies after several members of the community were injured when a tree was knocked down by the Whisperers . Eventually this leads to the end of their relationship, though they still are on good terms. Yumiko is shown to have good relationships with the majority of the group and is generally very friendly with others. Though she isn't willing to call people out, such as punching Carol for what she did to Magna. Later, Yumiko goes with Eugene and Ezekiel to Stephanie 's location, where they come across Princess . Yumiko is the most untrusting of her, believing her to be crazy. However, eventually Yumiko sees that Princess is a good person and offers her to join the group, which she accepts. At the Commonwealth , Yumiko is shown to be extremely observant and analytical. Despite not having even seen what the community is like, Yumiko correctly deduces that it's a large community, with a bureaucracy. Yumiko ends up becoming a lawyer at the Commonwealth, since that was also her profession before the outbreak. This causes her to become far more privileged than a lot of her other companions. She also reunites with her brother, Tomi , who she assumed was dead. She is shown to be confused as to why Tomi doesn't choose what the life of a surgeon would bring him despite his insisting that he is happy where he is. Yumiko ends up accidentally outing him, causing Tomi to become a surgeon again. Her differing view of life in the Commonwealth puts her at odds with Magna and her former companions at times as Yumiko is unable to see just how bad the class disparity is due to her more privileged position, a position that results in Yumiko dressing in more fancy clothes unlike her friends who typically keep their old outfits. However, as more and more comes out about the Milton's wrongdoing, Yumiko begins to help her friends in secret, supporting their efforts to expose Sebastian's crimes while using her position as Governor Pamela Milton 's personal lawyer to try to diffuse the situation from the inside, although she angrily confronts the governor over her use of tear gas on Yumiko's friends. Yumiko plans to help her friends escape if need be, but she herself plans to stay at the Commonwealth in order to protect her brother. Pamela's abduction and disappearing of Yumiko's friends snaps the last of Yumiko's restraint towards the corrupt governor and fully restores Yumiko's rebelliousness. Although blackmailed into being the prosecutor in Eugene's trial, Yumiko instead turns the tables on Pamela, publicly declaring Eugene's innocence, unjust persecution and her intention to act as his defense attorney instead while reminding the people of the Commonwealth just how important her brother is so that Pamela can't just retaliate against Tomi. Pamela, who is used to being on top in such situations, is left shocked by the turn of events and Yumiko visibly enjoys dropping a taunting remark as she walks away. As Eugene's defense attorney, Yumiko shows herself to truly have a brilliant legal mind, using the trial to both showcase Eugene's innocence and Pamela's corruption to the point that it fans the flames of unrest in the Commonwealth, which was Yumiko's intention. When the Commonwealth is overrun by a massive herd , Yumiko doesn't hesitate to take up arms once again against both Pamela's forces and the walkers to save the Commonwealth and its people, although she is devastated by the loss of Luke . Following the defeat of Pamela, Yumiko repairs her romantic relationship with Magna and eventually marries her with the two enjoying life together in the Commonwealth a year later.",
        "Pre-Apocalypse[]": "Not much is known about Yumiko's life prior to or as the outbreak began, except that she had a brother named Tomichi and grew up in England with a father who has high expectation from his children. She eventually achieved her Honours degree at the Faculty of Law, University of Oxford. After her success at Oxford, Yumiko moved to the United States where she studied at Harvard Law School. At some point, she was also arrested at a student protest. Years later, she became an U.S. citizen and a criminal defense lawyer where she met and formed a romantic relationship with her client, Magna , who was accused of murdering her cousin's rapist. Despite Yumiko believing her client innocent, Magna did indeed kill a man in revenge for raping her female cousin. The jury found Magna guilty and sentenced her to prison. Yumiko maintained her relationship with Magna and her belief that she was innocent.",
        "Post-Apocalypse[]": "At some point after the outbreak, Yumiko and her girlfriend Magna met siblings Connie and Kelly , Luke , Bernie , among other survivors. The group survived for several years, eventually becoming closer and seeing each other as family. However, as the years went by, several members of the group died. The group resided in different communities, such as Jones Springs and Coalport , both which eventually fell causing the group's distrust in rejoining any other similar settlements. In the woods, Magna 's group take on a herd of walkers . They quickly get overwhelmed and Yumiko injuries her head while protecting Connie , but they get saved when the walkers around them get shot from the trees. Yumiko and the group escape into the woods to find a 9 year old girl who asks for their names. They introduce themselves and ask what her name is. The girl picks up her hat and introduces herself as Judith Grimes . In the woods, Yumiko and the group follow Judith as she leads them to Rosita , Eugene , Laura , and Aaron . Wanting to take them in, Judith declares she won't return to Alexandria until they accept them. The others reluctantly agree. Later, Yumiko and the group arrive at Alexandria's gates and Judith assures them they'll be safe. They get escorted inside, where Gracie runs over to Aaron. Rosita updates Siddiq on Yumiko's condition and he escorts her to the infirmary. Magna tries to tag along but is stopped by D.J. After the rest of her group are questioned by the council, Yumiko is visited in the infirmary. The next day, Yumiko and the group prepares to leave by thanking everyone for their hospitality. Yumiko jokingly comments that if she knew they were going to leave, she would have hit her head harder. Michonne rides up and says she's going to instead escort them to Hilltop with Siddiq. On the road to Hilltop, Siddiq tells Michonne she should have let Magna's group stay in Alexandria, but she says she still doesn’t trust them and is only doing this for her daughter. In the cart, Magna complains to her group that Michonne has her knives and she wants them back. Yumiko tells Michonne she's just upset about their lost friend, Bernie. A while later, Michonne and the others arrive at Magna's giant crate of supplies, which have been displaced and destroyed by walkers. Magna's upset at the sight of Bernie's things while Michonne instructs D.J. to gather more of their weapons. This angers them, and Michonne also announces she's returning to Alexandria in the morning while Siddiq and D.J. help them finish the journey. Magna and Luke start to get riled up, but Yumiko calms them down and reluctantly agrees to her terms. They decide to find shelter for the night. At night, inside a factory, Yumiko and Magna cuddle as they sleep. She and the rest wake up after hearing Michonne slice Luke's Stradivarius in half. Luke gawks at his broken Stradivarius in disbelief and explains to Michonne how old and rare it was. Yumiko lays her head on Magna's leg and playfully recalls the mansion they found it in. Luke says the Stradivarius is the one thing that separates them from the animals and how it brought humans together in the past, leaving Michonne in thought. In the morning, Siddiq tries again to convince Michonne to come with them but she says she can't take the risk with Maggie . Siddiq reveals to her that Maggie and Hershel left last fall, shocking her. Before he can explain, D.J. arrives to let them know that there are walkers outside. The group gets out to find several walkers blocking the path to their horses. Michonne kills several walkers as Magna demands they get back their weapons. Michonne finally relents and orders D.J. to return them their weapons. As Magna's group splits up and take out several walkers, an undead Bernie appears, deeply upsetting them. A heartbroken Magna can't put him down, so Michonne does it for her. The group opens a clear path and leave. On the road, Michonne empathizes with Yumiko and Magna, saying that she understands their pain of losing a friend considered family. Suddenly, two Hilltop soldiers ride up to them to inform that Rosita's injured and being cared for at Hilltop. Michonne instructs them to tell Hilltop they're on their way. Connie notices something nearby, confusing the group, but tells them it's nothing. As they leave, someone watches them from the bushes. At Hilltop, everyone runs inside as Michonne and Siddiq arrive with Magna and her group. From the guard post, Dianne makes them all surrender their weapons before entering. Inside, Tara coldly greets Michonne and updates her on Eugene, Aaron, Daryl , and Rosita's situations. She then informs Yumiko and the rest of the group that they'll have to wait for Jesus to return before deciding on their future, but they can stay until he gets back. Connie thanks her for everyone. Later, Magna questions to Yumiko why Hilltop is led by a guy named Jesus but Connie assures her it's probably just a nickname. Yumiko suggests they work on proving their worth so they can stay. Michonne then introduces the new group to Carol , who happily introduces herself through sign language, which Connie appreciates. At night, Yumiko and Magna follow Michonne and arrive at the cemetery to help the others unlock the gate. Jesus tells Aaron and Eugene to get out while he finishes the walkers and starts taking out several with his sword. He goes to kill the last one but as he attacks it, the \" walker \" dodges and stabs him from behind through his chest, shocking everyone. \"You are where you do not belong\" , the \"walker\" whispers to a shocked Jesus before throwing him on the ground. Daryl shoots it in the head as several more Whisperers arrive and the rest of the group run in to finish them off. As Aaron goes over to Jesus' body, Daryl notices something on the back of the walker's head and cuts into it, revealing a mask. Before they can process the situation, whispers around them get louder and the group circles up preparing for a fight. In the cemetery, Yumiko and the rest proceed to kill the Whisperers and walkers around them. At one point, Yumiko saves Michonne's life by killing a charging armed Whisperer with an arrow from outside of the cemetery and Yumiko takes the walker mask of Jesus' killer with her. When more arrive they're forced to carry Jesus' body away and lock the gates. As they leave, a whisperer opens the lock. On the road, Yumiko listens as Magna tells Aaron she's sorry she didn't get to meet Jesus while he claims to her and Yumiko that Jesus was a good man. Suddenly, the group notices a small group of walkers nearby. Daryl corners them on a bridge and uses his crossbow to see who are whisperers. He hits one in the leg and the man falls down screaming in pain, attracting walkers to him. The rest try slowly escaping to the other side, where Michonne is waiting for them. They draw their knives and attack, but Michonne and the rest kill them with ease as the final whisperer gets on her knees to surrender. Daryl rips off her mask, to reveal a girl begging for her life. Michonne angrily questions her but when more walkers show up Daryl decides to take her with them. Later, Yumiko and the group arrive at Hilltop with Jesus' body and the captive girl, causing the whole community to react in disbelief. Yumiko and Magna then help Daryl to carry Jesus' body off the horse. Tara , the new leader of Hilltop, later tells Michonne that she will allow Yumiko and the others to stay and join the community. In the woods, Yumiko and her group follow Tara in the search for Alden and Luke. They find a group of walkers feasting on their horses and kill them, while checking they aren't Whisperers. Connie notices that the horses were cut open and skinned with knives. Tara realizes that Lydia lied about it just being her mother out there and decides they should go back to Hilltop until they find out what this is. Later, in their trailer, Yumiko suggests they leave to search for Luke again but Magna warns they could lose everything if they disobey Tara's wishes. Kelly reveals that she saw some kids sneak out of Hilltop and agrees with Yumiko that they should search for Luke. They take a vote and decide to leave that night. At night, in the woods, Yumiko and the rest find a new set of tracks that could be from the Whisperers. As a herd approaches, she has second thoughts about leaving. Magna and Connie back her up, but Kelly breaks down, reminding them Luke saved her in Coalport. Connie comforts her and tells Magna and Yumiko to return without them and she'll stay and talk to Kelly. Unbeknownst to them, a Whisperer watches them from the woods. In the morning, Yumiko and Magna return to Hilltop. Yumiko apologizes to Tara for leaving and Tara tells her to talk to her next time. Suddenly, she spots a small group of Whisperers approaching Hilltop as guards grab Kelly to get her inside, while Connie hides in the cornfield. Tara calls out to Daryl and Magna to join them on the guard post. In front of the gate, Alpha leads a group of Whisperers. She introduces herself and tells them she just wants her daughter back. At Hilltop, Yumiko listens as Alpha and the Whisperers wait for them to bring Lydia to her. Daryl asks them to leave and Alpha signals for more Whisperers to show up. Magna asks Alpha if they killed their people. Alpha says no and promises if they don't bring her Lydia there will be conflict. Daryl then decides to walk outside to talk to Alpha face to face, to which Yumiko is unsure of. From the guard post, Yumiko watches as Daryl walks outside and Alpha instructs one of her people to bring someone. Daryl informs Alpha he's ready to fight her people to ensure she doesn't get Lydia back, when he then spots one of the Whisperers with a baby. Alpha explains they're animals and \"animals have babies.\" Suddenly, a couple of whisperers bring up a tied up Alden and Luke. Alpha offers to trade both of them for her daughter. Later, from the gates, Yumiko watches as Daryl hands Lydia over to Alpha in exchange for Alden and Luke. She hugs Luke and gets him inside, where he is embraced by the rest of his group. At night, Yumiko drinks and celebrates Luke's safety alongside her companions. On the road, Yumiko and Tara's group clear a tree from their path to the Kingdom to ensure the roads are cleared for Alden's convoy carrying the food and trade goods for the fair. Kelly lets Tara know she’s worried about Connie, but she assures her she's fine with Daryl. Yumiko and Magna also tell her that Connie is taking care of him. Later, a small herd of walkers approaches the group. They get in position and remind themselves to watch for the Whisperers. Suddenly, the Highwaymen ride up on horses and introduce themselves to Tara after helping to take down the herd. They then escort them to the Kingdom, having accepted Carol's deal. In the Kingdom, Yumiko helps unload the trade goods and interacts with the welcoming Kingdommmers. In the Kingdom, Yumiko and a group gear up to go look for Connie as the fair starts. Suddenly, Daryl, Michonne, and the convoy arrives. Yumiko and her group are happy to see Connie and hug her. Later that day, Yumiko and Magna prepare to leave the Kingdom to go to Hilltop and leave some soldiers in case of a possible attack. She says goodbye to Luke, Connie, and Kelly and wishes them luck in the fair. In the woods, she and the rest encounter Ozzy , Alek , and D.J. and find one of Hilltop's carts overturned. She tells Magna to go to Hilltop and kisses her while she accompanies Daryl, Michonne, and Carol track any possible survivor. At night, Yumiko and the group gets attacked by walkers. They take them out one by one until the Whisperers surround them. Beta emerges from the trees and tells them to drop their weapons. \"You just had to give me the girl,\" he growls at Daryl, telling him their deal is off. After the group is tied up, Alpha approaches them and tells them she ran into trouble on the road as she wipes her bloody knife on her pants. Michonne warns her if she tries to get Lydia back they'll respond in force, but Alpha assures her Lydia isn't her concern anymore. She takes out a shotgun and orders Daryl to follow her. At dawn, Daryl returns to the group and they leave back to the Kingdom. On their way back to the Kingdom, they find a beaten and bloody Siddiq tied to a tree. He points them to a nearby hill, which has ten pikes in the ground. Each spike has a severed head stabbed through the top. The group walk devastated towards it and look in horror at the victims: Ozzy, Alek, D.J., Frankie , Tammy , Rodney , Addy , Enid , Tara, and Henry . Yumiko is horrified and falls to her knees. They then put down their friends and loved ones and head back to the Kingdom. Later that day, Yumiko listens from the crowd as Siddiq delivers the tragic news, tells them how brave everyone was in their final moments and how he was intentionally kept alive to tell this very story. He encourages everyone to remember the fallen as brave heroes and to honor them. Several months after the fair massacre, Yumiko and a group of Hilltop residents help the Kingdom residents travel safely and move to the Hilltop. On the road, she informs Michonne they've sent letters to Maggie but haven't heard back and the Hilltop is still reeling from the loss of another leader. Suddenly, they spot walkers in a field but keep moving undetected. Later, as more snow starts falling, Michonne decides to take the group to the abandoned Sanctuary for shelter during the night. In the Sanctuary, Yumiko listens as the leaders map their route through a frozen lake on Alpha's land and Michonne warns they have to leave now or they won't make it. Yumiko accepts to take the route, claiming that it's possible Alpha is already aware of them leaving the Kingdom. The group gets ready and leave the Sanctuary. In the woods, the group passes the pikes into Alpha's territory. Michonne kills frozen walkers, unsure if they’re Whisperers or not, before reaching the frozen lake. Daryl notices Lydia's missing again, so Carol leaves to find her and instructs him to get everyone across safely. Suddenly, walkers awaken from the snow banks and the group kills them one by one before escaping across the ice. In the morning, Yumiko and the group finally arrive at Hilltop, where Daryl knocks off the head of a frozen walker. That night, she helps the residents settle in the community. Some months after the blizzard, Yumiko and the Coalition form a militia in order to train the several residents of the communities to face any future treats. She takes part in a training exercise on the Oceanside beach. As Ezekiel and Jerry methodically release walkers from a shipwrecked boat, Yumiko and the other militia work together as a unit to take out the walker threat. After a Whisperer mask is discovered on the Oceanside beach, Yumiko and Magna head out to investigate any other possible Whisperer sighting around the area. They discover an abandoned campsite full of corpses and a walker skin in the woods, and proceed to inform the others. When they arrive to inspect the camp, Aaron declares one of the Whisperers has been here. That night, Yumiko and the others decide to cross Alpha's border to put out the fire and avoid it burning down Oceanside. They discover the remains of the satellite and start combating the fire. Some use water while others dig a means to prevent the fire from spreading until the morning arrives. The group runs out of water as a herd of walkers approaches the group. With their backs to the fire, the group prepares for a fight. Yumiko and the group take their formations and start fighting off the herd. As they keep killing the walkers, Daryl tosses an axe to cut a tree down and have it fall onto some walkers. Later, the fire is put out and everyone recovers. She then helps out Eugene scrap the fallen satellite for any valuable part. Yumiko and Magna make love in their room before resting for the night. She is then alerted to the commotion of a tree falling onto a house and a portion of Hilltop's walls. As the group debates where to put the injured, Yumiko orders to put them in Maggie's office, ignoring Magna's suggestions. The next day, the residents realize that a small herd has arrived outside the community walls. Yumiko leads a group outside to fight them off. That night, Yumiko and the other residents kill the incoming walkers with the help of the Alexandria convoy when the herd invades the community. The following morning, Yumiko attends the council meeting where Michonne announces she will be delivering supplies to Oceanside after receiving reports of potential Whisperer activity. When Luke volunteers to go, Yumiko jokes he wants to go to be with Jules . Afterwards, Yumiko goes to talk to Magna and tells her that everything worked out in the end. Magna instead says she should stop making the decisions for everyone and reminds her she isn't her lawyer anymore. Later that day, Yumiko says goodbye to Luke as he rides with the parting group towards Oceanside and watches as they leave the community. Yumiko checks around the community to make sure everyone is helping with their chores. She is informed by Alden that Eugene has come up with a plan to salvage the fallen tree and use it to fix the wall. He also suggests to her that they should build up their defenses but she says is not the time as Earl complains about their lack of retaliation against the Whisperers. Suddenly, Brianna tells Yumiko that someone stole the crate of fish from Oceanside during the night. Upon finding out it happened during Magna's shift, Yumiko heads inside the Barrington house to talk with her. She tells Magna to be better at watching the food, but she only turns up her music and ignores her. Later that day, Yumiko grows worried about the group out in the woods looking for Kelly but Alden helps make her feel better. Sometime later, the group arrives back at Hilltop and Yumiko is informed afterwards by Connie of the recent events. That night, Yumiko questions Magna about the stolen supplies as they prepare to rest in their bedroom. They soon start to argue and Magna admits she did kill the man who hurt her cousin despite Yumiko believing her to be innocent all those past years. Yumiko is hurt by the revelation and asks her to sleep somewhere else. Back at the Hilltop, Kelly wishes to join Luke's search party in an attempt to rescue her sister, while Luke cautions her against it, as her ankle is injured. Yumiko asks Kelly about Magna's last words to her, but the latter thinks them unimportant, since she believes they will rescue their friends. Annoyed at Yumiko's questioning, Kelly asks why she is coming with them if she thinks Magna and Connie are dead. They are interrupted by Daryl and Lydia's arrival. The pair reveal that Alpha is coming. Yumiko instructs Felix and Penny to radio them as soon as they see the Whisperers approaching. She then joins the discussion about what should be done. Lydia thinks they should run, explaining that even if the explosion at the cave took out half the horde, Alpha would still have thousands of walkers left. Earl thinks the Whisperers might bypass them and go for Alexandria first, but Lydia negates this. Jerry wishes to stay and fight instead, while Dianne agrees with Lydia, believing that they can rebuild in another location. Earl is skeptical, however, and reckons that they will never find a place as good as Hilltop. While Yumiko points out they're heavily outnumbered, Earl insists that fighting is the best course of action, and even if they die, they will die for a place that means something. Aaron points out that there are children at Hilltop, too. Daryl agrees that they should get the kids out first, and instructs the others to pack up and regroup at Oceanside. Outside, Luke and Kelly are rigging the defenses when Yumiko joins them and apologizes to Kelly for being \"an asshole\". Kelly quickly forgives her with a hug, and is confident they will get Connie and Magna back \"cause assholes get shit done\". They are suddenly interrupted by dozens of rats fleeing from the bushes. Yumiko quickly realizes that the horde is coming, and orders everyone to prepare. As everyone is gathered on the front lines, Kelly puts her palms on the ground and confirms that the horde is close. Indeed, the horde soon emerges from the bushes and approaches the Hilltop. While they are momentarily halted by the electric fence, the walkers soon break through it and approach the second line of defense. Aaron orders the survivors to split ranks. The shield-wielding survivors reinforce the makeshift barbed wire fence, while the melee weapon-wielding survivors start taking out the walkers. The archers, meanwhile, stay in the back and rain arrows on the herd. Behind the herd, Beta commands the Whisperers to launch the sap they collected earlier using makeshift catapults into the front lines, drenching most of the defenders as well as the Hilltop's walls. This is followed by the Whisperers launching fire-arrows into the front lines, setting one unfortunate Hilltop resident ablaze. With no choice, Yumiko and the defenders begin to retreat towards the Hilltop, but are trapped when the Whisperers launch another volley of fire-arrows into the Hilltop's walls, setting the community ablaze. Despite successfully slowing down the herd, the survivors are overwhelmed and are forced to retreat after the defensive wall falls, letting the horde past the Coalition's defenses. As Yumiko fights off the walkers, she pauses in horror when she spots a blood-covered Magna moving amongst the herd. However, Yumiko quickly realizes that Magna is still alive and using the walker guts trick to hide amongst the walkers. Explosions continue to rock the Hilltop. Meanwhile, Yumiko, Magna, Carol, and Eugene are resting in the woods. As Eugene is desperately looking over the little equipment he was able to salvage, a traumatized Magna recounts her experiences to Yumiko, explaining that she and Connie searched the cave for a way out, but got separated after running into the horde. Magna was unable to find Connie afterwards and doesn't know if she survived or not. Carol turns to leave, but is stopped by Yumiko, who angrily yells at her for putting Magna in danger in the first place and even punches her in the mouth for her seeming indifference to Magna's plight. When Carol does leave, Magna criticizes Yumiko's response to the situation and then breaks up with her, with both women agreeing it's for the best and parting on amicable terms. Outside, Yumiko finds Magna sitting on the porch, and offers Magna her horse, thinking that Magna would like to join Eugene on his adventure. To her surprise, however, Magna declines her offer, explaining that she likes being with the other survivors and that a routine has had a positive effect on her. She encourages Yumiko to go instead. While the latter is reluctant at first, she accepts when Magna tells her there is nothing for her to fix. As their expedition travels down the road, Eugene wonders if Stephanie's group has candy, reminiscing about his mother, who used to buy him chocolate bunnies on Easter. Yumiko hopes that Eugene didn't take them on a journey so they can find chocolate bunnies, but the latter claims their journey is for the future hope of mankind, although candy would be nice. Eugene notes Ezekiel is in a foul mood, so offers to cheer him up, but the latter declines. The trio stumble upon a couple of caged walkers. Yumiko wonders if the Whisperers did this, but Eugene points out it's not their modus operandi. Yumiko suggests they take a few moments to investigate, in case the walkers are a warning. Ezekiel rides out into a clearing, where he dismounts to put down three walkers. He quickly tires out after killing the first two, however, and barely manages to kill the third one. He takes a moment to rest, before Yumiko calls him back. Yumiko, Eugene and Ezekiel camp out under an overpass, when Ezekiel's horse suddenly collapses. Ezekiel rushes over to see what's wrong, and discovers a bite wound that his horse had sustained while Ezekiel was fighting walkers earlier. Ezekiel mournfully comforts it, before putting the unfortunate animal down. Devastated, Ezekiel says that he shouldn't have come, but Yumiko tells him it was just an accident. Ezekiel requests his companions leave him behind if he falls, but Yumiko refuses. Ezekiel states that his horse wasn't strong enough to make the journey, and he might not be either. He claims to be okay with that, but is not okay with putting them at risk. When Yumiko asks if he wants to turn back because of what might happen, Ezekiel replies that it's for the best. Yumiko exclaims that they don't know what lies ahead. She reminisces about all the plans she had, but in the end, no one really cared, so she is here now to find out what's possible, what none of them could predict or imagine. She tells Ezekiel that they need a man who built a Kingdom in the apocalypse. Yumiko, Eugene and Ezekiel arrive to the outskirts of an abandoned city. As they ride through the empty city, Yumiko wonders how improbable it is that the city is so deserted. They start seeing walkers in various outfits tied to furniture and vehicles, in a way that makes it seem like the walkers are doing everyday activities they might have been doing before the outbreak. When Ezekiel sees a walker handcuffed to a steering wheel in a vehicle, and a police officer walker chained to the hood of said vehicle, he starts laughing hysterically. When the trio enter an alley, they are confronted by a flamboyantly dressed, machine gun-wielding survivor , who enthusiastically greets them. Startled by the stranger they've just encountered, Yumiko asks for her name and what she wants. Offended at her tone, the stranger points out that Yumiko and her group were the ones making noise, and that she thought they needed help, and goes on to lament how the first people she's seen in over a year turned out to be \"meanies\". Ezekiel tells the survivor she just startled them, and they didn't know if she was attacking. Bemused, she tells the group that, if she wanted to attack them, she would point the gun at them, but claims she was just saying \"hello\". The stranger, however, proceeds to hold the group at gunpoint, unsure of their intentions. Ezekiel defuses the situation, claiming they don't want to hurt her and were simply admiring her \"displays\". The stranger quickly lightens up and reveals that she tied up the walkers to make the city feel more alive. She is ecstatic that she met actual people again, but then wonders if the survivors are actually hallucinations. Still, she is exited at the prospect of talking to potentially real people, and introduces herself as Juanita Sanchez, but adds that she prefers the moniker of \"Princess\", since she never liked her first name and \"Queen\" makes her sound old and pretentious\". After Ezekiel introduces himself and his friends, Juanita offers to show them around the city, but Eugene informs her that they can't stay, as they are on an important mission. Slightly peeved, Juanita still offers to act as their guide through the city, but Yumiko declines, as the survivors don't know her. Juanita protests that they do, and demonstrates how \"helpful\" she can be by mowing down a few approaching walkers with her machine gun. Unfortunately, the gunfire startles the group's two remaining horses, and they run away. Juanita apologizes, as the survivors angrily glare at her. Later, the group discusses what to do next. Ezekiel is confident they can find the horses tomorrow, but Eugene doesn't think they have enough time, and that their chances of making it to the meeting on schedule are slim even if they start walking now. Ezekiel proposes that they enlist Princess' help, but Yumiko opposes the idea, believing Princess to be too selfish and mentally unstable from being on her own for so long. Ezekiel doesn't want to follow Princess blindly, but points out that she might know where to find transportation. Yumiko, however, is skeptical, and believes Princess would have already left the city if she had means to do so. Eugene interjects that, while Princess might be crazy and it is unlikely that she has access to working vehicles, it might be the only chance they have, so he sides with Ezekiel. With that, Ezekiel summons Juanita, much to her joy. Princess apologizes again, and confirms that she knows where to find transportation and can take the there. Yumiko insists that Princess surrender her gun, but the latter is hesitant, as she doesn't fully trust the survivors either. She ultimately relents, however, and hands the machine gun over to Eugene. With that, they commence their journey, as Yumiko quietly reiterates to Ezekiel that Juanita is selfish and crazy. Princess leads the survivors to an empty field, and warns them to stay close to her and watch their step. Continuing further, Princess counts her steps, as Yumiko continues to express her doubts about Princess, with even Ezekiel slowly starting to share her feelings. The survivors soon stumble upon the remains of one of their escaped horses. Yumiko wonders if it was devoured by walkers, but Princess casually reveals that it's more likely the horse stepped on a mine. Naturally, the survivors are aghast that Princess would bring them into a minefield and keep it from them, but the latter tries to reassure them that she walks through it all the time and can lead them out safely. Unfortunately, Princess lost count when she stopped, so needs a minute to think. Yumiko threatens to kill her if she doesn't lead them to safety, which Princess considers fair. With that, she takes out her water canteen and tosses it forward to check if the way is clear. Unfortunately, the canteen detonates a mine, setting them back to square one. Still stuck in the minefield, Juanita attempts to orient herself while Yumiko complains that they never should have followed her. Eugene warns that they are running out of time on multiple fronts, pointing to a walker approaching through a hole in the fence. Beside the fence's integrity, Eugene also worries that the mine placement could lead to a cascade. When Yumiko asks him what a \"cascade\" is, the approaching walker trips one of the mines, which also detonates another mine right next to it. Eugene cites this as an example of a cascade, cautioning that they don't want to be stuck in the field in case of a chain reaction. Ezekiel thinks that he can help, and goes over to Juanita to talk to her. Princess thinks that she is blowing it with them, and while Ezekiel acknowledges this, he also tells her that leading them to safety could go a long way. Juanita once again apologizes to the group, and goes on to chose the route based on a game of eenie-meenie-miney-mo. She then risks her life by taking a few steps on the chosen route. Satisfied that she is still alive after this, she invites the survivors to follow her. Finally out of the minefield, Yumiko berates Juanita for putting their lives in danger when Eugene spots a street sign identifying the road they're on as Fleetwood Drive. He angrily confronts Juanita about this, as he remembers that they already passed Fleetwood Drive. Juanita claims that there are several streets in the city named \"Fleetwood\", but Eugene is certain it was, in fact, Fleetwood Drive. As Princess tries to make excuses, Yumiko draws her bow and points it at Princess. Juanita finally confesses that she wanted to take the scenic route to keep the fun going. Yumiko furiously points out that she led them into a minefield, but Juanita pleads that she never thought it would be a problem, as she'd traversed it countless times before. Juanita goes on to explain that she wanted more time to befriend the survivors, so they might decide to stay with her, but realizes now that she screwed up. She also recounts how, when she first arrived to the city, she figured someone would show up eventually, but as the months went by, Juanita realized the loneliness she was feeling wasn't too different from how she felt even before the apocalypse. She laments how someone once told her she is difficult to love, so acknowledges that the problem might be with her, and that a little voice inside her kept telling her this. Juanita knows she should have told them the truth, but didn't want the little voice to be right. She apologizes to the survivors once more. Feeling sorry for Princess, Yumiko relents, and Eugene comforts Juanita by identifying with her, explaining that he also made poor decisions and lied to people so he would be left alone. He then asks if she does, indeed, have access to the wheels she mentioned earlier. Princess and her companions have finally reached the garage, where it is revealed that the \"wheels\" Juanita was talking about were actually bicycles. Eugene points out that 15 mph is still faster than walking, while Ezekiel observes that Juanita wasn't actually lying about the garage. Yumiko then approaches Juanita, but before she can get a word out, the latter states that she is not a bad person, and realizes how difficult it is to trust people, so is sorry that she blew it. Yumiko, conversely, reveals that she was actually coming over to ask if Juanita wanted to join them. Princess ecstatically accepts. As Yumiko, Eugene, Ezekiel and Juanita travels, Eugene crashes his bike. The group tries to fix it, but Eugene tells them not to, because it will take long time and they won't be in time to meet Stephanie. Yumiko tries to reassure him, but he says that the time was set in stone and if they are too late Stephanie won't be there. Ezekiel steps up and tells that after all they've been through, they won't turn back and will go till the end. He tells how Eugene helped him in his moments of doubt and now is offering the same thing back. Eugene is still in doubt, but Ezekiel tells that they must end the journey for the sake of everyone. Eugene points out that he wants to end the journey too, but Stephanie isn't going to be there after tomorrow's sundown. Juanita says, that she has never told that and Yumiko adds, that they will deal with these problems the next day. The group arrives at the location, where they are supposed to meet Stephanie, but finds out nobody is there. Eugene yells out to Stephanie, that he has arrived, but gets no answer. He is unhappy about this, but the group supports him. After that he tells they are not turning back and states that there are people out there and Stephanie as well around the trainyard. Eugene says that they are going to track these people down and look for them. As Eugene and group shares a little laugh, searchlights turns on and unknown armed people runs out telling everyone to put the weapons down. Yumiko, Ezekiel, Eugene and Princess surrender to soldiers at the rendezvous point that Eugene had arranged with Stephanie . As they are all put into train cars, Princess has flashbacks to Yumiko's violent clash with the soldiers and calms herself by counting in Spanish and reciting state capitals. She gets a splinter while chipping away at the wall. She hears Yumiko in a nearby train car and asks how she's feeling. Princess offers to summon the soldiers to check on Yumiko's wounds, but Yumiko implores Princess to remain calm and obey the soldiers. Princess urges Yumiko to stay awake and describes how her stepfather beat her as a teenager. She hears Yumiko collapse. Soldiers open Yumiko's door and and take Yumiko away. She later realizes that Ezekiel, Eugene and Yumiko were all in her head, and that she was hallucinating them the entire time. The real Yumiko is seen with Eugene and Ezekiel lined up outside with hoods on their heads, guarded by soldiers. The soldier inside the train car throws a hood over Princess. Yumiko, Eugene, Ezekiel and and Princess are transported into a compound guarded by paramilitary troopers . Inside an interrogation room, a man and woman introduce themselves to Eugene as auditors for the Commonwealth . They question him for hours, as well as Ezekiel, Yumiko, and Princess. Ezekiel interrupts his interrogation, and correctly guesses that a trooper who's quietly been watching is actually the person in charge. He coughs uncontrollably. The trooper, Mercer , passes him a glass of water. Yumiko's group eats together in a detention center. Princess, Yumiko, and Ezekiel agree that they must try and escape, but Eugene argues that the Commonwealth might be able to help Alexandria. Princess asks some fellow prisoners how long they've been there. One of the prisoners says he can't remember on account of the \"reprocessing,\" then trails off. Troopers haul away a prisoner to take him in for reprocessing. Eugene changes his mind and agrees they need to escape. Eugene's group discusses an escape plan. Princess watches their guards with amusement, and describes details about the troopers that no one else has noticed. She reveals that two of the troopers routinely disappear for half an hour to have sex. They hatch a plan to escape during this window of time. Yumiko and Eugene wear trooper uniforms and escort Princess and Ezekiel down a hallway. A trooper demands to know where they're going. Yumiko says they're taking the prisoners to reprocessing. The trooper lets them go. They escape the building and pass by a wall papered with photos of prisoners. Princess recognizes Yumiko in one of the photos. Yumiko sees that the photo is accompanied by a note from her brother , asking if anyone has seen Yumiko. She realizes her brother is at the compound and decides she must stay and find him. At the Commonwealth interrogation center , Yumiko concludes that the Commonwealth is indeed real, based on the notice board she found. Juanita comes to the same conclusion, although she gets lost in her own train of thought. With that, Yumiko determines that the best course of action is to talk to the person in charge, while being cold as ice. Juanita questions whether Yumiko is capable of this, since her brother is involved, but Yumiko assures Juanita that it comes naturally to her, since she was a lawyer. Yumiko goes on, but Juanita shushes her as the same trooper that encountered them during their escape attempt walks by. Juanita thinks the guard knows they tried to escape, but Yumiko is skeptical of this, as they haven't been confronted about it yet. Just then, Eugene arrives and informs them that Ezekiel is gone, with the guards having taken him somewhere, apparently. Eugene starts to panic, believing that the guards know they tried to escape, and suggests they come clean about who they really are. Yumiko firmly tells him to not talk to the Commonwealth's law enforcement, or stick to the story if he has to. When Juanita asks what they should do, Yumiko gets up and demands to know where Ezekiel was taken, and then to speak to the person in charge. Yumiko is put back in the interrogation room, with the interrogators apparently being the ones in charge. Clark says she isn't sure why Yumiko is talking to them, since she had already been assessed, but the latter asserts that she was the one assessing them instead. She goes on to deduce that their community is large and organized, with a bureaucracy the interrogators are a part of. She also believes the interrogators had similar jobs before the apocalypse, guessing that Clark was a forensic psychologist and Evans an academic researcher. With their role being to assess threats to their community, Yumiko determines that the reason the interrogators asked about their past lives is because someone above them determined that was a good position from which to judge who they were in the present. She also deduces that their currency is the US dollar, as they hounded one of her companions over a $2 bill, with the reason for this being their need to strictly control the amount in circulation. Yumiko also believes the Commonwealth uses old currency as a symbol to remind people of the days before the fall. While she understands their need to determine whether she and her companions are an asset or a liability, she asserts that the Commonwealth needs to justify its existence, too. Taunting her interrogators, Yumiko hypothesizes that manual laborers are more valuable nowadays that someone who can write endless lists of questions, when at the end of the day, they still need to rely on their gut instinct. She pegs the interrogators as people who follow rules, which she likes, as she was a lawyer once, and goes on to proclaim that they need her. Yumiko says that she has reason to believe her brother is alive in the Commonwealth and, thus, requests expedited processing for her and her group. With that, Mercer enters the room, and offers Yumiko a cup of coffee. Yumiko is later seen when Eugene is taken to a train car where he is overjoyed to be reunited with his friends. He asks Ezekiel where the soldiers took him, but the latter says it was to the infirmary, where they gave him a syrup for his cough. Their conversation is cut short when Mercer strides into the room. He formally admits them into the Commonwealth, and sarcastically comments that they'll be escorted by a \"beat cop.\" Before walking away, he indignantly informs Ezekiel he went to West Point. Mercer then knocks twice on the door. When it opens, a woman steps in who introduces herself as Stephanie . Yumiko, Eugene Ezekiel and Princess are handed out work and housing assignments. Eugene says they weren't planning to stay in the Commonwealth, but the clerk tells them to take it up with their case supervisor. Yumiko reads her letter and sees that it's a VIP invitation to discuss opportunities at the Commonwealth. Yumiko presents her letter to the clerk and asks to see her brother. Yumiko stops by a bakery where her brother, Tomi , works. Tomi is shocked to see her alive. Yumiko catches up with Tomi. Tomi explains that he found the Commonwealth very early on, and that he's happy working as a baker instead of a surgeon. Yumiko asks if there's any possibility of bringing her people to the Commonwealth. Tomi says anything is possible if you follow the rules. Yumiko is told by a Commonwealth officer that they should have no trouble finding a position for her, given her credentials. Yumiko makes it clear that she's not planning to stay and demands to see her friends. The officer says her friends will be released once they're finished completing their sentence. Yumiko demands to meet with Governor Milton . Yumiko meets Tomi at the train station and marvels that he chose not to be a doctor. Tomi tells Yumiko he's happy with his life, and makes Yumiko promise to keep his true profession a secret. Yumiko mentions that she has a meeting with Governor Milton. Soldiers come out of nowhere and haul Tomi away. Yumiko confronts Hornsby and demands to know where Tomi is. Hornsby assures her that Tomi will be home that night and that he will soon free her friends. He admits he's helping her with the hope she might return the favor one day. Yumiko arrives at Governor Milton's office for her meeting. Max , the receptionist, gives her a warm welcome. She takes a phone call and informs Yumiko she needs to reschedule the meeting because Governor Milton's son, Sebastian , was attacked. Yumiko is seen at the masquerade ball, exchanging brief pleasantries with Manga, who works in the kitchen. Tomi tells Yumiko he feels uncomfortable with the extravagant scene and proceeds to chug an entire glass of wine before fetching a second glass. As the festivities progress, the party is interrupted when Tyler Davis begins accosting Pamela's leadership, declaring that the Commonwealth elites do not actually care for the welfare of its citizens. Yumiko watches in silence as Tyler supports this claim by telling the room he tried endlessly to talk with Pamela one on one, only to be routinely ignored, and that he lost his job as a trooper and place of residence after making one \"mistake\": being overpowered and beaten by a prisoner. Yumiko and Max hand out money and non-disclosure agreements to party guests to ensure their discretion. Pamela and Yumiko are walking down the stairs to leave the train station when numerous protestors swarm them, with April's father and mother leading the pack. Pamela says she shares their pain and promises to find out who was responsible for their loved ones' deaths. Mr. Martens says they know who did it and asks where she is hiding Sebastian. Over a public address system, Pamela tries to argue that it's not true, but the protestors aren't buying it. Yumiko steps forward and manages to talk everyone down as the guards force them all out. Pamela suspects that Connie is the one who wrote the article, but Yumiko says it would surprise her if she did. Pamela walks outside and into her ride as the protestors chant, \"DOWN WITH THE MILTONS!\". Pamela looks out the windows conflicted as she talks on the radio, ordering a lockdown. Yumiko has a chat with Magna, telling her Pamela knows or at least suspects that Connie is behind the article, though Magna says there is no proof. Yumiko reveals she hasn't told Connie, since she knows she won't back down from a fight. She tells Magna that she knows she of all people doesn't back down from a fight either and wants to ensure an exit for them if things go bad. Magna questions Yumiko wanting to stay behind, and she answers she can't leave Tomi . Magna says if they have to go, they will all go, including her and Tomi. She encourages her to keep her eyes peeled and help everyone they can. Yumiko jokingly calls Magna stubborn. Just then, the announcement is made that a lockdown procedure has been initiated. Many residents are seen running towards their homes, scared. Yumiko and Magna get up and leave. Yumiko arrives at Pamela's house and is offered a drink. Yumiko is angry at Pamela for tear-gassing her friends, but Pamela believes it was necessary to keep everyone safe. Yumiko asks Pamela if she really thinks there is no way Sebastian had anything to do with the crimes committed. Pamela knows that he has some behavioral issues, but says his father and grandfather were the same way, and still is firm in her belief it wasn't Sebastian. Yumiko says she is trying to figure out how much Pamela knew about it, since she might have to defend her. However, Pamela shows her distrust of Yumiko, seeing that she is close friends with one of the biggest journalists in the Commonwealth, Connie. Just then, Sebastian and Carol enter the house and Pamela immediately gets up and hugs him. Yumiko will appear in this episode. Yumiko angrily storms into Pamela Milton 's office, punching a man in the face that tries to restrain her and demanding to know where her friends are, much to the shock of the Commonwealth's elite. Yumiko calls herself the biggest threat that Pamela has at the moment and orders her to dismiss her guests and explain what the hell's going on. Amused, Pamela dismisses her guests and tells Yumiko that she's been expecting her. Pamela explains that her friends have been removed from the Commonwealth, which Yumiko realizes is just like the hundreds of other people that she's had disappeared. Not even denying the accusation, Pamela claims that their rebellion and defiance of the Commonwealth's laws had left her with no other choice. Yumiko calls Pamela out on her hypocrisy, but Pamela continues to insist that she does care about the law and seeing order restored from chaos and for justice to prevail. Pamela wants to assure her citizens that the trial of the man who killed Sebastian will remain impartial and that justice will be served no matter which side someone falls on. To this end, Pamela intends to bring this \"impartial justice\" by having Yumiko, Eugene 's friend, be the prosecutor in his trial . However, Yumiko refuses to sign her friend's death warrant in a kangaroo court publicity stunt. Pamela threatens that Yumiko will never be reunited with her friends otherwise and that she should consider how Yumiko's actions will affect her brother as well. Pamela smugly dismisses her to prepare for a press conference announcing Yumiko's intent to prosecute Eugene. At the Commonwealth Hospital , Yumiko finds Tomi who is treating a patient. Once the patient is gone, Yumiko reveals to her brother that her friends have been taken and removed from the Commonwealth. Tomi is shocked by the news, and Yumiko confirms that Magna , Connie , Kelly and all of the rest are gone on Pamela's orders, and she is now demanding that Yumiko prosecute Eugene if she wants to see them again. Tomi recognizes that Pamela had likely threatened him too, but Yumiko promises to not let anything happen to him. However, that's not what Tomi is worried about. Tomi knows that Pamela expects Yumiko to fold and that she's stacked the deck that way, and if she doesn't, who knows what will happen to Yumiko. Yumiko is sure that there has to be another way and she seeks her brother's guidance on what to do. Even though it's not what she wants to hear, Tomi suggests that the best for Yumiko to protect her friends and herself is to give Pamela what she wants even though it means sacrificing Eugene. Tomi doesn't think that Yumiko has any other choice, pointing out that Pamela is still standing despite everything that's happened. \"There isn't some kind of justice just waiting around the corner,\" Tomi concludes. Yumiko is shocked that her brother can just accept that, but he sees it as survival, not acceptance which is what Yumiko wants for her friends and them for her. As Yumiko makes her way out of the hospital, she is intercepted by Connie and pulled into a storage closet. Connie explains that she stabbed one of her attackers in the leg and ran when he let go of her. However, it happened so fast that Connie doesn't know if anyone else escaped. When Connie turned back to help Kelly, her sister was already gone, and Connie didn't know what else to do. Yumiko reassures her friend that she did the right thing as Connie would be in the same situation otherwise. Connie knew that the man that she stabbed would need medical attention, so she came to the hospital. Looking through a vent into the next room, Yumiko spots the injured man being treated and Connie reveals her intention to follow him once he's released as he could lead them to their friends and her sister. However, Yumiko worries that it's too dangerous as Connie could be caught. Rather than allow Connie to risk herself, Yumiko decides to do it herself as they may be looking for Connie, but they aren't looking for Yumiko. Both women know that, if Yumiko's spotted, Pamela's men will know that they spoke, and they can't risk seeing each other again. Connie reassures Yumiko that she has faith in her, and they share a hug before Yumiko leaves. In Union Square, Yumiko follows Connie's assailant from a distance, but he catches on and stops, forcing Yumiko to keep moving and give up the attempt to try and maintain her cover. In the jail, Yumiko informs Eugene of the disappearance of their friends, Pamela's demands that she prosecutes him, and her failure to follow Connie's attacker which she feels guilty about. Yumiko now thinks that she doesn't have a choice but to do what Pamela's asking of her, which Eugene tearfully assures her is a fate that he's freely accepted if it comes down to that. Eugene knows that she doesn't want to do it, but Eugene has made his choices and is willing to face the consequences for them if he has to. However, the central dilemma of their kidnapped friends remains in either case. Eugene wonders what if the worst happens while the trial plays out and what if Pamela reneges on her promise to set them free. They need to do something, but Eugene doesn't have any more idea than Yumiko about what that could be as it appears that Pamela has all of the leverage here. However, Eugene has to believe that there's still something that they can do because, if their friends are truly gone, then Eugene can't live with it for whatever little time he likely has left. Yumiko reassures Eugene that this isn't his fault, and he reassures her in turn that Yumiko being made by Connie's attacker isn't hers either. \"One thing we can do... is return the unwavering faith our absconded friends have always shown for us and trust that no matter how bleak things look in this moment, that this is not the end. Now that may not mean much... coming from a soon-to-be convicted felon... but maybe it's something,\" encourages Eugene. Yumiko silently takes her friend's hand through the bars of his cell window. At the press conference, Yumiko looks over her prepared speech and Pamela tells her that she's glad that Yumiko had decided to attend, but Yumiko states that she didn't really have a choice. Pamela asks how Yumiko's stroll through the square today was, and informs Yumiko that Connie was captured earlier and that she has been placed with the others. Pamela admits that she admires the loyalty that Yumiko has for her people, and she hopes that someday Yumiko will understand why Pamela had to do this for her own people. However, Yumiko already understands, and she knows that this is for Pamela and her power, not for her people. Pamela states that Yumiko's words tonight will carry across the Commonwealth and help restore the people's faith and keep the peace, but Yumiko points out that they're not her words, just bullshit theater, but Pamela is undeterred, ordering Yumiko to make sure that she knows her lines. As the press conference starts, Pamela asks Colonel Vickers for any updates on the escapees and Vickers promises her that she has their best people on it and teams are sweeping every quadrant, which is overheard by Yumiko. As Yumiko walks past her on the way to the podium, a report comes in over Vickers' radio that Alpha Squad has just been found dead in quadrant three and Daryl, Carol and Lance have all escaped. Taking her place at the podium, Yumiko begins to read her prepared statement, but Yumiko begins to pause and have visible second thoughts while talking about how she was given a second chance to uphold the sacred ideals of the old world of justice, and how regardless of the personal cost, we must always seek justice if who we are as a people is to be preserved. Suddenly stopping, Yumiko publicly thanks Tomi and reminds the entire Commonwealth of his invaluable and irreplaceable importance to them as their thoracic surgeon, thus protecting Tomi from Pamela being able to retaliate against her by making Tomi disappear. although Tomi is visibly confused, and a bit displeased by his sister's actions. Turning the tables on Pamela, instead of finishing her prepared speech, Yumiko announces that \"I'd also like to take this opportunity to thank my people for always having faith in me. And now I'd like to show my faith in them, and also honor the pursuit of justice by announcing my intent to defend Eugene Porter who has been wrongly and unjustly accused by Pamela Milton and the Commonwealth. We look forward to our day in court. Thank you very much.\" Amidst the uproar of the crowd, Yumiko drops her prepared speech at Pamela's feet and sarcastically quips to the shocked and furious governor that \"there's your speech,\" and walks away. In the Commonwealth, Pamela testifies at Eugene 's trial about Sebastian 's death and the impact that it had on her. Over Yumiko's objections, Pamela calls Eugene a murderer that needs to pay, but her objections are overruled by the judge. Eugene worries about how nothing seems to be getting through to the judge, but Yumiko tells him that it's not the judge that they need to get through, but the people of the Commonwealth who are observing the trial, many of whom appear to be displeased with the proceedings and the treatment of Eugene. As Eugene looks around at the crowd, Max gives him a reassuring look. Yumiko questions Pamela about the lottery and Pamela tells her that it's about opportunity and hope for a better future, drawing angry murmurings from the watching crowd. Yumiko calls Pamela out on this as Sebastian had said that the lottery was a lie and rigged by the Governor herself. Despite the prosecutor's objections and orders to desist from the judge, Yumiko presses for an answer, reminding everyone that they all heard Sebastian on tape calling the lottery a lie. Pamela lies that it wasn't her son on the tape and that the tape was altered, causing the crowd to grow even angrier, not believing Pamela's claims. Yumiko demands to know if Pamela really wants them to believe that someone altered Sebastian's voice on the tape and Pamela places the blame on Eugene, calling him an enemy of the state who had admitted to playing the tape and causing chaos on Founder's Day, but no one in the crowd believes the governor's lies with one woman even calling for Eugene to be freed as Yumiko looks to Mercer before staring at Pamela incredulously. In his cell , an elated Eugene listens as an angry crowd outside calls for his freedom. However, while Eugene and Max are pleased that Yumiko had succeeded in getting through to the people of the Commonwealth, Yumiko is more subdued as there are still soldiers out there holding the line and doing Pamela's bidding. If the soldiers aren't on their side, it doesn't matter how fast they inspire an uprising, it might not be fast enough. Max realizes that Yumiko is saying that they're going to lose the case and that the people outside can't stop what's going to happen next. Eugene sadly suggests that it might be time to accept the situation that he's in. Eugene knew that this could and probably would come so now he needs to prepare. When the judge declares him guilty, Eugene will allow himself to be escorted to his execution and both Eugene and Max break down crying at the thought of it. Yumiko suggests that since Mercer commands respect in the Commonwealth, if they can get him to admit that Pamela is corrupt on the witness stand, they might stand a chance. However, Max is convinced that her brother won't speak out against Pamela and that Mercer would've done it when Princess was taken if he was going to do it. Yumiko suggests that Mercer might not know with the way that Pamela runs things, and although Max knows that Mercer's men won't let her anywhere near his office, Yumiko thinks that Mercer might talk to her instead. In the police station , Mercer issues orders for five more troops to be placed on the south perimeter. Finding Yumiko in his office, Mercer tells her that Yumiko shouldn't be here. Yumiko has come to convince Mercer to do the right thing, but Mercer simply tells her to leave, citing the fact that the judge wouldn't like Yumiko to get back late. However, Yumiko knows that it doesn't matter as they're going to lose. Yumiko's friend, the man that Mercer's sister loves, is going to die and so might Yumiko's other friends for all that she knows. Yumiko reveals that Pamela's men had taken her other friends, including Princess, to God knows where, but Mercer admits that he already knows, shocking Yumiko. Yumiko doesn't believe that Mercer doesn't care and neither does Max and they need him to testify against Pamela in public in order to save their friends and loved ones. Mercer refuses, telling Yumiko that it won't change a thing and brushes off her attempts to convince him otherwise. Furious, Yumiko storms out of Mercer's office. At the trial, the prosecution rests its case and Yumiko prepares to as well after glancing at Mercer. However, Eugene asks for permission to address the court on his own behalf over Yumiko's objections. \"The way I see it, I've been living on borrowed time for well past a decade now. And by all rights, someone like me should've met my maker on the very first day that things started to fall apart. But the thing is, I would've, were it not for the aid of friends. Friends who have not only changed me, but changed the hearts and minds of so many others. I am beyond certain that my fate will not discourage them from keeping that going, from helping others to find the courage to do what's right. I was not always a good man. Some time ago, I fell in with a posse who thrived doing some downright unseemly acts on the reg. I looked the other way. I placed value on order and safety above all other things, but I soon realized that I wasn't the one swinging the bat , I nevertheless had blood on my hands. I knew what was happening. My inaction made me culpable and I hated myself for that. So, I did something . In my own little way, I changed the world. And I learned that one person can do that, and sometimes all it takes is one person to do that,\" states Eugene with most of the court looking affected by his words. Yumiko rests her case and Eugene is found guilty of first-degree murder and sentenced to public execution in one hour, leading to outcry from the crowd watching the trial. As the soldiers and the judge struggle to restore order, Pamela leaves with a victorious smirk on her face. Eugene is led out as Max exchanges a look with her brother and Yumiko lowers her head in grief. Yumiko and Max sit in an empty apartment when a knock sounds at the door. Much to their surprise and relief, Mercer is on the other side with Eugene . Eugene hugs Max, explaining that he's alright thanks to Mercer. Mercer explains that he didn't tell them his plans as it was safer for everyone. Eugene notes that Mercer has joined a long line of people who have saved Eugene's life through the years, and he promises to never forget it. Yumiko asks about their next move and if it's for them to try to leave. However, Mercer orders them to lay low instead and Max and Yumiko insist that they can help. Although they lost in court, they were heard, and the people are angry. They just need to push the Commonwealth residents past the tipping point to get them rise up against Pamela's corrupt regime. Mercer acknowledges this, stating that first he needs to gather enough troops willing to make a move on Pamela, but if Yumiko and Max can keep the public fired up, it may give them enough cover to put things in place. Eugene asks how he can help, but Mercer orders Eugene to stay in the apartment out of sight. As radio calls go out looking for Mercer, Lieutenant Rose knocks on the door with the warning that they are out of time. Rose blatantly lies over the radio that he doesn't see Mercer who is currently taking a statement from a potential witness, promising to send Mercer their way as soon as he comes back. With a reminder to Eugene to stay out of sight, Mercer leaves with Yumiko and Max to \"get this dog and pony show started.\" Once they leave, Eugene locks the door behind them. In Mercer's office at the Police Department of the Commonwealth Army , Yumiko is interrogated by Mercer and Vickers about Eugene's escape. Yumiko plays along with Mercer's questions while defiantly telling Vickers that if she knew where Eugene was, she'd be with him rather than being interrogated by the two. A confused Lieutenant Rose interrupts with the news that someone named Aurora is trying to raise Mercer on the radio and he states that he will take it in his office, dismissing Yumiko and Vickers. In Union Square, Yumiko and Max observe the heavily guarded doors to Union Station from across the street. Hearing twigs snapping, Yumiko spots a hooded Eugene sneaking around a train car, armed with Brooks' rifle and she tells Max that they are going to go around. Inside, under cover of the smokescreen, Daryl and the others manage to break the chains sealing a side door. As a trooper approaches the doors, Eugene ambushes him and knocks the man out with the butt of his rifle. Magna finally breaks through the doors, and everyone is reunited with Eugene, Yumiko and Max before quickly making their escape. The Coalition races through the streets towards the hospital with Daryl carrying the unconscious Judith. Commonwealth vehicles drive up and block their path in multiple directions, forcing them to fall back. Carol realizes that the soldiers aren't following them as they begin to erect barricades in the streets. Loudly yelling and firing their guns in the air, Commonwealth soldiers lead the herd in their direction before closing the barricades, penning the herd and the Coalition in. Spotting a walker climbing over something, a shocked Negan asks \"what the fuck?\" As walkers close in from multiple directions, Luke and Jules emerge from the herd, causing Kelly to nearly shoot them before Connie stops her sister. Fleeing down a side street, Carol spots an alley near part of the herd and everyone attacks the walkers, clearing a path for Daryl to flee down the alley towards the hospital with Judith. Waking up for a moment, Judith calls out \"daddy?\" and witnesses her friends and loved ones struggling to hold back the herd before passing out again. In the streets, the Coalition desperately fights off the herd as they try to escape from the walkers swarming around them, those armed with guns shooting the undead while the rest stab at them with knives, including Max . However, Jules misses the head of one walker, instead stabbing it in the shoulder. The walker bites Jules in the arm and Luke rushes to his girlfriend's aid, stabbing the walker in the head and yelling for help as he supports Jules. However, walkers swarm the couple from behind with one tackling Luke to the ground and biting him in the leg as Jules is dragged down and devoured. Seeing Luke's predicament, Connie shoots the walker in the head and Luke is dragged to safety by Kelly and Yumiko, yelling in desperation for his girlfriend as Jules is devoured, beyond the ability of any of her friends to try to save her. Shooting at a smaller group of walkers coming down an alleyway, Carol orders her friends to follow her down it and everyone flees as the herd overruns the streets. At the hospital , a bandaged and bruised Daryl regains consciousness in a bed with Carol at his side and Magna's group nearby desperately trying to save Luke's life, having amputated his bitten leg. Near death from the bite and blood loss, Luke has his friends remove a harmonica that he's kept from his pocket and Yumiko promises him that they'll keep the music alive for him. With his last words, Luke asks everyone to promise him, and they all do so. Luke dies in his friends' arms as they all sob at losing him. Taking a knife from Kelly, Magna stabs Luke in the head to prevent him from reanimating and the group sobs over his corpse. Watching the others' grief, a determined Daryl decides to give Judith a blood transfusion, explaining that he's a universal donor and that Merle had used to make him sell his blood when he was a kid as a way of making money. Carol helps Daryl set up the transfusion as they watch the others cover Luke's body in a sheet. Hearing loud noise and shouting, Carol and the others leave to sweep the hospital for walkers and to make sure that the others are okay while Daryl remains with Judith. After walkers breach the hospital, Daryl begins wheeling Judith's stretcher out, but stops after seeing walkers pounding on the glass at the front doors of the hospital. Disconnecting the blood transfusion, Daryl barricades Judith in the room and rushes to help in the lobby where walkers drag Adrienne outside and devour her while the group barricades the doors again. Looking at the numerous walkers outside of the windows, Carol and Daryl shocked to see a variant walker breaking the glass with a brick while Connie spots more walkers coming down the hallway from the other direction. The variant breaks through the glass and is immediately stabbed in the head by Carol, but more walkers break in from the other side and drag a man outside and devour him. With walkers converging from the three sides, the group attempts to fight them off, only to have more walkers break through the barricaded door as well. Racing down a clear hallway, the group grabs Judith's stretcher while Magna radios the others to warn them that the hospital has been breached and they're leaving out the back. The group races through the hospital towards an exit as walkers close in on them from multiple directions. At night, outside of a loading dock, Mercer observes a crowd of desperate Commonwealth residents demanding to be let into the Estates. Mercer reassures Maggie that they will be able to move soon while Aaron tells Ezekiel that he saw people on the higher floors and rooftops begging for help, but he wanted to make sure that Lydia was safe first. Ezekiel reassures his friend that he did the right thing. Hearing screams in the distance, both men are determined to do more, but they need to take care of Judith first. Lieutenant Rose arrives in another truck and reports to Mercer that they're all set: everyone is in the back and there's no one to check. The doctors have set up a safe house, but they have to hurry. Mercer calls for everyone to go, stating that they need to get Judith to Tomi . Everyone boards the truck with Princess , Max and Dianne pushing Judith's stretcher. At the safe house, suddenly, there's shouts outside and two gunshots. Looking outside, Mercer sees a man trying to climb the wall, only to be shot by Commonwealth soldiers on Pamela's orders. Mercer tells the others that the soldiers are shooting anyone that climbs the gates and grabs a gun, unwilling to just stand by as people are dying. Mercer informs the Coalition members that the truck is gassed up with enough reserves in the rear to get them home. Mercer and his men can sneak them out the back as Mercer believes that this isn't their fight or their people. \"Yes, they are. And so are you,\" states Ezekiel. Addressing the others, Ezekiel tells them that \"you may not think this place is worth saving, and I get that, given how they treated us. But it's worth it to me. The people are worth it, and I'm not gonna allow them to fall without a fight. Not today. I'm with you. Who else?\" Aaron immediately agrees, stating that they can do more than just save themselves and they need to. Following Ezekiel's lead, everyone agrees to fight to save the Commonwealth. At the gates of the Estates, the crowd desperately begs Pamela to be let in, amongst them Mr. Martens , Mrs. Martens and Mei . On a balcony, Maggie lines up her shot on Pamela, but Negan tells her to hold on as Mercer and his loyalist forces move in, ordering Colonel Vickers and her men to lower their weapons. Pamela orders Vickers to arrest them, but the Coalition forces join Mercer's troops from another angle, creating a standoff. Pamela accuses Mercer of being a traitor, but Mercer states that she's the true traitor and lists Pamela's crimes: disappearing hundreds of citizens, leading the dead to their doorstep, shooting a child and now leaving thousands to die. The banging on the gates grows more frantic as the herd begins to approach the Estates, meaning that the people will die if they're not let inside. Gabriel moves towards the gates despite Vickers orders to stop. Gabriel announces that they're opening the gate and letting everyone inside, threatening to kill anyone who tries to stop him. Vickers threatens to shoot him, but Carol warns her that they will fire back if she does. Pamela orders her men to shoot Gabriel as he reaches the gates and one of them points a gun at his head. Suddenly, Daryl yells for them to stop. \"What the hell you doing?\" Daryl demands. \"We all deserve better than this. You built this place to be like the old world. That was the fuckin' problem.\" Pamela states that if she opens the gates, the dead will get in too, not just the living. Daryl tells her that if she doesn't, Pamela will lose everything anyway. \"We got one enemy. We ain't the walking dead.\" Realizing that Daryl is right, Vickers orders everyone to lower their weapons and give Gabriel the key to the gates. Everyone stands down and Vickers defers to Mercer's command who places Pamela under arrest for high crimes against the people of the Commonwealth. As everyone rushes to help let the people in, Maggie informs Negan that Pamela is getting arrested and Negan tells her that prison is a fate worse than death for someone like Pamela, causing Maggie to relent in shooting her. The crowd rushes in just in the nick of time, amongst them Jerry and Elijah, before the gates are closed, keeping out the herd. Elijah reunites with a relieved Lydia while Jerry desperately looks for his family before Ezekiel reassures his friend that they're safe back in Alexandria and that they will get back out there to help the people that still need their help. Approaching the gates, Pamela notices a zombified Lance Hornsby , Carol's arrow still in his neck, at the front of the herd, reaching through the gates. Pamela approaches Lance, baring her neck and intending to have Lance bite her as a form of suicide . Judith begs Pamela not to go through with it as it's never too late and they have to help everyone still out there. Before Lance can bite Pamela, Maggie shoots him in the head with her sniper rife, putting Lance down. Maggie states that it's time to take the Commonwealth back. With the variants being too dangerous to just lead away, Mercer outlines a new plan as everyone rushes to carry out his orders. As they need to get a vehicle out of the Estates, a mixture of Coalition forces, Commonwealth soldiers and Commonwealth residents, led by Aaron, rush out of the Estates, armed with melee weapons and riot shields with the aim of drawing the herd away and clearing a path, although Mercer warns them not to engage the walkers more than absolutely necessary. Working together, the group holds the line against the herd while Mercer calls in that the vehicle is out of the back gate and on its way to the town square, asking them to let him know when they're clear. Magna reports that they've diverted the walkers and its clear as it's going to get, ordering them to move out. As the combined group continues to fight the walkers, the truck by through the cleared path to the fuel depot where Vickers, Ezekiel, Jerry, Dianne and several Commonwealth soldiers collect the fuel. Max reports in that they've got fuses running to the private sewers under the Estates and they'll finish wiring the rest once they get the fuel back while Princess goes to start the PA system to draw all of the walkers to the Estates. Using Pamela's record player, the song \"Cult of Personality\" is blasted throughout the Commonwealth from the Estates, drawing all of the walkers overrunning the Commonwealth towards it. Elijah helps set up speakers throughout the Estates as Jerry, Ezekiel and Lydia pour fuel down into the sewers and the walkers fighting the forces outside of the Estates begin moving towards it as well. Mercer brings out some dynamite which Eugene and Yumiko help to wire up to drums of fuel placed throughout the Estates and Connie helps to wire up more speakers, unharmed by the loud music due to her deafness. As Max helps to coordinate the efforts, Mercer calls in that they're prepared to open the gates and to let him know when they're ready. Max calls in that they're good to go before she joins the others in retreating to the rendezvous point, the two women acknowledging that they're dead if this plan fails. The gates are opened and the herd floods into the Estates. Once the song ends, the fuses connected to explosives inside of Pamela's house are ignited, detonating the fuel in a chain reaction that obliterates the Estates and the entire herd, saving the Commonwealth. In Alexandria, everyone enjoys a celebration and feast, joined by Mercer, Max and Tomi. Judith gives Dog some of her food and Yumiko raises a toast to Luke. Looking out the window, Daryl sees Negan walking away and the two men exchange a smile and a nod, parting on good terms. Yumiko turns to Magna, telling her \"same\" and Magna kisses her, the two women resuming their romantic relationship. Sitting down, Rosita smiles as she watches the celebration before becoming somber. Noticing Rosita's somber mood, Gabriel joins her, and Rosita tells him that she just wants to remember this perfect moment. In a whisper, Rosita reveals her bite and impending death to Gabriel. Noticing Rosita's behavior and crying, Judith realizes that something's wrong with her and becomes upset, apparently deducing the truth. A year later, Eugene visits a memorial plaque for those lost in the walker invasion bearing Luke, Jules, Rosita, and Marissa Berot 's names and lays down flowers for his lost friends before pressing a kiss to Rosita's name. Eugene joins Max, who is now his wife, and takes their daughter Rosie from her and puts Rosie in her stroller. Ezekiel, now the governor of the Commonwealth with Mercer as his deputy governor, gives a speech attended by Eugene, Max, Princess, Daryl Judith, Kelly, Connie, Magna and Yumiko amongst many others, the latter two now happily married to each other. When Ezekiel introduces Mercer as his deputy governor, Princess loudly cheers for her boyfriend, much to the amusement of Ezekiel, Mercer and the crowd.",
        "Killed Victims[]": "This list shows the victims Yumiko has killed: Casper (Zombified) Ozzy (Zombified, alongside Carol , Daryl , and Michonne ) Alek (Zombified, alongside Carol, Daryl, and Michonne) D.J. (Zombified, alongside Carol, Daryl, and Michonne) Frankie (Zombified, alongside Carol, Daryl, and Michonne) Tammy Rose Sutton (Zombified, alongside Carol, Daryl, and Michonne) Rodney (Zombified, alongside Carol, Daryl, and Michonne) Adeline (Zombified, alongside Carol, Daryl, and Michonne) Enid (Zombified, alongside Carol, Daryl, and Michonne) Tara Chambler (Zombified, alongside Carol, Daryl, and Michonne) Henry (Zombified, alongside Carol, Daryl, and Michonne) Luke Abrams (Caused, alongside Magna , Kelly , and Connie ) At least 4 unnamed Whisperers Numerous counts of zombies and unnamed people",
        "Appearances[]": "",
        "Trivia[]": "Yumiko was credited in \" Guardians \" and \" Scars \" but did not appear in either episode. Yumiko wearing a headband is a nod to her counterpart having bangs in the Comic Series . Yumiko is the ninth LGBT character on the show. The other eight being Tara , Alisha , Aaron , Eric , Denise , Jesus , Magna , and Kelly . Out of those, Yumiko is the fifth lesbian. Yumiko and Magna are also the fourth same-sex couple on the show. Yumiko and Magna have matching rings at the end of \" Rest in Peace \", indicating they were married during the one-year flashforward. That would make them the first lesbian married couple in The Walking Dead franchise, and the fourth married LGBT couple. This also makes them the fourth LGBT married couple in The Walking Dead franchise, after Aaron and Eric Raleigh in the TV Series , Felix Carlucci and Will Campbell in World Beyond , Tim and his husband in the Clementine series, and followed by Rèmy and Julien in Daryl Dixon . Eleanor Matsuura was pregnant during the filming of \" Rest in Peace \". Though it was hidden through most the episode, it was very visible in the one-year flashforward. Eleanor posted on her Twitter account that it is possible that Yumiko became pregnant through in-vitro fertilization so that she can have a baby with Magna, thanks to the Commonwealth’s advanced healthcare system and with help from her brother. Yumiko is the first British character in the TV Series and the third one in The Walking Dead franchise. The first being Oak , the second being Mac , the fourth being Elizabeth Kublek , the fifth being Tomichi Okumura , and the sixth being Lara Croft . Yumiko is one of six characters in the entire franchise to be trilingual as she knows Japanese, English, and ASL. The other five characters who are trilingual are Victor Strand and Daniel Salazar who both speak English, Spanish, and German, Gabriel Stokes who speaks English, Spanish, and ASL, Fanya who speaks English, German, and French, and Eun-Chan who speaks Korean, French, and English. Yumiko is one of eight characters who know ASL, the others being her fellow group members Magna , Luke Abrams , Kelly , and Connie , as well as Carol Peletier , Daryl Dixon , and Gabriel Stokes. Yumiko is one of four characters who knows Japanese, the others being Tomichi Okumura , Nat , and Benjiro . Originally, Yumiko was intended to be half Caucasian and half Japanese, however this idea was later scrapped upon initial casting. [3] Yumiko is one of the fourteen TV Series characters whose comic counterparts lack a known last name. The others being Amy Harrison , Andrea Harrison , Dale Horvath , Carol Peletier , Sophia Peletier , Tyreese Williams , Eric Raleigh , Negan Smith , Lucille Smith , Ezekiel Sutton , Luke Abrams , Maxxine Mercer , and Kayla Brand . Yumiko is one of twelve characters to survive the TV Series who also survive in the Comic Series , the others being Maggie Rhee , Michonne Grimes , Eugene Porter , Aaron , Hershel Rhee , Negan Smith , Magna , Lydia , Juanita Sanchez , Michael Mercer , and Pamela Milton . The name Yumiko means \"archery bow\" (弓) ( yumi ) and \"child\" (子) ( ko ). The kanji \"弓\" refers to Yumiko's weapon of choice, like her comic counterpart . Yumiko's surname Okumura means \"back, inner part, heart, interior\" (奥) ( oku ) and \"town, village\" (村) ( mura ).",
        "References[]": "",
        "Name": "Yumiko Okumura"
    }
]